[{"Date":"6/1/1994","Season":"1993-1994","Details":"The NBA fined Nick Van Exel (LAL) $5,000 for playing in an "},
{"Date":"6/21/1994","Season":"1993-1994","Details":"The NBA fined Chicago $100,000 for permitting Michael Jordan to change his jersey number from #45 to #23 during the playoffs. The team was fined an initial $25,000 when Jordan wore #23 in game 2 of the Orlando- Chicago series and warned that additional punishment would be assessed after the playoffs ended if Jordan continued to wear #23. The fine amounts to $25,000 per game for games 3-6 of the series."},
{"Date":"9/30/1994","Season":"1994-1995","Details":"The NBA reinstated Roy Tarpley. Tarpley was given a "},
{"Date":"10/10/1994","Season":"1994-1995","Details":"Seattle has added an additional year worth $20 million to Shawn Kemp's contract. Thus, Kemp ended his hold-out. He was fined $1,200 for missing the first 4 days of training camp."},
{"Date":"10/15/1994","Season":"1994-1995","Details":"Portland has suspended indefinitely without pay hold-out Clifford Robinson."},
{"Date":"11/2/1994","Season":"1994-1995","Details":"Dennis Rodman's (SA) suspension is no longer indefinite. He will miss 3 games and is currently expected to appear in November 12th's game vs New York. 11/1/94 San Antonio suspended without pay Dennis Rodman for "},
{"Date":"11/7/1994","Season":"1994-1995","Details":"Dennis Rodman (SA) did not show up at Wednesday's practice, as he was scheduled to appear. The Spurs have suspended Rodman without pay. Rodman had been on a paid leave of absence."},
{"Date":"11/10/1994","Season":"1994-1995","Details":"Dennis Rodman's (SA) suspension ended and he decided to celebrate by skipping Thursday's practice. The GM and coach have scheduled a meeting with Rodman for today."},
{"Date":"11/11/1994","Season":"1994-1995","Details":"Dennis Rodman (SA) met with San Antonio's GM for about 1/2 hour yesterday and the two did not resolve their differences. Thus, Rodman is still suspended (indefinitely)."},
{"Date":"11/12/1994","Season":"1994-1995","Details":"Dennis Rodman (SA) is not listed as suspended. He has been given an indefinite leave of absence - it was mutually agreed upon between the team and Rodman."},
{"Date":"11/16/1994","Season":"1994-1995","Details":"The league fined Chicago coach Phil Jackson $10,000 for criticizing a ref."},
{"Date":"11/29/1994","Season":"1994-1995","Details":"Charlotte suspended David Wingate for 2 days for violating an undisclosed team policy."},
{"Date":"11/29/1994","Season":"1994-1995","Details":"Alonzo Mourning (Cha) was fined $5,000 by the league for verbally abusing the refs and not leaving the court in a timely manner in Wednesday's Cha-Bos game."},
{"Date":"12/6/1994","Season":"1994-1995","Details":"Vernon Maxwell (Hou) was fined $5,000 for berating the officials and not leaving the court in a timely manner after being tossed from Thursday's game against Golden State."},
{"Date":"12/10/1994","Season":"1994-1995","Details":"San Antonio removed Dennis Rodman from the suspended list."},
{"Date":"12/12/1994","Season":"1994-1995","Details":"Jay Humphries (Uta) was fined $3,500 by the league for a flagrant elbow thrown during Thursday's game against San Antonio."},
{"Date":"12/13/1994","Season":"1994-1995","Details":"Dallas suspended Roy Tarpley without pay for insubordination. Dallas set Roy Tarpley's suspension to 1 game (tonight vs Boston)."},
{"Date":"12/26/1994","Season":"1994-1995","Details":"Minnesota suspended Isaiah Rider for Monday's game vs LA Clippers for violating team rules. Rider missed the team's mandatory shoot around on Monday morning."},
{"Date":"12/29/1994","Season":"1994-1995","Details":"Seattle suspended Vincent Askew without pay for Thursday's game vs the LA Lakers. He was suspended for refusing to re-enter the game Wednesday night vs Philadelphia."},
{"Date":"12/29/1994","Season":"1994-1995","Details":"New Jersey fined Kenny Anderson $500 for missing Wednesday's practice."},
{"Date":"12/30/1994","Season":"1994-1995","Details":"Shawn Bradley (Phi) was fined $4,000 for a flagrant elbow thrown in Wednesday's game vs Seattle."},
{"Date":"1/4/1995","Season":"1994-1995","Details":"Philadelphia suspended B.J. Tyler for one game for violating team policy."},
{"Date":"1/5/1995","Season":"1994-1995","Details":"Golden State suspended Latrell Sprewell for one game for missing practice."},
{"Date":"1/9/1995","Season":"1994-1995","Details":"Seattle fined Kendall Gill for missing Sunday's practice. Gill had missed a flight from Chicago."},
{"Date":"1/13/1995","Season":"1994-1995","Details":"The NBA fined Reggie Miller (Ind) $5,000 for trying to start a fight with Charles Smith (NY) after Tuesday's NY-Ind game."},
{"Date":"1/19/1995","Season":"1994-1995","Details":"The NBA suspended Olden Polynice (Sac), Rod Strickland (Por), Mark Bryant (Por), Clyde Drexler (Por), James Edwards (Por), Harvey Grant (Por), and Jerome Kersey (Por) for one game. Strickland and Polynice were suspended and fined $5,000 for fighting during Tuesday's Sac-Por game. Polynice served his suspension Thursday (last night) vs GS and Strickland served his suspension Thursday vs Pho. The other 5 Blazers were suspended and fined $2,500 for leaving the bench during the fight. Bryant and Drexler missed Thursday's game vs Pho and Edwards, Grant, and Kersey will miss Friday's game vs LAC. Players receive an automatic suspension for leaving the bench, a new rule this season that came about due to two ugly brawls during the 1994 playoffs. Which games the 5 who left the bench miss was determined alphabetically by their last names (the league allows the suspensions to be split among games if 5 or more players are suspended for leaving the bench so that the team stays above the 8 player minimum for a game)."},
{"Date":"1/24/1995","Season":"1994-1995","Details":"Sam Mitchell (Ind) was fined $4,000 by the league for shoving Dennis Rodman (SA) near the end of the SA-Ind game from last Sunday."},
{"Date":"1/26/1995","Season":"1994-1995","Details":"Scottie Pippen (Chi) has been suspended 1 game and fined $6,000 by the"},
{"Date":"1/31/1995","Season":"1994-1995","Details":"Golden State suspended Clifford Rozier for one game for missing practice. Rozier served his suspension Tuesday night vs New York."},
{"Date":"2/3/1995","Season":"1994-1995","Details":"The NBA fined Tom Chambers (Uta) $6,000 for throwing an elbow in the Utah-Denver game. Brian Williams (Den) was also fined $2,500 and suspended for 1 game for leaving the bench during the incident. Williams served his suspension during the Den-LAL game."},
{"Date":"2/3/1995","Season":"1994-1995","Details":"Washington suspended Kevin Duckworth for 3 games for not staying in good physical condition."},
{"Date":"2/8/1995","Season":"1994-1995","Details":"The league has suspended Vernon Maxwell (Hou) for a minimum of 10 games and fined him $20,000 for going into the stands and punching a fan during Monday's Hou-Por game. Maxwell will have to meet with league officials later to determine if he should be allowed to return after the 10 games or if his suspension should be extended. The fine ties the highest fine in league history and the suspension is the 2nd longest in league history [Kermit Washington was suspended for 28 games for punching Rudy Tomjanovich in 1977]. The suspension will cost Maxwell over $200,000 in lost salary."},
{"Date":"2/16/1995","Season":"1994-1995","Details":"NBA suspended Danny Ainge (Pho) for 1 game and fined him $7,500 for hitting Chris Dudley (Por) in the face during the Por-Pho game Wednesday night. Ainge will miss Friday's game vs Golden State."},
{"Date":"2/17/1995","Season":"1994-1995","Details":"Washington activated Kevin Duckworth from the suspended list."},
{"Date":"2/25/1995","Season":"1994-1995","Details":"The NBA suspended Shaquille O'Neal (Orl) for 1 game and fined him $5,000 for punching Eric Montross in Friday's Boston-Orlando game. O'Neal will miss Sunday's game vs Chicago."},
{"Date":"2/27/1995","Season":"1994-1995","Details":"Vernon Maxwell (Hou) has completed his 10 game suspension and has been reinstated by the league. Maxwell met with league officials on Friday."},
{"Date":"2/28/1995","Season":"1994-1995","Details":"Washington suspended Kevin Duckworth indefinitely for not maintaining playing shape."},
{"Date":"2/28/1995","Season":"1994-1995","Details":"The NBA fined Seattle coach George Karl $10,000 for remarks regarding the refs after the Sea-Cha game on Monday."},
{"Date":"3/3/1995","Season":"1994-1995","Details":"Washington activated Kevin Duckworth from the suspended list."},
{"Date":"3/7/1995","Season":"1994-1995","Details":"Atlanta suspended Kevin Willis for one game for not complying with the team's rehabilitation program. Willis has been suffering from back problems."},
{"Date":"3/7/1995","Season":"1994-1995","Details":"Minnesota fined Isaiah Rider for missing an injury rehabilitation session."},
{"Date":"3/13/1995","Season":"1994-1995","Details":"The NBA has cleared Richard Dumas (Pho) to resume playing in the league. Dumas had been suspended without pay by the league for violating the league's anti-drug policy. Phoenix has 7 days to activate Dumas, else he becomes a free agent."},
{"Date":"3/14/1995","Season":"1994-1995","Details":"Apparently Phoenix has done a complete 180 on the Richard Dumas situation. Despite comments in that past that Dumas would never play for Phoenix again, Phoenix activated Dumas from the suspended list and he played 2 minutes and scored 4 points in last night's game vs Detroit. To make room for Dumas, Phoenix placed Wayman Tisdale on IR with a strained left rib."},
{"Date":"3/16/1995","Season":"1994-1995","Details":"New York placed Anthony Mason on the suspended list for conduct detrimental to the team and violation of team rules. A player placed on the suspended list must miss at least 5 games."},
{"Date":"3/26/1995","Season":"1994-1995","Details":"New York activated Anthony Mason from the suspended list."},
{"Date":"3/28/1995","Season":"1994-1995","Details":"The NBA fined Ken Norman (Atl) $4,000 for failing to leave the court in a timely manner after being ejected from the Atl-Chi game on March 25."},
{"Date":"4/3/1995","Season":"1994-1995","Details":"Golden State suspended Latrell Sprewell for 2 games without pay for conduct determental to the team."},
{"Date":"4/4/1995","Season":"1994-1995","Details":"The NBA fined Rick Mahorn (NJ) $7,000 and Patrick Ewing (NY) $3,500 for their altercation in Sunday's NY-NJ game. Derek Harper (NY) was also fined $5,000 for comments made to the refs after being ejected (while he was at the free throw line)."},
{"Date":"4/15/1995","Season":"1994-1995","Details":"The NBA suspended Charles Barkley (Pho) for 1 game for exceeding the league flagrant foul limit. Barkley received his 6th flagrant foul of the season during Friday's Phoenix-Denver game. Barkley served his suspension during the LA Lakers game Saturday night."},
{"Date":"4/17/1995","Season":"1994-1995","Details":"The LA Clippers have indefinitely suspended Lamond Murray."},
{"Date":"4/18/1995","Season":"1994-1995","Details":"The LA Clippers reinstated Lamond Murray after a one-game suspension."},
{"Date":"4/20/1995","Season":"1994-1995","Details":"The NBA fined Sherman Douglas (Bos) $4,000 for not leaving the court in a timely manner and verbally abusing the refs after Monday's Bos-NJ game."},
{"Date":"5/1/1995","Season":"1994-1995","Details":"The league handed out the fines for Sunday's San Antonio-Denver game. Dennis Rodman (SA) was fined $7,500 for undercutting Dikembe Mutombo. Greg Grant (Den) was fined $5,000 for his flagrant push and Avery Johnson (SA) was fined $2,500 for his retaliation. Jack Haley (SA) was fined $7,500 for his flagrant foul on Greg Grant. Haley and Johnson also received an automatic $1,000 fine for their ejections."},
{"Date":"5/4/1995","Season":"1994-1995","Details":"Bernie Bickerstaff (coach Den) was fined $10,000 for verbally abusing the refs and not leaving the court in a timely manner after being ejected from Tuesday's SA-Den game."},
{"Date":"5/11/1995","Season":"1994-1995","Details":"The NBA fined Michael Jordan $5,000 for wear non-conforming shoes (his were mostly white while the rest of the Bulls wore black) and fined the Chicago Bulls $25,000 for permitting Jordan to wear #23 instead of his roster listed #45. The league most be notified in advance and approve any number changes. The league also warned the Bulls that if Jordan continues to wear #23, they will continue to assess fines and the infraction will be dealt with "},
{"Date":"10/19/1995","Season":"1995-1996","Details":"The NBA fined Chris Webber (Was) $7,500 and suspended him for the first game of the regular season and fined Luc Longley $7,500 and suspended him for the first game of the regular season for fighting in October 17's Was-Chi game. Rasheed Wallace was also fined $5,000 for throwing the ball at Longley during the fight."},
{"Date":"10/19/1995","Season":"1995-1996","Details":"The NBA fined Oliver Miller (Tor) $5,000 and suspended him for the first game of the regular season for leaving the bench to confront Shawn Bradley during October 14's Tor-Phi game. Toronto was fined a matching $5,000 for Miller's action."},
{"Date":"10/27/1995","Season":"1995-1996","Details":"The NBA fined Matt Geiger (Mia) $10,000 and suspended him for the first game of the regular season for what the NBA ruled as a flagrant foul on Shaquille O'Neal during the Orl-Mia game on October 24. No foul was called on the play during the game."},
{"Date":"10/31/1995","Season":"1995-1996","Details":"The NBA fined Charles Oakley (NY) $6,000 and suspended him for one game for throwing a punch during a NY-Phi game Oct. 29."},
{"Date":"10/31/1995","Season":"1995-1996","Details":"The NBA fined Vernon Maxwell $3,000 for verbally abusing the ref."},
{"Date":"11/2/1995","Season":"1995-1996","Details":"Dallas placed Donald Hodge on IR and placed Roy Tarpley on the suspended list. Tarpley has yet to pass his physical and must complete a timed conditioning test."},
{"Date":"11/6/1995","Season":"1995-1996","Details":"The NBA fined Chris Mills (Cle) $10,000 and suspended him for one game and fined Predrag Danilovic (Mia) $3,500 and suspended him for one game for fighting in Friday's Cle-Mia game."},
{"Date":"11/6/1995","Season":"1995-1996","Details":"Dallas moved Roy Tarpley from the suspended list to IR."},
{"Date":"11/10/1995","Season":"1995-1996","Details":"The NBA fined Larry Brown (coach Ind) $11,000 and suspended him for 1 game for verbally abusing the refs and refusing to leave the court in a timely manner. Indiana was also fined $50,000 for Brown's actions."},
{"Date":"11/11/1995","Season":"1995-1996","Details":"As a result of the Indiana-Sacramento brawl during Friday's game, the NBA has fined and suspended a one game record of 16 players. Dale Davis (Ind) had Michael Smith (Sac) were fined $20,000 and suspended for 2 games. Duane Causwell (Sac) was fined $7,500 and suspended for 1 game. Travis Best (Ind), Adrian Caldwell (Ind), Duane Ferrell (Ind), Fred Hoiberg (Ind), Mark Jackson (Ind), Reggie Miller (Ind), Dwayne Schintzius (Ind), Tyus Edney (Sac), Byron Houston (Sac), Sarunas Marciulionis (Sac), Olden Polynice (Sac), Lionel Simmons (Sac), and Walt Williams (Sac) were automatically fined $2,500 and suspended for 1 game for leaving the bench. Since the league requires 8 dressed players per game, the suspensions were divided amongst different games. Besides M Smith and D Davis, the suspensions will be served alphabetically. Causwell, Edney, Houston, and M Smith missed last night's (Saturday's) game at New Jersey; Marciulionis, Simmons, M Smith, and Polynice will miss Tuesday's game vs the LA Lakers; and W Williams will miss Thursday's game at Portland. Best Caldwell, D Davis, and Ferrell will miss Wednesday's game at Miami; D Davis, Hoiberg, M Jackson, and Miller will miss Thursday's game at Orlando; and Schintzius will miss Saturday's game vs Seattle."},
{"Date":"12/1/1995","Season":"1995-1996","Details":"The NBA fined Charles Oakley (NY) $7,500 and Larry Johnson (Cha) $2,500 for their scuffle in the Cha-NY game on November 29."},
{"Date":"12/1/1995","Season":"1995-1996","Details":"The NBA fined Hakeem Olajuwon (Hou) $5,000 for hitting a ref with the ball."},
{"Date":"12/5/1995","Season":"1995-1996","Details":"The NBA fined Kurt Thomas (Mia) $10,000 and suspended him for one game and fined Pervis Ellison (Bos) $2,500 for fighting in the Mia-Bos game on Monday. Alton Lister (Bos) and Eric Williams (Bos) were each fined $2,500 and suspended for one game for leaving the bench during the fight."},
{"Date":"12/6/1995","Season":"1995-1996","Details":"The NBA dismissed Roy Tarpley (Dal) from the league for violating his aftercare program. Tarpley tested positive for alcohol consumption. Tarpley's contract is null and void. He was scheduled to make $3.9 million this season (he already received $665,582), 4.8 million each of the next 3 season, and $4.5 million in 99-00. Dallas is free to use Tarpley's money for trade purposes or free agent signings."},
{"Date":"12/9/1995","Season":"1995-1996","Details":"The NBA fined Ricky Pierce $5,000 and gave him a one game suspension for pushing a ref during Friday's Ind-NJ game."},
{"Date":"12/20/1995","Season":"1995-1996","Details":"The NBA fined Miami $25,000 for failing to make the players available to the media prior to Tuesday's game vs New York."},
{"Date":"12/21/1995","Season":"1995-1996","Details":"The NBA fined Chris Gatling (GS) $5,000 and Don MacLean (Den) $3,500 and suspended each for one game for fighting in Wednesday's Den-GS game."},
{"Date":"12/22/1995","Season":"1995-1996","Details":"Boston moved Thomas Hamilton from IR to the suspended list."},
{"Date":"1/12/1996","Season":"1995-1996","Details":"The NBA fined Pat Riley (Mia) $10,000 for criticizing the refs following Wednesday's Por-Mia game."},
{"Date":"1/12/1996","Season":"1995-1996","Details":"The NBA fined Dennis Rodman (Chi) $5,000 for verbally abusing the refs and failing to leave the court in a timely manner during Wednesday's Chi-Sea game."},
{"Date":"1/19/1996","Season":"1995-1996","Details":"The NBA fined Juwan Howard (Was) $12,000 and Bimbo Coles (Mia) $6,000 and suspended each for one game for fighting in the Mia-Was game on January 17."},
{"Date":"1/30/1996","Season":"1995-1996","Details":"The NBA fined Butch Beard (NJ) $7,500 for criticizing the refs after Saturday's LAL-NJ game."},
{"Date":"1/30/1996","Season":"1995-1996","Details":"The NBA fined Tim Hardaway (GS) $5,000 for making an obscene gesture at the refs in Saturday's GS-Uta game."},
{"Date":"1/30/1996","Season":"1995-1996","Details":"The NBA fined Shaquille O'Neal (Orl) $5,000 for failing to leave the court in a timely manner and verbally abusing the refs in Saturday's Ind-Orl game."},
{"Date":"2/2/1996","Season":"1995-1996","Details":"The NBA fined Jalen Rose (Den) $7,500 and Sherman Douglas (Mil) $4,000 and suspended each for one game for fighting in Thursday's Den-Mil game."},
{"Date":"2/15/1996","Season":"1995-1996","Details":"Charles Barkley (Pho) was fined $5,000 for slamming the ball at the feet of the ref after Tuesday night's loss to Seattle."},
{"Date":"2/15/1996","Season":"1995-1996","Details":"Sean Higgins (Phi) was fined $5,000 for making an obscene gesture following his ejection in February 7th's Phi-Ind game."},
{"Date":"2/22/1996","Season":"1995-1996","Details":"The NBA suspended Charles Smith (SA) for one game and fined him $5,000 for punching Chris Gatling (then of GS) during Wednesday's SA-GS game."},
{"Date":"2/22/1996","Season":"1995-1996","Details":"Portland suspended Rod Strickland for one game for "},
{"Date":"2/22/1996","Season":"1995-1996","Details":"Boston moved Thomas Hamilton from IR to the suspended list."},
{"Date":"2/23/1996","Season":"1995-1996","Details":"The NBA fined Doug Edwards (Van) $3,500 for throwing a flagrant elbow at Detlef Schrempf (Sea) during the Sea-Van game on February 10."},
{"Date":"2/24/1996","Season":"1995-1996","Details":"Rod Strickland (Por) skipped the team's Saturday practice and Portland announced that Strickland's suspension would be extended indefinitely."},
{"Date":"2/26/1996","Season":"1995-1996","Details":"The NBA fined J.R. Reid (NY) $10,000 and suspended him for 2 games for throwing a flagrant elbow that knocked out 2 of A.C. Green's (Pho) teeth during Sunday's Pho-NY game."},
{"Date":"2/27/1996","Season":"1995-1996","Details":"The NBA fined Juwan Howard (Was) $5,000 for making an obscene gesture after being ejected from Tuesday's Was-Cha game."},
{"Date":"2/28/1996","Season":"1995-1996","Details":"The NBA fined Michael Jordan (Chi) and Charles Barkley (Pho) $10,000 each for not attending the media session for the All-Star weekend."},
{"Date":"3/6/1996","Season":"1995-1996","Details":"The NBA fined Charles Barkley (Pho) $7,500 for criticizing the refs following Sunday's Pho-Dal game."},
{"Date":"3/12/1996","Season":"1995-1996","Details":"The NBA suspended Mahmoud Abdul-Rauf (Den) indefinitely for refusing to stand during the national anthem. Deputy commissioner Russ Granik: "},
{"Date":"3/12/1996","Season":"1995-1996","Details":"The NBA fined Isaiah Rider (Min) $5,000 for failing to leave the court in a timely manner after being ejected from Sunday's Uta-Min game."},
{"Date":"3/13/1996","Season":"1995-1996","Details":"Boston activated Thomas Hamilton from the suspended list."},
{"Date":"3/14/1996","Season":"1995-1996","Details":"The NBA has lifted the Mahmoud Abdul-Rauf's (Den) suspension as Abdul-Rauf has agreed to standing during the national anthem."},
{"Date":"3/14/1996","Season":"1995-1996","Details":"The NBA fined Gary Payton (Sea) $6,000 and suspended him for one game for head butting Joe Wolf (Orl) during Wednesday's Sea-Orl game."},
{"Date":"3/18/1996","Season":"1995-1996","Details":"The NBA fined Dennis Rodman (Chi) $20,000 and suspended him for 6 games for head-butting a ref and failing to leave the court in a timely manner after being ejected from Saturday's Chi-NJ game."},
{"Date":"3/20/1996","Season":"1995-1996","Details":"The NBA fined Greg Anthony (Van) $5,000 and suspended him for 1 game for throwing a punch at Shawn Bradley (NJ) during Tuesday's NJ-Van game."},
{"Date":"3/20/1996","Season":"1995-1996","Details":"The NBA fined Doug Collins (Det) $5,000 for instructing his players not to defend on Orlando's final play and leaving the court before the game clock had expired during Tuesday's Orl-Det game. Anthony Bowie (Orl) called timeout with 3 seconds left and Orlando up by 20 points to set up a play so he could get his 10th assist and first career triple-double."},
{"Date":"3/21/1996","Season":"1995-1996","Details":"The NBA fined Jerry Stackhouse (Phi) $7,500 and suspended him for 2 games for throwing punches at Jeff Hornacek (Uta) during Wednesday's Uta-Phi game."},
{"Date":"3/21/1996","Season":"1995-1996","Details":"The LA Lakers suspended Cedric Ceballos for one game for missing the team's charter flight to Seattle."},
{"Date":"3/22/1996","Season":"1995-1996","Details":"The LA Lakers suspended indefinitely without pay Cedric Ceballos. Ceballos has not been in touch with the team for a few days, but has contacted his agent."},
{"Date":"3/25/1996","Season":"1995-1996","Details":"The LA Lakers activated Cedric Ceballos from the suspended list."},
{"Date":"4/10/1996","Season":"1995-1996","Details":"The NBA fined Nick Van Exel (LAL) a record $25,000 and suspended him for 7 games for shoving a ref during Friday's LAL-Den game."},
{"Date":"4/11/1996","Season":"1995-1996","Details":"The NBA fined Horace Grant (Orl) $5,000 and suspended him for 1 game for punching Danny Ferry (Cle) during Wednesday's Orl-Cle game."},
{"Date":"4/15/1996","Season":"1995-1996","Details":"The NBA fined the Miami Heat $25,000 for failing to make the players available to the media prior to Wednesday's Cha-Mia game."},
{"Date":"4/15/1996","Season":"1995-1996","Details":"The NBA fined Magic Johnson (LAL) $10,000 and suspended him for 3 games for bumping a ref in Sunday's LAL-Pho game."},
{"Date":"4/23/1996","Season":"1995-1996","Details":"The NBA fined Ledell Eackles (Was) $7,500 and suspended him for one game for throwing a punch at James Edwards (Chi) in Friday's Was-Chi game. Eackles will miss the first game of the 1995-96 season."},
{"Date":"4/23/1996","Season":"1995-1996","Details":"The NBA fined Shawn Kemp (Sea) and Tom Hammonds (Den) $7,500 and suspended each for one game for their altercation in Friday's Sea-Den game. Kemp will miss the first game of the playoffs and Hammonds will miss the first game of the 1996-97 season."},
{"Date":"4/29/1996","Season":"1995-1996","Details":"The NBA fined Dennis Rodman (Chi) $5,000 for making an obscene gesture at a ref after being ejected from Sunday's Chi-Mia game."},
{"Date":"5/8/1996","Season":"1995-1996","Details":"The NBA fined Hakeem Olajuwon (Hou) $5,000 for throwing an elbow at Detlef Schrempf (Sea) in game one of the Sea-Hou series on Saturday."},
{"Date":"5/10/1996","Season":"1995-1996","Details":"The NBA fined Jim Cleamons (Chi assistant coach) $2,50 for initiating a verbal confrontation with Patrick Ewing in Tuesday's Chi-NY game 2."},
{"Date":"6/11/1996","Season":"1995-1996","Details":"Vincent Askew (Sea) was fined $10,000 for not appearing at a mandatory media session on Monday."},
{"Date":"10/7/1996","Season":"1996-1997","Details":"The LA Clippers suspended indefinitely Stanley Roberts for conduct detrimental to the team."},
{"Date":"10/18/1996","Season":"1996-1997","Details":"The LA Clippers ended their suspension of Stanley Roberts."},
{"Date":"10/28/1996","Season":"1996-1997","Details":"The NBA has fined Charles Oakley (NY) $10,000 and suspended him for 2 games and fined Charles Barkley (Hou) $5,000 and suspended him for 1 game for their fight in Friday's NY-Hou game. The suspensions will start with the first game of the season."},
{"Date":"10/28/1996","Season":"1996-1997","Details":"Portland has suspended Isaiah Rider for one game for missing Sunday's pre-season game. Rider claims that that a cab had taken him to the wrong hotel."},
{"Date":"10/31/1996","Season":"1996-1997","Details":"Denver suspended Jeff McInnis for conduct detrimental to the team."},
{"Date":"10/31/1996","Season":"1996-1997","Details":"Golden State suspended Rony Seikaly for his holdout."},
{"Date":"11/2/1996","Season":"1996-1997","Details":"Golden State released Anthony Harris, placed Lou Roe and Andrew DeClercq on IR, and placed Marcus Mann on the suspended list."},
{"Date":"11/8/1996","Season":"1996-1997","Details":"Denver placed LaPhonso Ellis on IR and lift the suspension from Jeff McInnis."},
{"Date":"11/18/1996","Season":"1996-1997","Details":"The NBA fined Reggie Miller (Ind) $10,000 and Larry Brown (Ind coach) $5,000 for comments they made about the refs following Thursday's Ind-Hou game."},
{"Date":"11/21/1996","Season":"1996-1997","Details":"Dallas suspended without pay Tony Dumas for one game and fined him $1,000 for skipping Wednesday's practice."},
{"Date":"12/7/1996","Season":"1996-1997","Details":"The NBA fined Larry Johnson (NY) $5,000 and suspended him for one game for throwing a punch at Keith Askins (Mia) during Friday's Mia-NY game."},
{"Date":"12/9/1996","Season":"1996-1997","Details":"The NBA fined George Karl (Sea coach) $7,500 for verbally abusing the refs and refusing to leave the court in a timely manner during Thursday's Sea-Min game."},
{"Date":"12/10/1996","Season":"1996-1997","Details":"Chicago suspended without pay Dennis Rodman for 2 games for a profanity laced ref bashing interview following the Tor-Chi game."},
{"Date":"12/12/1996","Season":"1996-1997","Details":"Portland suspended Isaiah Rider for one game for walking out of Wednesday's practice."},
{"Date":"12/20/1996","Season":"1996-1997","Details":"The NBA fined Charles Barkley (Hou) $7,500 and suspended him for 2 games and fined Clyde Drexler (Hou) $5,000 and suspended him for 1 game for making contact with a ref during Thursday's Hou-SA game. Barkley accidentally cut the ref's nose."},
{"Date":"1/3/1997","Season":"1996-1997","Details":"Golden State suspended Donyell Marshall for one game for a verbal altercation with two of Golden State's coaches."},
{"Date":"1/6/1997","Season":"1996-1997","Details":"Phoenix suspended Robert Horry for 2 games without pay for throwing a towel at coach Danny Ainge after he was pulled during Sunday's Pho-Bos game."},
{"Date":"1/10/1997","Season":"1996-1997","Details":"Portland suspended Clifford Robinson for one game for calling the coach a bad name after Wednesday's Mia-Por game."},
{"Date":"1/17/1997","Season":"1996-1997","Details":"The NBA fined Dennis Rodman (Chi) $25,000 and suspended him through at least the All-Star game for kicking a baseline cameraman during Wednesday's Min-Chi game. Rodman will miss at least 11 games. NBA commissioner David Stern: "},
{"Date":"1/24/1997","Season":"1996-1997","Details":"Utah suspended Chris Morris for one game for breaking team rules."},
{"Date":"1/27/1997","Season":"1996-1997","Details":"Philadelphia fined Derrick Coleman for missing Saturday's game in Detoit and Monday's practice in Philly. Coleman is on IR."},
{"Date":"1/28/1997","Season":"1996-1997","Details":"Dallas suspended Chris Gatling for one game for insubordination."},
{"Date":"2/4/1997","Season":"1996-1997","Details":"David Stern announced that Dennis Rodman (Chi) will be reinstated after he completes the rest of his 11 game suspension (2 more games)."},
{"Date":"2/15/1997","Season":"1996-1997","Details":"The NBA fined Shawn Kemp (Sea) $3,000 and suspended him for 1 game for throwing a punch at Kevin Willis (Hou) and fined Charles Barkley (Hou) $2,500 and suspended him for 1 game for leaving the bench during the altercation in Friday's Hou-Sea game. Leaving the bench is an automatic fine and suspension."},
{"Date":"2/19/1997","Season":"1996-1997","Details":"NBA ref Mike Mathis became the 3rd ref indicted on tax-evasion charges. George Toliver and Hank Armstrong are the other refs that have been indicted so far. The government's investigation concerns the refs downgrading 1st class airline tickets and pocketing the difference. Mathis' amount pocketed is believed to be nearly $70,000. Any ref indicted is automatically suspended by the league. Other refs are being investigated."},
{"Date":"2/19/1997","Season":"1996-1997","Details":"The NBA fined Darrell Walker (Tor coach) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner during Monday's Tor-Ind game."},
{"Date":"3/4/1997","Season":"1996-1997","Details":"The NBA fined Dennis Rodman (Chi) $7,500 and suspended him for one game for striking Joe Wolf (Mil) in the groin during Monday's Chi-Mil game."},
{"Date":"3/9/1997","Season":"1996-1997","Details":"Portland suspended Dontonio Wingfield for one game for conduct determental to the team."},
{"Date":"3/10/1997","Season":"1996-1997","Details":"San Antonio suspended Vernon Maxwell for one game for gestures and body language made during Saturday's SA-Ind game at Indiana."},
{"Date":"3/10/1997","Season":"1996-1997","Details":"The NBA fined Armon Gilliam (Mil) $7,500 for his flagrant foul committed against Bob Sura in Saturday's Cle-Mil game."},
{"Date":"3/22/1997","Season":"1996-1997","Details":"New York suspended John Starks for one game for arguments between Starks and coach Jeff Van Gundy."},
{"Date":"3/22/1997","Season":"1996-1997","Details":"The NBA fined Nick Van Exel (LAL) $10,000 for his comments regarding the refs after Friday's LAL-Mia game."},
{"Date":"3/26/1997","Season":"1996-1997","Details":"The NBA fined John Calipari (NJ coach) $25,000 for a hispanic racial slur aimed at a newspaper columnist."},
{"Date":"3/26/1997","Season":"1996-1997","Details":"The NBA fined David Halberstam (Mia broadcaster) $2,500 for a comment referring to slaves during a broadcast."},
{"Date":"4/3/1997","Season":"1996-1997","Details":"Orlando fined Brian Shaw $2,000 for flipping the bird with both hands at a fan in Orlando at the end of Tuesday's Philadelphia game."},
{"Date":"4/5/1997","Season":"1996-1997","Details":"Seattle fined Shawn Kemp an undisclosed amount for failing to notify the team that he would miss practice Friday."},
{"Date":"4/14/1997","Season":"1996-1997","Details":"The NBA fined Alonzo Mourning (Mia) $7,500, Buck Williams (NY) $5,000, and Charles Oakley (NY) $4,000 for their scuffle in Saturday's NY-Mia game."},
{"Date":"4/15/1997","Season":"1996-1997","Details":"The NBA fined Lorenzen Wright (LAC) $5,000 and suspended him for one game for throwing an elbow at Shawn Bradley (Dal) during Monday's LAC-Dal. Wright was ejected from that game with a flagrant foul 2."},
{"Date":"4/17/1997","Season":"1996-1997","Details":"Portland fined Isaiah Rider Thursday for refusing to enter Wednesday's Por-Den game in the 2nd quarter. Rider did not start in that game due to being late for two practices."},
{"Date":"4/28/1997","Season":"1996-1997","Details":"The NBA fined Sam Mitchell (Min) $10,000 for his flagrant foul 2 against Kevin Willis (Hou) during Saturday's Min-Hou game. Willis was also fined $7,500 for his flagrant foul 1 of elbowing Mitchell in the head during the game."},
{"Date":"5/8/1997","Season":"1996-1997","Details":"The NBA fined Chicago $25,000 for failing to make the players available to the media following Wednesday's practice."},
{"Date":"5/13/1997","Season":"1996-1997","Details":"The NBA fined Brian Williams (Chi) $5,000 for making an obscene gesture at the crowd during Sunday's Chi-Atl game."},
{"Date":"5/15/1997","Season":"1996-1997","Details":"The NBA handed out the fines and suspensions for Wednesday's NY-Mia fight. P.J. Brown (Mia) was fined $10,000 and suspended for 2 games. If the NY-Mia series does not go to 7 games, his 2nd game suspension will be moved to the first game of the 97-98 season. Charlie Ward (NY) was fined $6,000 and suspended for 1 game. Patrick Ewing (NY), Allan Houston (NY), Larry Johnson (NY), and John Starks (NY) were fined $2,500 and suspended for 1 game for leaving the bench. Because playoff teams are required to dress 9 players, Ward, Ewing, and Houston will miss game 6 and Johnson and Starks will miss game 7 or game 1 vs Chicago. The games for the suspension of the players who left the bench was determined alphabetically. Starks was also fined $5,000 for making an obscene gesture at the crowd. Dontae' Jones, who is not on the Knick's playoff roster, also left the bench and has been restricted from sitting on the bench for the rest of the playoffs and has been suspended for the first game of the 97-98 season."},
{"Date":"5/16/1997","Season":"1996-1997","Details":"The NBA fined Kevin Willis (Hou) $10,000 for elbowing Shawn Kemp (Sea) in the mouth and fined Kemp $5,000 for pushing Willis' head."},
{"Date":"5/22/1997","Season":"1996-1997","Details":"The NBA fined Chicago $50,000 for not making their players available to the media after Wednesday's practice."},
{"Date":"5/28/1997","Season":"1996-1997","Details":"The NBA fined Alonzo Mourning (Mia) and Dennis Rodman (Chi) $5,000 each for their clashes in Monday's Chi-Mia game."},
{"Date":"6/12/1997","Season":"1996-1997","Details":"The NBA fined Dennis Rodman (Chi) $50,000 for his obscene and insensitive remarks regarding Mormons."},
{"Date":"10/3/1997","Season":"1997-1998","Details":"The NBA has suspended Isaiah Rider (Por) for the first two games of the regular season for being convicted of possession of marijuana and pleading no contest to possession of illegal cellular phones this summer."},
{"Date":"10/3/1997","Season":"1997-1998","Details":"The NBA has suspended Allen Iverson (Phi) for the first game of the regular season for pleading no contest to carrying a concealed weapon this summer."},
{"Date":"10/21/1997","Season":"1997-1998","Details":"The NBA fined Clifford Rozier (Cle) $10,000 and suspended him for 2 games and fined Vitaly Potapenko (Min) $5,000 and suspended him for 1 game for their fight in Sunday's Min-Cle game. Shawn Kemp (Cle), Henry James (Cle), and Doug West (Min) were each fined $2,500 and suspended for 1 game for leaving the bench during the fight. The suspensions will take place at the start of the regular season."},
{"Date":"10/28/1997","Season":"1997-1998","Details":"The NBA fined Lawrence Funderburke (Sac) $2,500 and suspended him for 1 game for leaving the bench during a scuffle in Friday's Sac-Ind game."},
{"Date":"10/30/1997","Season":"1997-1998","Details":"Washington placed Terry Davis on the suspended list."},
{"Date":"11/3/1997","Season":"1997-1998","Details":"The NBA fined Shaquille O'Neal (LAL) $10,000 and suspended him for 1 game for hitting Greg Ostertag (Uta) prior to Friday's Uta-LAL game."},
{"Date":"11/3/1997","Season":"1997-1998","Details":"Washington released Jimmy Oliver and activated Terry Davis from the suspended list."},
{"Date":"11/12/1997","Season":"1997-1998","Details":"The NBA fined Kurt Thomas (Dal) $7,500 for elbowing Stacey Augmon (Por) in Saturday's Dal-Por game."},
{"Date":"11/14/1997","Season":"1997-1998","Details":"The NBA fined Minnesota $25,000 and Chris Carr, Kevin Garnett, Stephon Marbury, Clifford Rozier, and Doug West $2,500 each for wearing their shorts too long. The league sent a memo to each team this summer stating they would enforce the dress code that requires shorts to be no longer than one inch above the knee."},
{"Date":"11/17/1997","Season":"1997-1998","Details":"The NBA fined Portland $25,000 and fined Rasheed Wallace and Kelvin Cato $2,500 for wearing their shorts too long."},
{"Date":"11/17/1997","Season":"1997-1998","Details":"The NBA fined Popeye Jones (Tor) $10,000 for a flagrant foul on Ron Mercer (Bos) during Friday's Bos-Tor game."},
{"Date":"11/21/1997","Season":"1997-1998","Details":"The NBA fined Isaiah Rider (Por) $10,000 and suspended him for 3 games for spitting at a fan during Thursday's Por-Det game."},
{"Date":"11/24/1997","Season":"1997-1998","Details":"The NBA fined Charles Oakley (NY) $7,500 and suspended him for 1 game for his altercation with Otis Thorpe (Sac) during Sunday's NY-Sac game. Thorpe was also fined $3,500 for throwing an elbow at Oakley."},
{"Date":"12/1/1997","Season":"1997-1998","Details":"Golden State suspended Latrell Sprewell indefinitely for assaulting head coach P.J. Carlesimo during practice. Golden State is initially defining it as a 10 game suspension, but says that it could be longer or shorter depending on how talks with Sprewell go. Carlesimo did not go into details of the two assaults (after the first altercation, Sprewell returned 15 minutes later), but there was a visible welt on Carlesimo's neck."},
{"Date":"12/4/1997","Season":"1997-1998","Details":"The NBA has suspended Latrell Sprewell from the NBA for one year. Sprewell's suspension will last until December 3, 1998."},
{"Date":"12/5/1997","Season":"1997-1998","Details":"The NBA fined Darrell Walker (Tor coach) $5,000 for flipping off a fan after Wednesday's Uta-Tor game."},
{"Date":"12/11/1997","Season":"1997-1998","Details":"Washington fined Rod Strickland and Tracy Murray $25,000 each for fighting at the team hotel Wednesday."},
{"Date":"12/15/1997","Season":"1997-1998","Details":"Philadelphia suspended Allen Iverson for one game for missing practice on Sunday."},
{"Date":"12/29/1997","Season":"1997-1998","Details":"The NBA fined Corliss Williamson (Sac) $15,000 and suspended him for 3 games and fined Derrick Coleman (Phi) $10,000 and suspended him for 2 games for their fight during Sunday's Sac-Phi game."},
{"Date":"12/30/1997","Season":"1997-1998","Details":"Portland suspended Vincent Askew for one game for skipping practice."},
{"Date":"1/20/1998","Season":"1997-1998","Details":"Atlanta suspended Ed Gray indefinitely for missing medical appointments. Gray is on IR with a sprained right foot."},
{"Date":"1/22/1998","Season":"1997-1998","Details":"The NBA fined and reprimanded ref Joe Borgia for calling a foul on Calbert Cheaney (Was) when the foul was actually committed by Chris Webber, who had 5 fouls, in Friday's Was-Van game. Borgia actually told Cheaney after calling the foul that he called the foul on Cheaney because it would have been Webber's 6th foul."},
{"Date":"1/26/1998","Season":"1997-1998","Details":"Atlanta lifted the suspension of Ed Gray."},
{"Date":"2/2/1998","Season":"1997-1998","Details":"The NBA fined P.J. Brown (Mia) $2,500 and suspended him for 1 game for leaving the substitution box during Sunday's NY-Mia altercation between Larry Johnson (NY) and Alonzo Mourning (Mia). Johnson was fined $5,000 for the incident."},
{"Date":"2/2/1998","Season":"1997-1998","Details":"The NBA fined Danny Fortson (Den) $5,000 for shoving Shawn Bradley (Dal) during Saturday's Den-Dal game."},
{"Date":"2/7/1998","Season":"1997-1998","Details":"The NBA fined Michael Jordan $10,000 for skipping the media session on Friday. Jordan, who normally skips the media day, was in Las Vegas playing golf."},
{"Date":"2/10/1998","Season":"1997-1998","Details":"The NBA fined Mike Fratello (Cle) $5,000 for comments he made regarding the reffing following Thursday's Cle-Atl game. Atlanta attempted 35 more free throws in the game."},
{"Date":"2/11/1998","Season":"1997-1998","Details":"Portland suspended Isaiah Rider for 1 game for leaving Tuesday's Por-LAL game before it ended."},
{"Date":"2/14/1998","Season":"1997-1998","Details":"The NBA suspended Charles Oakley (NY) for 1 game for his flagrant foul level 2 on Charles Outlaw (Orl) during Friday's Orl-NY game. The flagrant gave Oakley a total of 6 flagrant foul points. 6 flagrant foul points results in an automatic suspension. 7 or more flagrant foul points results in an automatic two game suspension. A flagrant foul level 1 counts as 1 flagrant foul point and a flagrant foul level 2 counts as 2 flagrant foul points (and automatic ejection from the game)."},
{"Date":"2/20/1998","Season":"1997-1998","Details":"The NBA fined Tom Hammond (Min) $7,500 for his flagrant foul Wednesday against Derek Harper (Orl)."},
{"Date":"2/27/1998","Season":"1997-1998","Details":"The NBA fined Sacramento coach Eddie Jordan $5,000 for screaming at the refs following Thursday's Sac-NJ game."},
{"Date":"3/1/1998","Season":"1997-1998","Details":"The NBA fined Keith Askins (Mia) $10,000 and suspended him for 2 games for his flagrant foul against Keith Van Horn (NJ) and for spitting at New Jersey's bench after he was ejected. The NBA fined Chris Gatling (NJ) $2,500 and suspended him for 1 game for leaving the bench during the incident and fined Sherman Douglas (NJ) $3,500 for tackling Askins after Askins committed the flagrant."},
{"Date":"3/4/1998","Season":"1997-1998","Details":"The independent arbitrator ruled that Latrell Sprewell's contract with Golden State is to be reinstated and reduced Sprewell's suspension (without pay) to 5 months. The suspension now will be lifted July 1 and Sprewell is again a member of the Warriors (until they trade him). On December 1, Sprewell physically attacked his coach, P.J. Carlesimo. Golden State terminated Sprewell's contract December 3 and the NBA suspended Sprewell for 1 year on December 4. Sprewell and the NBA Players Association appealed the contract termination and suspension and went to arbitration. The 7 month suspension will cost Sprewell $6.4 million. After this season, Sprewell has 2 years left on his contract."},
{"Date":"3/4/1998","Season":"1997-1998","Details":"The NBA fined John Calipari (NJ) $1,000 for cursing at a fan during Saturday's NJ-Mia game."},
{"Date":"3/9/1998","Season":"1997-1998","Details":"The NBA fined Hakeem Olajuwon (Hou) $10,000 and suspended him for one game and fined Antonio McDyess (Pho) $7,500 and suspended him for one game for their altercation in Saturday's Pho-Hou game. Mario Elie (Hou) and Kevin Willis (Hou) were fined $2,500 and suspended for 1 game for leaving the bench during the incident."},
{"Date":"3/20/1998","Season":"1997-1998","Details":"The NBA fined Jerome Kersey (Sea) $7,500 and suspended him for 1 game and fined Lamond Murray (LAC) $7,500 and suspended him for 1 game for their altercation during Wednesday's Sea-LAC game."},
{"Date":"3/25/1998","Season":"1997-1998","Details":"The NBA fined Rod Strickland (Was) $5,000 for verbally abusing the ref and failing to leaving the court in a timely manner after being ejected during Tuesday's Por-Was game."},
{"Date":"3/26/1998","Season":"1997-1998","Details":"Sacramento fined and suspended Olden Polynice for 2 games for arguing with head coach Eddie Jordan during Wednesday's Sac-LAL game."},
{"Date":"3/27/1998","Season":"1997-1998","Details":"The NBA fined Gary Trent (Tor) $5,000 and suspended him for one game and fined Marcus Camby (Tor) $2,500 and suspended him for one game for leaving the bench during an altercation between Danny Ferry (Cle) and John Wallace (Tor) during Thursday's Cle-Tor game."},
{"Date":"3/27/1998","Season":"1997-1998","Details":"The NBA fined Larry Brown (Phi) $6,000, fined Derrick Coleman $6,000, and fined Allen Iverson (Phi) $3,000 for publically criticizing the refs after Wednesday's Phi-NJ game."},
{"Date":"3/28/1998","Season":"1997-1998","Details":"The NBA fined Reggie Miller (Ind) $ 7,500 and suspended him for 1 game for his flagrant elbow on Vlade Divac (Cha) in Friday's Cha-Ind game."},
{"Date":"3/30/1998","Season":"1997-1998","Details":"The NBA fined Charles Barkley (Hou) $10,000 for calling ref Jack Nies "},
{"Date":"4/1/1998","Season":"1997-1998","Details":"Portland suspended Isaiah Rider for 1 game for being late for practice."},
{"Date":"4/2/1998","Season":"1997-1998","Details":"The NBA fined Jerry Stackhouse (Det) $5,000 for grabbing Brevin Knight's (Cle) neck in Wednesday's Cle-Det game and fined Shawn Kemp (Cle), Vitaly Potapenko (Cle), and Shawnelle Scott (Cle) $2,500 each and suspended the 3 for 1 game for leaving the bench during altercation."},
{"Date":"4/3/1998","Season":"1997-1998","Details":"Toronto suspended Oliver Miller for 1 game for conduct detrimental to the team."},
{"Date":"4/10/1998","Season":"1997-1998","Details":"The NBA fined Karl Malone (Uta) $5,000 and suspended him for one game for throwing an elbow that knocked David Robinson (SA) unconscious in Wednesday's Uta-SA game. The league said that the contact was unintentional, but Malone should not have been swinging his elbows."},
{"Date":"4/14/1998","Season":"1997-1998","Details":"The NBA fined Nick Van Exel (LAL) $10,000 and suspended him for 2 games and fined Monty Williams (SA) $5,000 and suspended him for 2 games for their altercation in Monday's SA-LAL game. Van Exel's fine included a fine for making an obscene gesture following his ejection. Shaquille O'Neal (LAL) and Reggie Geary (SA) were also fined $5,000 each for their participation in the altercation. In a separate incident in that game, Will Perdue (SA) was fined $5,000 for throwing Derek Fisher (LAL) to the ground."},
{"Date":"4/24/1998","Season":"1997-1998","Details":"The NBA fined Charles Barkley (Hou) $10,000 for using profane language and making obscene gestures at a fan during Thursday's Hou-Uta game."},
{"Date":"5/1/1998","Season":"1997-1998","Details":"The NBA fined Alonzo Mourning (Mia) $20,000 and suspended him for 2 games and fined Larry Johnson (NY) $10,000 and suspended him for 2 games for their fight at the end of Thursday's NY-Mia game. Both will miss game 5 of the series and one will miss the game 1 of the second round and the other will miss the first game of the 98-99 season. Chris Mills (NY) was also fined $2,500 and suspended for 1 game (game 5) for leaving the bench during the altercation."},
{"Date":"5/2/1998","Season":"1997-1998","Details":"The NBA fined Micheal Williams (Min) $2,500 and suspended him for one game for leaving the bench during a scuffle between Tom Hammonds (Min) and Detlef Schrempf (Sea) during Wednesday's Sea-Min game."},
{"Date":"5/22/1998","Season":"1997-1998","Details":"The NBA fined Chicago $50,000 for failing to make their players available to the media following Thursday's practice."},
{"Date":"5/26/1998","Season":"1997-1998","Details":"The NBA fined Jalen Rose (Ind) $2,500 and suspended him for one game for leaving the bench while Reggie Miller (Ind) and Ron Harper (Chi) scuffled during Monday's Ind-Chi game. The NBA also fined Harper $3,500 for initiating the scuffle and fined Miller $2,500 for retaliating."},
{"Date":"5/26/1998","Season":"1997-1998","Details":"The NBA fined Phil Jackson (Chi) $10,000 for his comments regarding the reffing following Monday's Ind-Chi game."},
{"Date":"6/8/1998","Season":"1997-1998","Details":"The NBA fined Dennis Rodman (Chi) $10,000 for not making himself available to the media following Monday's practice. Rodman had skipped the practice. Chicago also fined Rodman an undisclosed amount for missing practice."},
{"Date":"1/22/1999","Season":"1999-2000","Details":"The NBA reinstated Latrell Sprewell (NY). Sprewell had been suspended for assaulting his coach."},
{"Date":"1/22/1999","Season":"1999-2000","Details":"Due to the long lockout, the NBA announced that Alonzo Mourning (Mia) will not be suspended for the first game of the season. Mourning was assessed a 2 game suspension for fighting with Larry Johnson (Mia) in game 4 of the NY-Mia series last May."},
{"Date":"2/8/1999","Season":"1999-2000","Details":"The NBA fined Charles Barkley (Hou) $5,000 for foul language directed at fans during Friday's Hou-LAL game."},
{"Date":"2/8/1999","Season":"1999-2000","Details":"The NBA fined Steve Smith (Atl) $2,500 and Kendall Gill (NJ) $2,500 for their altercation in the tunnel after Saturday's Atl-NJ game."},
{"Date":"2/10/1999","Season":"1999-2000","Details":"NBA fined Danny Ainge (Pho) $3,000 for kicking the basketball into the stands after being ejected during Tuesday's Pho-Sac game."},
{"Date":"2/18/1999","Season":"1999-2000","Details":"The NBA fined Kevin Willis (Tor) $5,000 for throwing a flagrant elbow at Charlie Ward (NY) during Tuesday's Tor-NY game."},
{"Date":"2/18/1999","Season":"1999-2000","Details":"The NBA fined Dan Issel (Den GM) $3,500 for verbally abusing the refs following Saturday's Sea-Den game."},
{"Date":"2/22/1999","Season":"1999-2000","Details":"The NBA fined Shaquille O'Neal (LAL) $10,000 comments he made regarding the refs following Sunday's LAL-Sea game."},
{"Date":"2/22/1999","Season":"1999-2000","Details":"The NBA fined Scottie Pippen (Hou) $5,000 for comments he made regarding the refs following Sunday's Hou-Orl game."},
{"Date":"2/26/1999","Season":"1999-2000","Details":"The NBA fined Loren Meyer (Den) $5,000 and suspended him for 1 game for his flagrant foul on Cedric Ceballos (Dal) during Thursday's Dal-Den game."},
{"Date":"2/27/1999","Season":"1999-2000","Details":"The NBA fined Isaiah Rider (Por) $2,500 and suspended him for one game for leaving the bench during an altercation during Friday's Por-Cha game."},
{"Date":"2/27/1999","Season":"1999-2000","Details":"The NBA fined coach Tim Floyd (Chi) $5,000 for verbally abusing the refs following his ejection from Thursday's Chi-Phi game."},
{"Date":"3/2/1999","Season":"1999-2000","Details":"The NBA fined Anfernee Hardaway (Orl) $7,500 for criticizing the refs following Sunday's Orl-Mia game."},
{"Date":"3/3/1999","Season":"1999-2000","Details":"The NBA fined Olden Polynice (Sea) $5,000 for making an obscene gesture at the fans after Monday's Sea-Sac game."},
{"Date":"3/15/1999","Season":"1999-2000","Details":"The NBA fined Milwaukee $25,000 for comments head coach George Karl made about Seattle, his former team."},
{"Date":"3/19/1999","Season":"1999-2000","Details":"The NBA fined Isaiah Rider (Por) $7,500 and suspended him for one game for kneeing and shoving Jon Barry (Sac) during Thursday's Por-Sac game."},
{"Date":"3/23/1999","Season":"1999-2000","Details":"The NBA fined Tracy McGrady (Tor) $3,500 for hitting Jamie Feick (NJ) in the back of the head with a flagrant forearm in Monday's Tor-NJ game."},
{"Date":"3/23/1999","Season":"1999-2000","Details":"The NBA fined Alan Henderson (Atl) $3,500 for throwing the basketball into the stands during Saturday's Mil-Atl game. Ironically the ball hit teammate Dikembe Mutombo's daughter and she was treated on site for dizziness."},
{"Date":"3/26/1999","Season":"1999-2000","Details":"The NBA fined Rex Chapman (Pho) $5,000 and suspended him for 1 game for making contact with a ref during Thursday's Pho-Por game."},
{"Date":"3/30/1999","Season":"1999-2000","Details":"The NBA fined Kurt Thomas (NY) $5,000 for his flagrant foul on Dennis Rodman (LAL), fined Rick Fox (LAL) $2,000 for pushing Thomas after the flagrant, fined Shaquille O'Neal (LAL) $3,500 for pushing Chris Dudley (NY) to the floor, and fined Dudley $2,500 for retaliating by throwing the ball at O'Neal during Sunday's LAL-NY game."},
{"Date":"3/31/1999","Season":"1999-2000","Details":"The NBA suspended Isaiah Rider (Por) for one game for entering the stands near the end of Tuesday's Por-GS game."},
{"Date":"4/1/1999","Season":"1999-2000","Details":"The NBA fined Jalen Rose (Ind) $5,000 and suspended him for one game for throwing a forearm at Patrick Ewing (NY) and fined Ewing $2,500 for his actions in the altercation. The forearm hit ref Dick Bavetta in the nose and broke his nose."},
{"Date":"4/12/1999","Season":"1999-2000","Details":"The NBA fined Karl Malone (Uta) $4,000 and suspended him for one game for throwing a punch at Othella Harrington (Hou) during Sunday's Uta-Hou game."},
{"Date":"4/12/1999","Season":"1999-2000","Details":"The NBA fined Anthony Johnson (Atl) $5,000 and suspended him for one game for throwing an elbow at Bob Sura (Cle) during Sunday's Atl-Cle game."},
{"Date":"4/12/1999","Season":"1999-2000","Details":"The NBA fined Dikembe Mutombo (Atl) $7,500 for elbowing Chris Childs (NY) during Friday's Atl-NY game."},
{"Date":"4/19/1999","Season":"1999-2000","Details":"The NBA fined Keith Askins (Mia) $5,000 and suspended him for 1 game for flagrantly elbowing Antonio Davis (Ind) during Sunday's Mia-Ind game."},
{"Date":"4/19/1999","Season":"1999-2000","Details":"The NBA fined Cherokee Parks (Van) $5,000 for making an obscene gesture during Friday's Van-Min game."},
{"Date":"4/21/1999","Season":"1999-2000","Details":"New York fined Latrell Sprewell $25,000 for disparaging comments made by his agent. His agent, Robert Gist, told reporters that Sprewell would demand a trade unless he was made a starter next season."},
{"Date":"4/26/1999","Season":"1999-2000","Details":"The NBA fined Larry Miller (Uta owner) $10,000 for inappropriate comments made to Greg Anthony (Por) during Friday's Uta-Por game."},
{"Date":"4/26/1999","Season":"1999-2000","Details":"The NBA fined John Wallace (Tor) $5,000 for flagrantly fouling Grant Hill (Det) in Sunday's Tor-Det game."},
{"Date":"4/26/1999","Season":"1999-2000","Details":"The NBA fined Travis Best (Ind) $3,000 for flagrantly fouling Jamie Feick (NJ) in Sunday's Ind-NJ game."},
{"Date":"5/14/1999","Season":"1999-2000","Details":"The NBA fined Tim Hardaway (Mia) for failing to leaving the court in a timely manner and verballying abusing the refs following his ejection in Wednesday's NY-Mia game."},
{"Date":"5/16/1999","Season":"1999-2000","Details":"The NBA fined J.R. Reid (LAL) $10,000 for his flagrant foul against Scottie Pippen (Hou) during Saturday's LAL-Hou game."},
{"Date":"5/19/1999","Season":"1999-2000","Details":"The NBA fined Karl Malone (Uta) $10,000 for elbowing Brian Grant (Por) in Tuesday's Uta-Por game."},
{"Date":"5/19/1999","Season":"1999-2000","Details":"The NBA fined Shaquille O'Neal (LAL) $7,500 for failing to leave the court in a timely manner and verbally abusing the refs following Monday's SA-LAL game."},
{"Date":"6/8/1999","Season":"1999-2000","Details":"The NBA fined Larry Johnson (NY) $10,000 and fined New York a matching $10,000 for Johnson's failure to make himself available to the media following practices on Friday and Sunday."},
{"Date":"6/10/1999","Season":"1999-2000","Details":"The NBA fined Dallas and Sacramento $25,000 each for salary cap violations. Dallas gave free agent to be Gary Trent and 5 members of his family an all-expense paid trip to Maui as what coach/GM Don Nelson openly called a recruiting trip. Sacramento gave 10 players an all-expense paid trip to Las Vegas for a party to celebrate their season."},
{"Date":"6/20/1999","Season":"1999-2000","Details":"The NBA fined Larry Johnson (NY) $25,000 and fined New York a matching $25,000 for Johnson directing an obscenity at the media and failing to make himself available to the media for the entire mandatory 30 minute media session on Sunday."},
{"Date":"10/4/1999","Season":"1999-2000","Details":"The NBA fined Ron Artest (Chi) $5,000 and sent him home from the NBA rookie orientation for missing a meeting at the orientation."},
{"Date":"10/10/1999","Season":"1999-2000","Details":"Latrell Sprewell (NY) finally showed up to training camp. The team reportedly fined him at least $50,000 for his absence."},
{"Date":"10/20/1999","Season":"1999-2000","Details":"Washington suspended Rod Strickland for 1 game for missing practice. He will sit out Thursday's game vs Cleveland."},
{"Date":"10/26/1999","Season":"1999-2000","Details":"The NBA fined Anfernee Hardaway (Pho) $5,000 and suspended him for 1 game (Tuesday's season opener) for throwing a punch at Rex Walters (Mia) during Friday's Pho-Mia game. The NBA fined Walters $2,000 for confronting Hardaway in the dressing room after the two were ejected. The NBA fined Rex Chapman (Pho) $2,000 and suspended him for 1 game (Tuesday's season opener) for leaving the bench area during the Hardaway-Walters altercation."},
{"Date":"11/10/1999","Season":"1999-2000","Details":"The NBA fined Jerry Stackhouse (Det) $5,000 for throwing the ball at the ref during Saturday's Det-Mil game."},
{"Date":"11/10/1999","Season":"1999-2000","Details":"The NBA fined Phil Jackson (LAL) $5,000 for critical comments made regarding the refs following Saturday's LAL-Por game."},
{"Date":"11/11/1999","Season":"1999-2000","Details":"The NBA fined Shaquille O'Neal (LAL) $10,000 and suspended him for one game for throwing a punch at Charles Barkley and fined Charles Barkley (Hou) $5,000 and suspended him for one game for throwing the ball at O'Neal as the two scuffled during Wednesday's LAL-Hou game."},
{"Date":"11/15/1999","Season":"1999-2000","Details":"Atlanta suspended Isaiah Rider for one game for violating team rules."},
{"Date":"11/17/1999","Season":"1999-2000","Details":"The NBA fined Steve Francis (Hou) $5,000 for his flagrant foul on Dirk Nowitzki (Dal) in Tuesday's Dal-Hou game."},
{"Date":"11/24/1999","Season":"1999-2000","Details":"The NBA fined Latrell Sprewell (NY) $10,000 for shouting profanities at the fans during Saturday's NY-GS game."},
{"Date":"12/2/1999","Season":"1999-2000","Details":"The NBA fined Charles Barkley (Hou) $20,000 for disparaging remarks made about ref Mike Mathis following Wednesday's Hou-Pho game."},
{"Date":"12/6/1999","Season":"1999-2000","Details":"Dallas suspended without pay Leon Smith. Smith, a troubled teen, was arrested twice (on Thursday and Friday) in Chicago, has an arrest warrant against him for violating bond by leaving Chicago, and is currently in the psychiatric ward of a Dallas hospital (he left Chicago to check into the hospital)."},
{"Date":"12/8/1999","Season":"1999-2000","Details":"The NBA fined Patrick Ewing (NY) $10,000 for failing to make himself available to the media during designated media access periods and fined New York $25,000 for failing to ensure that the players comply with the NBA media access rules."},
{"Date":"12/16/1999","Season":"1999-2000","Details":"The NBA fined Antonio Davis (Tor) $5,000 for make an obscene gesture at the fans during Tuesday's Ind-Tor game."},
{"Date":"12/20/1999","Season":"1999-2000","Details":"The NBA fined Shaquille O'Neal (LAL) $10,000 for criticizing the refs following Thursday's Atl-LAL game."},
{"Date":"12/27/1999","Season":"1999-2000","Details":"The NBA fined Kurt Thomas (NY) $10,000 and suspended him for 2 games for throwing a punch at Jalen Rose (Ind) during Saturday's Ind-NY game."},
{"Date":"12/30/1999","Season":"1999-2000","Details":"Atlanta suspended Isaiah Rider indefinitely for missing a team flight and a team practice."},
{"Date":"1/2/2000","Season":"1999-2000","Details":"Atlanta lifted the suspension of Isaiah Rider."},
{"Date":"1/7/2000","Season":"1999-2000","Details":"The NBA fined Don Nelson (Dal) $10,000 and suspended him for 1 game for bumping a ref and his confrontation with Karl Malone (Uta) during Thursday's Dal-Uta game."},
{"Date":"1/7/2000","Season":"1999-2000","Details":"The NBA fined Karl Malone (Uta) $10,000 for throwing an elbow at Shawn Bradley (Dal) and his confrontation with Don Nelson (Dal) during Thursday's Dal-Uta game."},
{"Date":"1/15/2000","Season":"1999-2000","Details":"The NBA fined Rasheed Wallace (Por) $7,500 for yelling at the refs and failing to leave the court in a timely manner following his ejection from Friday's Por-Pho game."},
{"Date":"1/16/2000","Season":"1999-2000","Details":"The NBA fined J.R. Reid (Mil) $7,500 and suspended him for 1 game for throwing a punch at Antonio Davis (Tor) during Sunday's Mil-Tor game. Davis was also fined $5,000 for fighting with Reid."},
{"Date":"1/16/2000","Season":"1999-2000","Details":"The NBA fined Charles Oakley (Tor) $7,500 and suspended him for 1 game for failing to leave the court in a timely manner following his ejection from the Tor-Mil game and for extreme unsportsmanlike conduct."},
{"Date":"1/23/2000","Season":"1999-2000","Details":"The LA Clippers suspended indefinitely Keith Closs after Closs missed Saturday's practice."},
{"Date":"1/24/2000","Season":"1999-2000","Details":"The NBA fined Oliver Miller (Pho) $7,500 and suspended him for 1 game for throwing a forearm at Andre Miller (Cle) during Saturday's Cle-Pho game."},
{"Date":"1/24/2000","Season":"1999-2000","Details":"The LA Clippers reinstated Keith Closs. They had suspended him for missing practice."},
{"Date":"1/27/2000","Season":"1999-2000","Details":"The NBA fined Mark Davis (GS) $7,500 and suspended him for 1 game for picking up and throwing Shawn Bradley (Dal) to the ground during Tuesday's Dal-GS game."},
{"Date":"1/27/2000","Season":"1999-2000","Details":"The NBA fined Vonteego Cummings (GS) $7,500 for his flagrant foul on Steve Nash (Dal) during Tuesday's Dal-GS game."},
{"Date":"1/27/2000","Season":"1999-2000","Details":"The NBA fined Gary Trent (Dal) $10,000 and suspended him for 1 game for going into Golden State's locker room to verbally confront Vonteego Cummings (GS) during Tuesday's Dal-GS game. Trent, who is on IR, will serve the suspension after he is activated. The league has rules against players entering the opponent's locker room."},
{"Date":"1/27/2000","Season":"1999-2000","Details":"The NBA fined Shawn Bradley (Dal) $3,000 for his actions in the Bradley-Davis incident during Tuesday's Dal-GS game."},
{"Date":"1/29/2000","Season":"1999-2000","Details":"The NBA fined Dickey Simpkins (Chi) $5,000 for a flagrant foul on Vlade Divac (Sac) during Friday's Chi-Sac game."},
{"Date":"2/7/2000","Season":"1999-2000","Details":"The NBA fined Shawn Kemp (Cle) $10,000 for verbally abusing the refs and failing to leave the court in a timely manner after being ejected in Saturday's Cle-Atl game."},
{"Date":"2/7/2000","Season":"1999-2000","Details":"The NBA fined Dan Issel (Den) and Nick Van Exel (Den) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner after Denver's loss to Minnesota on Saturday."},
{"Date":"2/16/2000","Season":"1999-2000","Details":"The NBA fined Dennis Rodman (Dal) $10,000 and suspended him for 1 game for failing to leave the court in a timely manner and berating the refs following his ejection from Tuesday's Dal-Mil game."},
{"Date":"2/22/2000","Season":"1999-2000","Details":"The NBA fined Reggie Miller (Ind) $5,000 for cursing at the fans during Saturday's Ind-NY game."},
{"Date":"2/25/2000","Season":"1999-2000","Details":"The NBA fined Steve Francis (Hou) $10,000 for his flagrant foul against Tariq Abdul-Wahad (Den) in Thursday's Hou-Den game."},
{"Date":"2/25/2000","Season":"1999-2000","Details":"The NBA fined Dennis Rodman (Dal) $3,500 for failing to leave the court in a timely manner following his ejection from Thursday's Dal-Uta game."},
{"Date":"2/28/2000","Season":"1999-2000","Details":"The NBA fined Greg Ostertag (Uta) $7,500 and fined Steve Smith (Por) $3,000 for their skirmish during Sunday's Uta-Por game."},
{"Date":"3/8/2000","Season":"1999-2000","Details":"The NBA fined Anthony Carter (Mia) $10,000 for his flagrant foul on Elliot Perry (NJ) during Friday's Mia-NJ game."},
{"Date":"3/10/2000","Season":"1999-2000","Details":"The NBA fined New York $25,000 for failing to make their players available to the media after practice on March 6."},
{"Date":"3/10/2000","Season":"1999-2000","Details":"The NBA fined Chris Gatling (Den) $5,000 for his flagrant foul on John Crotty (Det) in Wednesday's Det-Den game."},
{"Date":"3/12/2000","Season":"1999-2000","Details":"The NBA fined George McCloud (Den) $5,000 and suspended him for 1 game and fined Ron Mercer (Orl) $5,000 and suspended him for 1 game for their altercation outside of Denver's locker room after Saturday's Den-Orl game."},
{"Date":"3/13/2000","Season":"1999-2000","Details":"The NBA fined Toronto and Seattle $100,000 each for Butch Carter's (Tor) and Paul Westphal's (Sea) refusal to wear microphones during Sunday's NBC broadcasted Tor-Sea game."},
{"Date":"3/16/2000","Season":"1999-2000","Details":"Philadelphia suspended Allen Iverson for 1 game for missing the team's shootaround Thursday morning."},
{"Date":"3/17/2000","Season":"1999-2000","Details":"Atlanta released Isaiah Rider. The team was going to suspended Rider for 3 games for being late for Friday's Atl-Bos game (he had been warned that he would be suspended for 3 games if he was late again), but he refused to accept the suspension and Atlanta then released him."},
{"Date":"3/17/2000","Season":"1999-2000","Details":"The NBA rescinded the $100,000 fines levied against Seattle and Toronto for their coaches refusing to wear microphones during Sunday's Sea-Tor game. The league reached a compromise with the coaches (many of whom had a problem with wearing microphones) where the coaches for selected games have a choice of wearing a microphone or having a boom microphone lowered into the huddles during timeouts."},
{"Date":"3/20/2000","Season":"1999-2000","Details":"The NBA fined Doc Rivers (Orl) $7,500 for his remarks about the reffing after Friday's Orl-Tor game."},
{"Date":"3/22/2000","Season":"1999-2000","Details":"The NBA fined Derrick Coleman (Cha) $7,500 for his flagrant foul on Toni Kukoc (Phi) in Monday's Cha-Phi game."},
{"Date":"4/14/2000","Season":"1999-2000","Details":"The NBA fined Shawn Bradley (Dal) $10,000 and suspended him for 1 game for throwing a flagrant elbow at Walt Williams (Hou) and fined Williams $5,000 and suspended him for 1 game for throwing a punch in retaliation during Thursday's Dal-Hou game."},
{"Date":"4/26/2000","Season":"1999-2000","Details":"The NBA fined Gary Payton (Sea) $10,000 for failing to make himself available to the media and fined Seattle $25,000 for failing to make their players comply with league media rules."},
{"Date":"4/28/2000","Season":"1999-2000","Details":"The NBA fined Rik Smits (Ind) $10,000 and suspended him for one game for throwing a flagrant elbow at Ervin Johnson (Mil) during Thursday's Ind-Mil game. Smits will miss Saturday's Mil-Ind game."},
{"Date":"4/29/2000","Season":"1999-2000","Details":"The NBA fined Chris Childs (NY) $15,000 and suspended him for 2 games and fined Kobe Bryant (LAL) $5,000 and suspended him for 1 game for their fight in Sunday's LAL-NY game."},
{"Date":"5/14/2000","Season":"1999-2000","Details":"The NBA fined Matt Geiger (Phi) $20,000 and suspended him for 2 games for his 2 flagrant fouls against Reggie Miller (Ind) during Saturday's Ind-Mil game. The NBA fined Miller $5,000 and suspended him for 1 game for retaliating after the 2nd flagrant. The NBA fined Philadelphia $50,000 for Geiger's actions with NBA VP Rod Thorn stating, "},
{"Date":"5/23/2000","Season":"1999-2000","Details":"The NBA fined Rasheed Wallace (Por) $10,000 for failing to make himself available to the media during media sessions and fined Portland $25,000 for failing to make their players comply with the NBA media interview rules."},
{"Date":"5/24/2000","Season":"1999-2000","Details":"The NBA fined Tim Hardaway (Mia) $20,000, Jamal Mashburn (Mia) $10,000, and Miami owner Micky Arison $25,000 for their comments about the officiating for game 7 of Mia-NY."},
{"Date":"5/27/2000","Season":"1999-2000","Details":"The NBA fined Brian Shaw (LAL) $2,500 and suspended him for 1 game for leaving the bench during a minor altercation during Friday's LAL-Por game. The fine and suspension are automatic for a player leaving the bench."},
{"Date":"5/29/2000","Season":"1999-2000","Details":"The NBA fined Rick Carlisle (Ind assistant) $10,000 for tripping Latrell Sprewell (NY) as Sprewell ran along the sideline during Saturday's Ind-NY game."},
{"Date":"5/30/2000","Season":"1999-2000","Details":"The NBA fined Scottie Pippen (Por) $10,000 for hitting John Salley (LAL) in the back of the head with a forearm during Sunday's Por-LAL game."},
{"Date":"6/6/2000","Season":"1999-2000","Details":"The NBA announced that Stu Jackson will assume Rod Thorn's duties for the league (most significantly handing out fines and suspensions). Jackson recently joined the league office as senior vice president of basketball operations and Thorn was named as New Jersey president a few days ago."},
{"Date":"7/7/2000","Season":"2000-2001","Details":"The NBA fined Dallas and Milwaukee $50,000 each for violating league rules governing the tryouts of draft prospects. League rules prohibit having 4 draft prospects on the court at the same time and having draft prospects compete against veterans. [Dallas was fined for using a draft prospect in a 5-on-5 scrimmage.]"},
{"Date":"7/20/2000","Season":"2000-2001","Details":"The NBA suspended Jason Williams (Sac) for the first 5 games of the 2000-01 season for not complying with his treatment obligations under the league's anti-drug program. The NBA does not release details of violations of the anti-drug program."},
{"Date":"10/5/2000","Season":"2000-2001","Details":"The LA Clippers suspended Keith Closs due to lack of physical conditioning."},
{"Date":"10/16/2000","Season":"2000-2001","Details":"Ref Bennett Salvatore was sentenced to 1 year probation, 150 hours of community service, and fined $500. Salvatore had pleaded guilty to income tax evasion by not reporting as income money receive by down grading 1st class airline tickets."},
{"Date":"10/23/2000","Season":"2000-2001","Details":"An arbitrator ruled that the NBA can void Joe Smith's contract, but that Smith could sign with any of the 29 teams (for whatever a team had available under the salary cap or available exceptions), including re-signing with Minnesota and retaining his 2 years toward Larry Bird rights. The NBA was looking to restrict Smith from returning to Minnesota. Smith and Minnesota had a secret agreement for a future multi-year, multi-million contract for when he gained Larry Bird rights with Minnesota (2001-02) - a blatant violation of the collective bargaining agreement. The league will likely hand down heavy fines for Minnesota. The league can fine Minnesota up to $3,500,000, forfeit Minnesota draft picks, void Smith's contract, and suspend up to 1 year any team personnel involved (almost certainly the owner, Glen Taylor, and maybe others)."},
{"Date":"10/25/2000","Season":"2000-2001","Details":"The NBA voided Joe Smith's current contract and his past two contracts, fined Minnesota $3.5 million, and removed Minnesota's next 5 1st round draft picks as a result of Smith and Minnesota's secret agreement for a future multi-year, multi-million contract which was a blatant violation of the collective bargaining agreement. The NBA is still determining possible suspensions for team personnel for their involvement in the illegal agreement. Voiding Smith's past contracts removed his Larry Bird rights with the team [ability to re-sign regardless of Minnesota's salary cap after he has played with the team for 3 seasons] and Minnesota's opportunity to re-sign him at 120% of last season's salary (Minnesota has already used their $2.25 million exception) [voiding the past contracts does not involve Smith having to give back any money]. Smith is now a free agent and can sign with any team (restricted by the amount a team has available under the salary cap or any exceptions available), including re-signing with Minnesota. Smith is planning on appealing the voiding of the past contracts."},
{"Date":"10/30/2000","Season":"2000-2001","Details":"The NBA fined Rasheed Wallace (Por) $10,000 for failing to leave the court in a timely manner and verbally abusing the refs following Friday's Por-Sac game."},
{"Date":"11/4/2000","Season":"2000-2001","Details":"The NBA fined Tracy McGrady (Orl) $7,500 and suspended him for on game and fined Eric Snow (Phi) $2,500 for their shoving match during Friday's Phi-Orl game."},
{"Date":"11/13/2000","Season":"2000-2001","Details":"The NBA fined Antoine Walker (Bos) $2,500 for verbally abusing a ref after the Bos-Phi game on Saturday."},
{"Date":"11/14/2000","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $5,000 for comments he made about the refs following Saturday's Sac-Dal game."},
{"Date":"11/20/2000","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $15,000 for confronting and verbally abusing the refs during and after Wednesday's Dal-Pho game."},
{"Date":"11/20/2000","Season":"2000-2001","Details":"The NBA fined Jason Kidd (Pho) $5,000 for his comments about the refs following Friday's NY-Pho game."},
{"Date":"11/22/2000","Season":"2000-2001","Details":"The NBA fined Karl Malone (Uta) $7,500 and suspended him for 1 game for throwing an elbow at Christian Laettner (Dal) during Monday's Dal-Uta game."},
{"Date":"11/22/2000","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $25,000 for verbally abusing and publicly criticizing the refs following Tuesday's Dal-Sea game."},
{"Date":"11/29/2000","Season":"2000-2001","Details":"The NBA suspended Don MacLean (Mia) for 5 games for testing positive for steroids."},
{"Date":"11/30/2000","Season":"2000-2001","Details":"The NBA fined Bonzi Wells (Por) $10,000 and suspended him for 1 game for intentionally striking and verbally abusing a ref during Thursday's Por-Sea game."},
{"Date":"11/30/2000","Season":"2000-2001","Details":"The NBA fined Doc Rivers (Orl coach) $7,500 for confronting and verbally abusing a ref following Thursday's Orl-Uta game."},
{"Date":"12/1/2000","Season":"2000-2001","Details":"The NBA fined Charles Oakley (Tor) $15,000 and suspended him for 3 games for punching Jeff McInnis (LAC) during Friday's morning shootaround."},
{"Date":"12/1/2000","Season":"2000-2001","Details":"The NBA fined Jason Williams (Sac) $10,000 for cursing and using obscene gestures towards fans after Wednesday's Sac-SA game."},
{"Date":"12/7/2000","Season":"2000-2001","Details":"The NBA fined Paul Silas (Cha coach) $5,000 for flipping off a ref after being ejected during Wednesday's Ind-Cha game."},
{"Date":"12/8/2000","Season":"2000-2001","Details":"In the final punishment for the Joe Smith illegal contracts saga, the NBA suspended Minnesota owner Glen Taylor through August 31 and VP of basketball operations Kevin McHale has agreed to take a leave of absence through July 31. Neither may attend games or practices or be involved in business operations in any way. The NBA also restored Minnesota's 2003 1st round draft pick. The NBA had revoked Minnesota's 2001 - 2005 1st round draft picks. Team lawyer Jack Regan was barred from representing Minnesota through August 31."},
{"Date":"12/20/2000","Season":"2000-2001","Details":"The NBA fined Tim Hardaway (Mia) $5,000 for unsportsmanlike conduct following his ejected during Wednesday's Cha-Mia game."},
{"Date":"12/21/2000","Season":"2000-2001","Details":"The NBA fined Jerry Sloan (Uta coach) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner after being ejected during Wednesday's Uta-Phi game."},
{"Date":"12/28/2000","Season":"2000-2001","Details":"Utah suspended John Starks for 1 game for violating team policies."},
{"Date":"12/28/2000","Season":"2000-2001","Details":"Washington suspended Rod Strickland for 1 game for skipping practice."},
{"Date":"1/2/2001","Season":"2000-2001","Details":"The NBA fined Corliss Williamson (Tor) $10,000 and suspended him for 1 game and fined Tom Gugliotta (Pho) $10,000 and suspended him for 1 game for fighting during Saturday's Tor-Pho game."},
{"Date":"1/2/2001","Season":"2000-2001","Details":"The NBA fined Chris Dudley (Pho) 5,000 for berating a ref and failing to leave the court in a timely manner following his ejection from Thursday's Pho-LAL game."},
{"Date":"1/3/2001","Season":"2000-2001","Details":"The NBA fined Chris Webber (Sac) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner following his ejection during Tuesday's Pho-Sac game."},
{"Date":"1/3/2001","Season":"2000-2001","Details":"The NBA fined Jerry Stackhouse (Det) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner following his ejection during Sunday's Det-Was game."},
{"Date":"1/3/2001","Season":"2000-2001","Details":"The NBA fined Kobe Bryant (LAL) $5,000 for failing to leave the court in a timely manner following his ejection from Saturday's LAC-LAL game."},
{"Date":"1/4/2001","Season":"2000-2001","Details":"Utah suspended John Starks for 2 games for violating team rules. Starks reportedly missed the team bus following Wednesday's Uta-LAL game."},
{"Date":"1/4/2001","Season":"2000-2001","Details":"The NBA fined Dallas owner Mark Cuban $250,000 for outbursts and actions concerning the refs after Wednesday's Det-Dal game. Cuban had a freeze frame of a missed goaltending call that would have tied the game with 12 seconds left placed on the JumboTron at the end of the game. It was an NBA record fine for an individual."},
{"Date":"1/11/2001","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $100,000 for "},
{"Date":"1/15/2001","Season":"2000-2001","Details":"Utah suspended Greg Ostertag for 1 game for missing practice on Sunday."},
{"Date":"1/16/2001","Season":"2000-2001","Details":"The NBA suspended Olden Polynice (Uta) for 1 game for his conviction for impersonating a police officer and disorderly conduct in a traffic incident. Polynice pleaded guilty to the charges and was sentenced to 18 months probation, fined $500, and order to receive counseling."},
{"Date":"1/16/2001","Season":"2000-2001","Details":"The NBA fined Shareef Abdul-Rahim (Van) $10,000 for comments he made about the reffing after Monday's LAL-Van game. Shaquille O'Neal (LAL) made the game winning basket at the end of the game and there were questions if O'Neal's shot was before time had expired."},
{"Date":"1/17/2001","Season":"2000-2001","Details":"The NBA fined Marcus Camby (NY) $25,000 and suspended him for 5 games for going after and throwing a punch at Danny Ferry (SA). Ferry was fined $7,500 and suspended for 1 game for throwing an elbow at Camby, which is what set Camby off."},
{"Date":"1/18/2001","Season":"2000-2001","Details":"Seattle suspended Gary Payton for 1 game for conduct detrimental to the team. Payton got into a verbal argument with teammate Ruben Patterson during the 4th quarter of Wednesday's Pho-Sea game."},
{"Date":"1/24/2001","Season":"2000-2001","Details":"The NBA fined Mario Elie (Pho) $7,500 for verbally abusing the refs and comments he made about the refs after Friday's GS-Pho game."},
{"Date":"1/30/2001","Season":"2000-2001","Details":"The NBA fined Bo Outlaw (Orl) $10,000 and suspended him for 1 game for intentionally making contact with a ref during Saturday's Orl-Mia game."},
{"Date":"1/30/2001","Season":"2000-2001","Details":"The NBA fined George Karl (Mil coach) $5,000 for comments he made about the refs following Saturday's Mil-Det game."},
{"Date":"2/2/2001","Season":"2000-2001","Details":"The NBA fined Rasheed Wallace (Por) $10,000 and suspended him for 2 games for hitting a ref with a towel following his ejection from Thursday's Por-Pho game."},
{"Date":"2/2/2001","Season":"2000-2001","Details":"The NBA fined Allen Iverson (Phi) $5,000 for making a derogatory remark towards abusive fans during Saturday's Phi-Ind game."},
{"Date":"2/2/2001","Season":"2000-2001","Details":"The NBA suspended Ruben Patterson (Sea) for 3 games for his conviction for breaking a man's jaw. Patterson pleaded guilty to an assault charge regarding the incident and was sentenced to 6 months probation."},
{"Date":"2/6/2001","Season":"2000-2001","Details":"The NBA fined coach Tim Floyd (Chi) $10,000 and suspended him for 1 game for intentionally making contract with a ref following his ejection from Monday's Chi-LAC game. The NBA also fined assistant coach Phil Johnson (Chi) $2,500 for confronting the ref following Floyd's ejection."},
{"Date":"2/9/2001","Season":"2000-2001","Details":"The NBA fined Kobe Bryant (LAL) $10,000 for missing Friday's media session."},
{"Date":"2/14/2001","Season":"2000-2001","Details":"The NBA suspended Matt Geiger (Phi) for 2 games for violating the terms of the league's steroids policy."},
{"Date":"2/14/2001","Season":"2000-2001","Details":"The NBA fined Dick Versace (Van president) $10,000 for comments he made about the Toronto Raptors during an interview February 13."},
{"Date":"2/16/2001","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $10,000 and suspended him for 2 games for going on the court during Thursday's Dal-Cle game. During a skirmish at the end of the game, Cuban came half way up the court before returning to his seat. The penalty is automatic for a team official entering the court."},
{"Date":"2/16/2001","Season":"2000-2001","Details":"The NBA fined Robert Traylor (Cle) $5,000 and suspended him for 1 game for throwing a punch at Courtney Alexander (Dal) during Thursday's Cle-Dal game."},
{"Date":"2/21/2001","Season":"2000-2001","Details":"The NBA fined Ron Artest (Chi) $7,500 and suspended him for 1 game and fined Glenn Robinson (Mil) $7,500 and suspended him for 1 game for their fight in Tuesday's Chi-Mil game."},
{"Date":"2/22/2001","Season":"2000-2001","Details":"The NBA fined Reggie Miller (Ind) $5,000 for making an obscene gesture towards the fans during Sunday's Ind-LAL game."},
{"Date":"3/1/2001","Season":"2000-2001","Details":"The NBA fined Chris Gatling (Cle) $10,000 for making derogatory and inappropriate comments toward a Toronto PR staff member following Tuesday's Cle-Tor game."},
{"Date":"3/6/2001","Season":"2000-2001","Details":"The NBA fined Greg Foster (LAL) $5,000 for verbally abusing the ref and failing to leave the court in a timely manner following his ejection during Sunday's LAL-GS game and fined Marc Jackson (GS) $2,500 for his involvement in the altercation."},
{"Date":"3/7/2001","Season":"2000-2001","Details":"The NBA suspended Isaiah Rider (LAL) for 5 games for violating the terms of the league's anti-drug program."},
{"Date":"3/7/2001","Season":"2000-2001","Details":"The NBA suspended Lamar Odom (LAC) for 5 games for violating the terms of the league's anti-drug program."},
{"Date":"3/7/2001","Season":"2000-2001","Details":"The NBA fined Reggie Miller (Ind) $10,000 and suspended him for 1 game for hitting a ref with a wad of chewing gum during Tuesday' Ind-NY game."},
{"Date":"3/13/2001","Season":"2000-2001","Details":"The NBA fined Jason Williams (Sac) $10,000 for directing profanity at the fans during Wednesday's Sac-GS game."},
{"Date":"3/13/2001","Season":"2000-2001","Details":"The NBA fined Shaquille O'Neal (LAL) $5,000 for criticizing the refs following Sunday's LAL-Sea game."},
{"Date":"3/14/2001","Season":"2000-2001","Details":"The NBA fined Tracy McGrady (Orl) $10,000 and suspended him for 2 games for throwing the ball at Bobby Jackson's (Sac) face and fined Jackson $7,500 and suspended him for 1 game for shoving McGrady in retaliation during Tuesday's Orl-Sac game. The NBA also fined Vlade Divac (Sac), Scot Pollard (Sac), and Art Long (Sac) $5,000 and suspended them for 1 game for leaving the bench during the ensuing scuffle."},
{"Date":"3/14/2001","Season":"2000-2001","Details":"The NBA fined George Karl (Mil) $50,000 for disparaging comments he made about Seattle, his former team, in February. Karl had been fined $25,000 in March 1999 for comments he made about Seattle and was warned not to comment further on his former team."},
{"Date":"3/14/2001","Season":"2000-2001","Details":"The NBA fined Rudy Tomjanovich $5,000 for criticizing the refs after Sunday's Hou-Pho game."},
{"Date":"3/23/2001","Season":"2000-2001","Details":"The NBA fined Scottie Pippen (Por) $5,000 for yelling at a ref and failing to leave the court in a timely manner following his ejection from Tuesday's Dal-Por game."},
{"Date":"3/23/2001","Season":"2000-2001","Details":"Washington suspended Michael Smith for 2 games for conduct determental to the team."},
{"Date":"4/3/2001","Season":"2000-2001","Details":"The NBA fined Charles Oakley (Tor) $10,000 and suspended him for 1 game for throwing a ball at Tyrone Hill after Tuesday's morning shoot around."},
{"Date":"4/3/2001","Season":"2000-2001","Details":"The NBA suspended Rod Strickland (Por) for his conviction for DUI."},
{"Date":"4/3/2001","Season":"2000-2001","Details":"Denver suspended Nick Van Exel for 1 game for missing 2 workouts."},
{"Date":"4/3/2001","Season":"2000-2001","Details":"Portland suspended Rasheed Wallace for 1 game for inappropriate game conduct."},
{"Date":"4/9/2001","Season":"2000-2001","Details":"The NBA fined Lamar Odom (LAC) $7,500 for verbally abusing a ref and failing to leave the court in a timely manner following his ejection in Friday's LAC-Mil game."},
{"Date":"4/12/2001","Season":"2000-2001","Details":"The NBA fined Lorenzen Wright (Atl) $7,500 and suspended him for 1 game and fined Chris Gatling (Cle) $7,500 and suspended him for 1 game for their altercation in Wednesday's Cle-Atl game."},
{"Date":"4/13/2001","Season":"2000-2001","Details":"The NBA fined Mark Cuban (Dal owner) $100,000 and suspended him for one game for making an derogatory gesture at the refs during Wednesday's Pho-Dal game and for his remarks about the refereeing after the game. Cuban says that the gesture was the choking sign (hands to throat)."},
{"Date":"4/16/2001","Season":"2000-2001","Details":"Portland suspended Rasheed Wallace for 1 game for throwing a towel at teammate Arvydas Sabonis during a timeout during Sunday's Por-LAL game. Sabonis had accidentally hit Wallace in the face during the game."},
{"Date":"4/16/2001","Season":"2000-2001","Details":"The NBA fined Jason Williams (Sac) $25,000 for inappropriate conduct towards the fans during Thursday's Sac-SA game."},
{"Date":"4/16/2001","Season":"2000-2001","Details":"The NBA fined Kevin Garnett (Min) $7,500 for making an obscene gesture towards the ref following his ejection from Sunday's Min-Uta game."},
{"Date":"4/17/2001","Season":"2000-2001","Details":"The NBA fined player agent Eric Fleisher $57,000 and suspended him for 6 months for negotiating an illegal contract with Joe Smith and Minnesota."},
{"Date":"4/20/2001","Season":"2000-2001","Details":"The NBA fined Rasheed Wallace (Por) $10,000 for failing to make himself available for a media session. Portland was also fined $25,000."},
{"Date":"4/25/2001","Season":"2000-2001","Details":"The NBA fined Dale Davis (Por) $7,500 for verbally abusing the refs during Sunday's Por-LAL game."},
{"Date":"4/27/2001","Season":"2000-2001","Details":"The NBA fined Dale Davis (Por) $15,000 and suspended him for 1 game for throwing an elbow at Robert Horry (LAL) during Thursday's Por-LAL game. The NBA also fined Stacey Augmon (Por) $5,000 and suspended him for 1 game for leaving the bench during the altercation and fined Portland a matching $5,000."},
{"Date":"4/30/2001","Season":"2000-2001","Details":"The NBA fined Dee Brown (Orl) $5,000 and suspended him for 1 game for coming off the bench during an altercation in Saturday's Orl-Mil game. Orlando was fined a matching $5,000."},
{"Date":"5/1/2001","Season":"2000-2001","Details":"The NBA fined Tim Thomas $5,000 for making an obscene gesture toward Orlando fans during Saturday's Orl-Mil game."},
{"Date":"5/4/2001","Season":"2000-2001","Details":"The LA Clippers released Keith Closs. The Clippers had suspended him before the season started for lack of physical conditioning. He had one more year on his contract."},
{"Date":"5/7/2001","Season":"2000-2001","Details":"The NBA fined Keon Clark (Tor) $7,500 for throwing ice at fans sitting behind the Toronto bench during Sunday's Tor-Phi game."},
{"Date":"5/14/2001","Season":"2000-2001","Details":"The NBA suspended Michael Smith (Was) for one game (the first game of the 2001-02 regular season) for his guilty plea for driving while intoxicated."},
{"Date":"6/2/2001","Season":"2000-2001","Details":"The NBA suspended Scott Williams (Mil) for 1 game. The league upgraded his flagrant foul-level 1 from Game 6 vs Philadelphia where he threw a forearm at Allen Iverson (Phi) to a level 2 and that combined with 2 level 1 flagrant fouls he received earlier in the playoffs gave him a total of 4 flagrant foul points. A player who accumulates 4 flagrant foul points in the playoffs is automatically suspended."},
{"Date":"6/5/2001","Season":"2000-2001","Details":"The NBA fined Ray Allen (Mil) $10,000, George Karl (Mil) $25,000, and the Milwaukee Bucks $50,000 for disparing comments made about the officiating during the Mil-Phi series."},
{"Date":"6/26/2001","Season":"2001-2002","Details":"As expected, the NBA moved up the free agent signing date from August 1 to July 18. Teams may begin talking to free agents July 1, but can not sign them or make trades until July 18. The free agent signing date for 2002 will be July 17 and for 2003 will be July 16. With the signing date moved up, the league also reduced Kevin McHale's (Min) suspension to end July 18 (was August 1)."},
{"Date":"7/13/2001","Season":"2001-2002","Details":"The NBA suspended Ruben Patterson (Sea) for the first 5 games of the season for his conviction of a sexual offense. Patterson entered a modified guilty plea to a charge of attempted rape and was sentence to 1 year in prison with all but 15 days suspended and 2 years probation."},
{"Date":"8/30/2001","Season":"2001-2002","Details":"Stephon Marbury (Pho) pleaded no contested to extreme driving under the influence and was sentenced to 10 days in jail, fined $1,000, and required to attend alcohol education classes. The NBA suspended Marbury for 1 game (the first game of the regular season)."},
{"Date":"10/7/2001","Season":"2001-2002","Details":"New York fined Latrell Sprewell $250,000 for failing to tell the team that he had broken his hand 2 weeks before training camp was to start. He underwent surgery on the hand October 1 and is expected to be out at least 6 weeks."},
{"Date":"10/14/2001","Season":"2001-2002","Details":"The NBA suspended Derrick Coleman (Phi) for one game for his guilty plea for drunken driving. Coleman will miss the first game of the regular season."},
{"Date":"10/19/2001","Season":"2001-2002","Details":"The NBA fined Antoine Walker (Bos) $5,000 for verbally abusing a ref and failing to leave the court in a timely manner after his ejection from Wednesday's Bos-Cle game."},
{"Date":"11/2/2001","Season":"2001-2002","Details":"The NBA fined Nick Van Exel (Den) $10,000 for criticizing the refs after Friday's Mil-Den game."},
{"Date":"11/5/2001","Season":"2001-2002","Details":"The NBA suspended Lamar Odom (LAC) for 5 games for violating the league's anti-drug program. This is the 2nd drug related suspension for Odom."},
{"Date":"11/5/2001","Season":"2001-2002","Details":"The NBA fined Alvin Gentry (LAC) $7,500 for verbally abusing the refs during Saturday's GS-LAC game."},
{"Date":"11/5/2001","Season":"2001-2002","Details":"The NBA fined Dan Issel (Den) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner following his ejection from Saturday's Den-Sac game."},
{"Date":"11/7/2001","Season":"2001-2002","Details":"The LA Clippers placed Lamar Odom on the suspended list."},
{"Date":"11/8/2001","Season":"2001-2002","Details":"The NBA fined Keon Clark (Tor) $7,500 and suspended him for 1 game for throwing an elbow at Troy Murphy's (GS) head during Wednesday's GS-Tor game."},
{"Date":"11/9/2001","Season":"2001-2002","Details":"The NBA fined Nick Van Exel (Den) $20,000 for comments he made about the refs following Thursday's Dal-Den game."},
{"Date":"11/9/2001","Season":"2001-2002","Details":"Chicago fined Charles Oakley $50,000 for criticizing coach Tim Floyd."},
{"Date":"11/14/2001","Season":"2001-2002","Details":"Milwaukee fined Jason Caffey $10,000 and docked him a game's pay for missing Tuesday's team flight and Wednesday's practice and game vs Washington."},
{"Date":"11/16/2001","Season":"2001-2002","Details":"The NBA fined Pat Riley (Mia) $10,000 for criticizing the refs following Thursday's Mia-NY game."},
{"Date":"11/20/2001","Season":"2001-2002","Details":"The NBA fined Shaquille O'Neal (LAL), Kobe Bryant (LAL, Tracy McGrady (Orl), Nick Van Exel (Den), Andre DeClercq (Orl), Eric Piatkowski (LAC), Quentin Richardson (LAC), Jeff McInnis (LAC), and Dana Barros (Det) $5,000 for wearing their shorts too low during games."},
{"Date":"11/21/2001","Season":"2001-2002","Details":"The NBA lifted Lamar Odom's (LAC) suspension. Odom had missed 8 games due to violating the terms of the NBA's anti-drug policy. The Clippers also activated Odom from the suspended list."},
{"Date":"11/26/2001","Season":"2001-2002","Details":"The NBA fined Kobe Bryant (LAL) $7,500 for verbally abusing a ref and failing to leave the court in a timely manner after he was ejected during Friday's LAL-GS game."},
{"Date":"12/3/2001","Season":"2001-2002","Details":"The NBA fined Shaquille O'Neal (LAL) $7,500 for verbally abusing a ref and failing to leave the court in a timely manner following his ejection from Friday's LAL-Sea game."},
{"Date":"12/4/2001","Season":"2001-2002","Details":"The NBA fined Brad Miller (Chi) $7,500 for kicking a chair into the stands during Saturday's Chi-Phi game."},
{"Date":"12/12/2001","Season":"2001-2002","Details":"Denver suspended head coach Dan Issel for 4 games for his ethnic and profanity laced remark made to a fan following Tuesday's Den-Cha game. Issel apologized for his actions."},
{"Date":"12/14/2001","Season":"2001-2002","Details":"The NBA suspended Maurice Taylor (Hou) for 5 games for violating the league's anti-drug program. Taylor admitted to using marijuana. Because Taylor is on IR, the suspension will start with the first game Taylor is physically able to play."},
{"Date":"12/15/2001","Season":"2001-2002","Details":"The NBA fined Cuttino Mobley (Hou) $7,500 for publicly criticizing the refs."},
{"Date":"12/24/2001","Season":"2001-2002","Details":"The NBA fined Kenyon Martin (NJ) $7,500 and suspended him for 1 game for his flagrant foul against Karl Malone (Uta) during Friday's NJ-Uta game."},
{"Date":"12/28/2001","Season":"2001-2002","Details":"The NBA reinstated Minnesota's 2005 1st round draft pick. Minnesota had lost the pick as part of the punishment for their illegal deal with Joe Smith, but the NBA gave that pick back citing Minnesota's good behavior. Minnesota still lost 3 draft picks (2001, 2002, 2004) for the violation in addition to other fines and suspensions."},
{"Date":"12/31/2001","Season":"2001-2002","Details":"The NBA fined Derrick Coleman (Phi) $7,500 and suspended him for 1 game for the punch he threw at Karl Malone (Uta) during Saturday's Phi-Uta game."},
{"Date":"12/31/2001","Season":"2001-2002","Details":"The NBA fined coach Larry Brown (Phi) $7,500 for criticizing the refs following Saturday's Phi-Uta game."},
{"Date":"1/3/2002","Season":"2001-2002","Details":"The NBA fined Tim Thomas (Mil) $7,500 for criticizing the refs following Monday's Mil-Chi game."},
{"Date":"1/5/2002","Season":"2001-2002","Details":"The NBA fined Kenyon Martin (NJ) $15,000 and suspended him for 2 games for throwing a punch at Tracy McGrady (Orl) during Friday's NJ-Orl game. McGrady was also fined $5,000 for retaliating with a shove."},
{"Date":"1/8/2002","Season":"2001-2002","Details":"The NBA fined Dallas owner Mark Cuban $500,000 for comments about the officiating after the Dal-SA game and comments about league head ref Ed Rush. It is the largest fine the NBA has handed out to an individual (surpassing the record $250,000 given to Cuban last year)."},
{"Date":"1/8/2002","Season":"2001-2002","Details":"Memphis fined Jason Williams for comments detrimental to the team."},
{"Date":"1/14/2002","Season":"2001-2002","Details":"The NBA came down with the fines and suspensions for Saturday's fight in the Lakers-Chicago game. Shaquille O'Neal (LAL) was fined $15,000 and suspended 3 games for throwing punches at Brad Miller after O'Neal was fouled hard by Miller and Charles Oakley. Miller was fined $7,500 and suspended for 1 game for a flagrant foul, level 2 on O'Neal. Oakley was fined $10,000 and suspended for 2 games for his flagrant foul, level 2 on O'Neal. Oakley received 1 game for the flagrant and 1 game for amassing a certain number of flagrant foul points."},
{"Date":"1/14/2002","Season":"2001-2002","Details":"The NBA fined Mitch Richmond (LAL) $5,000 for making an obscene gesture towards the fans in the Det-LAL game on January 8."},
{"Date":"1/14/2002","Season":"2001-2002","Details":"The NBA fined John Lucas (Cle coach) $7,500 for verbally abusing the refs and not leaving the court in a timely manner after the Cle-Sea game on Friday."},
{"Date":"1/22/2002","Season":"2001-2002","Details":"The NBA fined Kenny Thomas (Hou) $15,000 and suspended him for 3 games and fined Shareef Abdur-Rahim (Atl) $15,000 and suspended him for 3 games for their fight in Monday's Hou-Atl game. Jason Terry (Atl) was also fined $7,500 and suspended for 1 game for throwing a punch during the altercation."},
{"Date":"1/30/2002","Season":"2001-2002","Details":"The NBA fined Chris Webber (Sac) $7,500 and suspended him for 1 game for deliberately throwing an elbow at Jarron Collins (Uta) during Saturday's Uta-Sac game."},
{"Date":"2/1/2002","Season":"2001-2002","Details":"The NBA fined Jahidi White (Was) $7,500 and suspended him for 1 game for head-butting Zydrunas Ilgauskas (Cle) during Thursday' Was-Cle game. Ilgauskas was fined $5,000 for his actions and DeSagana Diop (Cle) was fined $5,000 and suspended for 1 game for leaving the bench during the altercation."},
{"Date":"2/2/2002","Season":"2001-2002","Details":"Golden State suspended Marc Jackson for 2 game for conduct detrimental to the team."},
{"Date":"2/5/2002","Season":"2001-2002","Details":"The NBA fined Stephen Jackson (SA) $7,500 and suspended him for 1 game for his flagrant foul on Loren Woods (Min) during Monday's SA-Min game."},
{"Date":"2/6/2002","Season":"2001-2002","Details":"The NBA fined Juwan Howard (Dal) $7,500 and suspended him for 1 game for throwing an elbow at Jamaal Tinsley (Ind) during Tuesday's Dal-Ind game."},
{"Date":"2/9/2002","Season":"2001-2002","Details":"The NBA fined Allen Iverson (Phi) and Michael Jordan (Was) $10,000 for skipping Friday's media session."},
{"Date":"2/11/2002","Season":"2001-2002","Details":"Utah suspended Greg Ostertag for 1 game for bumping coach Jerry Sloan during Tuesday's Uta-Mem game."},
{"Date":"2/12/2002","Season":"2001-2002","Details":"Indiana suspended Carlos Rogers for not reporting to the team following the All-Star break."},
{"Date":"2/14/2002","Season":"2001-2002","Details":"The NBA suspended Rodney Buford (Mem) for 5 games for violating the league's substance abuse policy."},
{"Date":"2/14/2002","Season":"2001-2002","Details":"The NBA fined Elden Campbell (Cha) $3,500 for a flagrant foul during Wednesday's Cha-Chi game."},
{"Date":"2/15/2002","Season":"2001-2002","Details":"The NBA suspended DeShawn Stevenson (Uta) for 3 games after pleading no contest to statutory rape."},
{"Date":"2/18/2002","Season":"2001-2002","Details":"The NBA fined Derrick Coleman (Phi) $12,500 and suspended him for 2 games for grabbing Reggie Miller's (Ind) throat and throwing a punch, fined Miller (Ind) $7,500 and suspended him for 1 game for throwing a punch at Coleman, and fined Corie Blount (Phi) $5,000 and suspended him for 1 game for leaving the bench during the altercation."},
{"Date":"2/18/2002","Season":"2001-2002","Details":"The NBA fined Baron Davis (Cha) $7,500 for verbally abusing the refs during Sunday's Cha-Mem game."},
{"Date":"2/19/2002","Season":"2001-2002","Details":"The NBA suspended Clifford Robinson (Det) for 1 game for his guilty plea for driving under the influence."},
{"Date":"2/22/2002","Season":"2001-2002","Details":"The NBA suspended Shawn Kemp (Por) for violating the league's anti-drug program. Kemp is suspended until he has "},
{"Date":"3/2/2002","Season":"2001-2002","Details":"The NBA fined Kobe Bryant (LAL) $12,500 and suspended him for 2 games and fined Reggie Miller (Ind) $10,000 and suspended him for 2 games for their fight following Friday's Ind-LAL game."},
{"Date":"3/2/2002","Season":"2001-2002","Details":"The NBA fined Bruce Bowen (SA) $7,500 and assessed him a flagrant foul for his flying kick that hit Wally Szczerbiak (Min) in the face during Friday's SA-Min game."},
{"Date":"3/4/2002","Season":"2001-2002","Details":"The NBA suspended Kenyon Martin (NJ) for 1 game for collecting his 6th flagrant foul point of the season. A player is automatically suspended when he receives 6 flagrant foul points (a flagrant foul level 1 is worth 1 point and a flagrant foul level 2 is worth 2 points). Martin will be suspended for 1 game for each flagrant foul point he collects for the rest of the season."},
{"Date":"3/4/2002","Season":"2001-2002","Details":"The NBA fined Bonzi Wells (Por) $7,500 for throwing a forearm at Darvin Ham (Mil) during Saturday's Mil-Por game."},
{"Date":"3/4/2002","Season":"2001-2002","Details":"The NBA lifted Shawn Kemp's (Por) suspension for violating the league's anti-drug program. Kemp served a 5 game suspension."},
{"Date":"3/6/2002","Season":"2001-2002","Details":"The NBA fined Doc Rivers (Orl) $7,500 for failing to leave the court in a timely manner and comments made to the media following his ejection in Tuesday's Orl-Ind game."},
{"Date":"3/7/2002","Season":"2001-2002","Details":"The NBA fined Jason Kidd (NJ) $5,000 for making an obscene gesture towards the fans after Wednesday's Pho-NJ game."},
{"Date":"3/13/2002","Season":"2001-2002","Details":"The NBA fined Nate McMillan (Sea) $7,500 for publicly criticizing the refs and fined Rashard Lewis (Sea) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner following Monday's Dal-Sea game."},
{"Date":"3/13/2002","Season":"2001-2002","Details":"The NBA fined Byron Scott (NJ) $7,500 for publicly criticizing the refs following Saturday's NJ-Sea game."},
{"Date":"3/14/2002","Season":"2001-2002","Details":"The NBA fined Gary Trent (Min) $3,000 for throwing a notebook (and scattering papers everywhere) following his ejection from Wednesday's Min-Hou game."},
{"Date":"3/15/2002","Season":"2001-2002","Details":"The NBA fined Dale Davis (Por) $12,500 and suspended him for 2 games for throwing a punch at Shawn Bradley (Dal) during Thursday's Dal-Por game."},
{"Date":"3/15/2002","Season":"2001-2002","Details":"The NBA suspended Danny Fortson (GS) for 2 games for collecting his 6th and 7th flagrant foul points of the season. Fortson was assessed 2 flagrant fouls (level 1) during Thursday's GS-LAL game. Each flagrant foul point over 5 results in an automatic suspension."},
{"Date":"3/16/2002","Season":"2001-2002","Details":"The NBA fined Tim Hardaway (Den) $10,000 and suspended him for 2 games for verbal confrontation with the refs, failing to leave the court in a timely manner, and throwing a TV monitor on the court after his ejection during Friday's Den-Orl game."},
{"Date":"3/17/2002","Season":"2001-2002","Details":"The NBA suspended Kenyon Martin (NJ) for 1 game for collecting a flagrant foul during Friday's NJ-Mia game. Martin is over the flagrant foul point limit and will automatically receive a 1 game suspension for each flagrant foul point he receives for the rest of the season."},
{"Date":"3/25/2002","Season":"2001-2002","Details":"The NBA suspended Kenyon Martin (NJ) for 2 games for collecting his 8th flagrant foul point of the season. Martin received a flagrant foul during Sunday's Atl-NJ game. Once a player reaches 8 flagrant foul points, each flagrant foul point automatically results in a 2 game suspension (5 to 7 points is a 1 game suspension)."},
{"Date":"3/27/2002","Season":"2001-2002","Details":"The NBA fined Jermaine O'Neal (Ind) $10,000 and suspended him for 2 games for throwing punches during Tuesday's Ind-Det game and fined Corliss Williamson (Det) $5,000 for throwing the ball at O'Neal's head. The NBA also fined Jonathan Bender (Ind), Primoz Brezec (Ind), and Bruno Sundov (Ind) $5,000 and suspended them for 1 game for leaving the bench during the altercation."},
{"Date":"3/30/2002","Season":"2001-2002","Details":"The NBA suspended Danny Fortson (GS) for 2 games for collecting his 8th flagrant foul point. A player is automatically suspended for 2 games for each flagrant foul point 8 and over."},
{"Date":"4/1/2002","Season":"2001-2002","Details":"The NBA fined Larry Brown (Phi) $10,000 for publically criticizing the refs following Saturday's Phi-NJ game."},
{"Date":"4/1/2002","Season":"2001-2002","Details":"The NBA fined Sam Cassell (Mil) $5,000 for kicking the ball off the scoreboard during Friday's Mil-Was game."},
{"Date":"4/3/2002","Season":"2001-2002","Details":"Utah suspended John Amaechi for 1 game after Amaechi got in a verbal confrontation with coach Jerry Sloan."},
{"Date":"4/5/2002","Season":"2001-2002","Details":"The LA Clippers fined Michael Olowokandi $50,000 for behavior detrimental to the team. Olowokandi skipped a team breakfast because he said he needed the sleep."},
{"Date":"4/5/2002","Season":"2001-2002","Details":"Milwaukee suspended Rafer Alston for 1 game for missing practice on Thursday."},
{"Date":"4/9/2002","Season":"2001-2002","Details":"The NBA suspended Marc Jackson (Min) for 1 game for his flagrant foul on Bob Sura (GS) during Monday's Min-GS game."},
{"Date":"4/11/2002","Season":"2001-2002","Details":"The NBA fined Scottie Pippen (Por) $7,500 and suspended him for 1 game for throwing a punch at Nick Van Exel (Dal) during Tuesday's Dal-Por game."},
{"Date":"4/14/2002","Season":"2001-2002","Details":"New York suspended Latrell Sprewell for 1 game for missing a shoot around."},
{"Date":"4/17/2002","Season":"2001-2002","Details":"The NBA fined Jason Terry (Atl) $10,000 and suspended him for 1 game and fined Don Reid (Orl) $7,500 and suspended him for 1 game for their fight during Monday's Atl-Orl game."},
{"Date":"5/1/2002","Season":"2001-2002","Details":"The NBA fined Jamaal Magloire (Cha) $7,500 and suspended him for 1 game for his flagrant foul on Tracy McGrady (Orl) during Tuesday's Cha-Orl game."},
{"Date":"5/28/2002","Season":"2001-2002","Details":"The NBA fined Cleveland $150,000 and suspended coach John Lucas for the first 2 games of next season for including high school junior LeBron James in a voluntary team workout. NBA rules prohibit teams from having contact with players not yet eligible for the NBA draft."},
{"Date":"10/14/2002","Season":"2002-2003","Details":"The NBA suspended Zydrunas Ilgauskas (Cle) for one game for his no-contest plea for drunken driving. Ilgauskas will miss the first game of the regular season."},
{"Date":"10/18/2002","Season":"2002-2003","Details":"The NBA fined Dallas $150,000 and suspended Don Nelson and Donn Nelson for the first 2 games of the regular season for contact with players who were ineligible for the NBA draft. The Nelsons attended private workouts in Yugoslavia in June."},
{"Date":"10/21/2002","Season":"2002-2003","Details":"New York suspended Latrell Sprewell for 1 game for not following the team's instructions for rehabilitating his broken right hand."},
{"Date":"10/22/2002","Season":"2002-2003","Details":"New Jersey suspended Chris Childs indefinitely for failure to be in playing condition."},
{"Date":"10/25/2002","Season":"2002-2003","Details":"The NBA fined Juwan Howard (Den) $15,000 and suspended him for 2 games for throwing punches at Al Harrington (Ind) and Jermaine O'Neal (Ind) during Wednesday's Den-Ind game."},
{"Date":"10/28/2002","Season":"2002-2003","Details":"The NBA suspended Rick Fox (LAL) for 6 games and suspended Doug Christie (Sac) for 2 games for their altercation in Friday's LAL-Sac game. The two threw punches (open fist for Fox) on the court and then Fox ran around in the hallway to where Christie left the court and continued the fight in the tunnel area."},
{"Date":"11/2/2002","Season":"2002-2003","Details":"The NBA fined Jason Kidd (NJ) $5,000 for his thrown elbow at Jamaal Tinsley (Ind) during Friday's NJ-Ind game."},
{"Date":"11/11/2002","Season":"2002-2003","Details":"The NBA suspended Bonzi Wells (Por) for 1 game for spitting on Danny Ferry (SA) during Friday's Por-SA game."},
{"Date":"11/12/2002","Season":"2002-2003","Details":"The NBA suspended Chauncey Billups (Det) for 1 game for throwing a ball at the ref during Saturday's Det-Dal game."},
{"Date":"11/12/2002","Season":"2002-2003","Details":"The NBA suspended Soumalia Samake (LAL) for 5 games for violating the league's steroid policy."},
{"Date":"11/29/2002","Season":"2002-2003","Details":"Cleveland suspended Ricky Davis for 2 games for disciplinary reasons."},
{"Date":"12/3/2002","Season":"2002-2003","Details":"New Jersey activated Brandon Armstrong and placed Kerry Kittles (sprained left knee) and Chris Childs (tendinitis right Achilles) on IR. Childs had been on the suspended list."},
{"Date":"12/5/2002","Season":"2002-2003","Details":"Portland fined Ruben Patterson $100,000 for conduct detrimental to the team for his recent arrest for domestic abuse. The charges were dropped."},
{"Date":"12/9/2002","Season":"2002-2003","Details":"The NBA suspended Rashard Lewis (Sea) for 1 game for shoving a fist in the face of Travis Best (Mia) during Saturday's Sea-Mia game."},
{"Date":"12/9/2002","Season":"2002-2003","Details":"The NBA fined Greg Ostertag (Uta) $7,500 for failing to leave the court in a timely manner following his ejection during Sunday's Uta-LAL game."},
{"Date":"12/10/2002","Season":"2002-2003","Details":"The NBA suspended Tony Battie (Bos) for 1 game for kicking the ball and the ball striking a ref during Monday's Bos-Orl game."},
{"Date":"12/11/2002","Season":"2002-2003","Details":"The NBA fined Kurt Thomas (NY) $5,000 for shoving Vladimir Radmanovic (Sea) after Tuesday's NY-Sea game."},
{"Date":"12/18/2002","Season":"2002-2003","Details":"The NBA fined Pat Riley (Mia) $50,000 for his comments regarding the refs."},
{"Date":"12/18/2002","Season":"2002-2003","Details":"Seattle fined Kenny Anderson for missing Tuesday's practice."},
{"Date":"12/19/2002","Season":"2002-2003","Details":"The NBA fined Ron Artest (Ind) $10,000 for shoving Raja Bell (Dal) and failing to leave the court in a timely manner following his ejection during Tuesday's Dal-Ind game."},
{"Date":"12/21/2002","Season":"2002-2003","Details":"The NBA suspended Bonzi Wells (Por) for 2 games for throwing a punch at Chris Mills (GS) and fighting at the end of Friday's Por-GS game."},
{"Date":"12/21/2002","Season":"2002-2003","Details":"The NBA fined Rasheed Wallace (Por) $15,000 for attempting to go into the stands after Friday's Por-GS game."},
{"Date":"12/22/2002","Season":"2002-2003","Details":"The NBA suspended Chris Mills (GS) for 3 games for fighting with Bonzi Wells (Por), trying to getting into Portland's locker room, and blocking Portland's team bus following Friday's Por-GS game."},
{"Date":"12/30/2002","Season":"2002-2003","Details":"Minnesota indefinitely suspended Loren Woods for detrimental conduct."},
{"Date":"12/31/2002","Season":"2002-2003","Details":"The NBA fined Clarence Weatherspoon (NY) $20,000 and suspended him for 1 game and suspended Kevin Willis (SA) for 1 game for their fight during Monday's SA-NY game."},
{"Date":"1/3/2003","Season":"2002-2003","Details":"Utah suspended John Amaechi for 1 game for violating team rules."},
{"Date":"1/4/2003","Season":"2002-2003","Details":"The NBA fined Ron Artest (Ind) $35,000 and suspended him for 3 games for throwing a television monitor and smashing a $100,000 TV camera after Friday's Ind-NY game"},
{"Date":"1/16/2003","Season":"2002-2003","Details":"The NBA reinstated Stanley Roberts. Roberts had been suspended by the NBA in 3 years ago for violating the league's anti-drug policy."},
{"Date":"1/18/2003","Season":"2002-2003","Details":"The NBA suspended Rasheed Wallace (Por) for 7 games for confronting and threatening a ref after Wednesday's Por-Mem game."},
{"Date":"1/29/2003","Season":"2002-2003","Details":"The NBA suspended Jerry Sloan (Uta) for 7 games for shoving a ref during Tuesday's Uta-Sac game."},
{"Date":"1/29/2003","Season":"2002-2003","Details":"The NBA suspended Ron Artest (Ind) for 4 games for flipping off the crowd and his interaction with Pat Riley (Mia) during Monday's Ind-Mia game."},
{"Date":"2/1/2003","Season":"2002-2003","Details":"The NBA suspended Isiah Thomas (Ind) for 2 games for his role in a fight during Friday's Ind-Tor game."},
{"Date":"2/11/2003","Season":"2002-2003","Details":"The NBA suspended indefinitely Shawn Kemp (Orl) for violating the terms of the league's anti-drug policy. It was the 3rd time he has violated the policy and he will remain suspended until he resumes compliance with his treatment program."},
{"Date":"2/11/2003","Season":"2002-2003","Details":"The NBA fined Pat Riley (Mia) $20,000 for his comments about the officiating following Wednesday's Por-Mia game."},
{"Date":"2/14/2003","Season":"2002-2003","Details":"The NBA reinstated Shawn Kemp. Kemp had been suspended for violating the league's anti-drug policy."},
{"Date":"2/24/2003","Season":"2002-2003","Details":"The NBA fined Nick Van Exel (Dal) $20,000 for verbally abusing the refs following Sunday's Was-Dal game."},
{"Date":"2/26/2003","Season":"2002-2003","Details":"The NBA suspended Eduardo Najera (Dal) for 1 game for contact with a ref during Tuesday's Dal-Orl game."},
{"Date":"2/26/2003","Season":"2002-2003","Details":"Indiana suspended Ron Artest for 1 game for disciplinary reasons."},
{"Date":"2/27/2003","Season":"2002-2003","Details":"Boston suspended indefinitely Vin Baker so that he could attend to personal problems."},
{"Date":"3/7/2003","Season":"2002-2003","Details":"The NBA fined Nate McMillan (Sea) $7,500 and fined Jeromes James (Sea) $5,000 for their comments about the officiating following Wednesday's Sea-Uta game."},
{"Date":"3/9/2003","Season":"2002-2003","Details":"The NBA suspended Ron Artest (Ind) for 1 game after Artest collected his 6th flagrant foul point."},
{"Date":"3/11/2003","Season":"2002-2003","Details":"Portland suspended Bonzi Wells for 1 game for conduct detrimental to the team."},
{"Date":"3/11/2003","Season":"2002-2003","Details":"The NBA fined Larry Brown (Phi) $7,500 and fined Allen Iverson (Phi) $7,500 for criticizing a ref following Sunday's Phi-LAL game."},
{"Date":"3/13/2003","Season":"2002-2003","Details":"The NBA suspended Ron Artest (Ind) for 1 game for his flagrant foul during Wednesday's Ind-Phi game. Artest has exceeded the maximum number of flagrant foul points allowed and will be suspended for 1 game for each flagrant foul point he earns the rest of the regular season."},
{"Date":"3/20/2003","Season":"2002-2003","Details":"The NBA suspended Ron Artest (Ind) for 2 games for accumulating 8 flagrant foul points. Every flagrant foul he receives for the rest of the regular season will now result in a 2 game suspension."},
{"Date":"3/27/2003","Season":"2002-2003","Details":"Seattle suspended Joseph Forte for 1 game for conduct detrimental to the team."},
{"Date":"4/3/2003","Season":"2002-2003","Details":"The NBA fined Ron Artest (Ind) $20,000 for his obscene gesture to the crowd during Wednesday's Ind-Cle game."},
{"Date":"4/3/2003","Season":"2002-2003","Details":"Portland fined Zach Randolph $100,000 and suspended him for 2 games for throwing a punch at teammate Ruben Patterson during practice."},
{"Date":"4/12/2003","Season":"2002-2003","Details":"Golden State suspended Danny Fortson for the last 4 games of the season for conduct detrimental to the team."},
{"Date":"4/15/2003","Season":"2002-2003","Details":"The NBA suspended Rashard Lewis (Sea) for 1 game for throwing his mouth piece at the ref following his ejection in Monday's Sea-Dal game."},
{"Date":"4/15/2003","Season":"2002-2003","Details":"The NBA suspended Troy Murphy (GS) and Sean Rooks (LAC) for 1 game for their fight during Monday's LAC-GS game."},
{"Date":"4/20/2003","Season":"2002-2003","Details":"The NBA suspended Kevin Willis (SA) for 1 game for his flagrant foul on Scott Williams (Pho) during Saturday's SA-Pho game."},
{"Date":"4/21/2003","Season":"2002-2003","Details":"Utah suspended DeShawn Stevenson for conduct detrimental to the team."},
{"Date":"4/24/2003","Season":"2002-2003","Details":"The NBA fined Robert Horry (LAL) $10,000 for shoving a camera man during Thursday's LAL-Min game."},
{"Date":"4/28/2003","Season":"2002-2003","Details":"The NBA fined Rasheed Wallace (Por) $10,000 for failing to cooperate with the media after Sunday's Por-Dal game and $20,000 for not participating in Monday's media access period. Portland was also fined $50,000 for not ensuring that Wallace complied with the NBA media interview rules for the 2 days."},
{"Date":"4/28/2003","Season":"2002-2003","Details":"The NBA fined Bobby Jackson (Sac) $7,500 for criticizing the refs following Saturday's Sac-Uta game."},
{"Date":"5/13/2003","Season":"2002-2003","Details":"The NBA fined Raja Bell (Dal) $7,500 for verbally abusing the ref following his ejection during Sunday's Dal-Sac game."},
{"Date":"5/13/2003","Season":"2002-2003","Details":"The NBA fined Dirk Nowitzki (Dal) $5,000 for improper behavior when he kicked a pile of towels which scattered into the first few baseline seats during Sunday's Dal-Sac game."},
{"Date":"7/3/2003","Season":"2003-2004","Details":"The NBA suspended Glenn Robinson (Atl) for the 1st 3 games of the regular season for his conviction of domestic battery and assault against his ex-fiancee."},
{"Date":"7/7/2003","Season":"2003-2004","Details":"Portland fined Damon Stoudamire $250,000 and suspended him after he was arrested at an airport in Arizona for possession of a small amount of marijuana. It was the 3rd marijuana legal incident involving Stoudamire in the last year."},
{"Date":"10/16/2003","Season":"2003-2004","Details":"Houston indefinitely suspended Eddie Griffin after Griffin missed a practice. Griffin had previously missed the team flight to Sacramento on Monday."},
{"Date":"10/22/2003","Season":"2003-2004","Details":"The NBA suspended Jason Richardson (GS) for the first 3 games of the season for his conviction this summer of misdemeanor domestic violence."},
{"Date":"10/27/2003","Season":"2003-2004","Details":"Houston placed Eddie Griffin on the suspended list."},
{"Date":"11/2/2003","Season":"2003-2004","Details":"The NBA suspended Jason Terry (Atl) for 1 game for the elbow he threw at Anthony Johnson (Ind) during Saturday's Atl-Ind game."},
{"Date":"11/4/2003","Season":"2003-2004","Details":"The NBA suspended Gregg Popovich (SA) for 1 game for bumping a ref during Monday's SA-Mem game."},
{"Date":"11/4/2003","Season":"2003-2004","Details":"The NBA fined Kevin Garnett (Min) $5,000 for throwing a basketball into the the stands after his ejection during Monday's Min-Uta game."},
{"Date":"11/4/2003","Season":"2003-2004","Details":"Portland fined Bonzi Wells for flipping off a fan during Monday's Phi-Por game."},
{"Date":"11/7/2003","Season":"2003-2004","Details":"The NBA suspended Maurice Taylor for at least 10 games for violating the NBA's substance abuse policy. It is the 3rd drug related suspension for Taylor, with the 1st 2 suspensions being for marijuana use."},
{"Date":"11/15/2003","Season":"2003-2004","Details":"The NBA fined Jermaine O'Neal (Ind) $5,000 for criticizing the refs during Tuesday's Ind-Bos game."},
{"Date":"11/17/2003","Season":"2003-2004","Details":"The NBA reduced Maurice Taylor's suspension from 10 games to 6 games."},
{"Date":"11/18/2003","Season":"2003-2004","Details":"Portland suspended Bonzi Wells for 2 games and stripped him of his co-captain title. Wells cursed out coach Maurice Cheeks after being subbed out during the 3rd quarter of Monday's Por-Dal game."},
{"Date":"11/19/2003","Season":"2003-2004","Details":"Houston activated Maurice Taylor from the suspended list and released Alton Ford."},
{"Date":"11/24/2003","Season":"2003-2004","Details":"Cleveland suspended Ira Newble for 1 game for a profanity laced tirade he had with coach Paul Silas following Saturday's Cle-Atl game. Although not suspended, Cleveland told Ricky Davis and Michael Stewart to stay away from the team for 2 days and the 2 (though Stewart is on IR) did not travel with the team to New Orleans."},
{"Date":"11/28/2003","Season":"2003-2004","Details":"The NBA suspended Danny Fortson (Dal) for 3 games for his flagrant foul on Zarko Cabarkapa during Wednesday's Dal-Pho game."},
{"Date":"11/28/2003","Season":"2003-2004","Details":"Utah suspended Greg Ostertag for 1 game for violation of team rules."},
{"Date":"11/29/2003","Season":"2003-2004","Details":"The NBA fined Allen Iverson (Phi) $10,000 for flipping off the crowd during Tuesday's Mil-Phi game."},
{"Date":"12/1/2003","Season":"2003-2004","Details":"The NBA suspended Tim Duncan (SA) for 1 game for making contact with a ref during Saturday's SA-GS game."},
{"Date":"12/5/2003","Season":"2003-2004","Details":"The NBA suspended Karl Malone (LAL) for 1 game for throwing an elbow at Steve Nash (Dal) during Thursday's Dal-LAL game."},
{"Date":"12/5/2003","Season":"2003-2004","Details":"The NBA fined Jason Kidd (NJ) $10,000 for verbally abusing and publicly criticizing the refs following Monday's Mem-NJ game."},
{"Date":"12/6/2003","Season":"2003-2004","Details":"The NBA fined Don Nelson (Dal) $7,500 for criticizing the refs. Nelson questioned how the refs would treat Danny Fortson following Fortson's flagrant foul and said that the refs still treat Eduardo Najera different as a result of Najera's inadvertent bump of a ref last season."},
{"Date":"12/8/2003","Season":"2003-2004","Details":"Atlanta suspended Stephen Jackson for 1 game for conduct detrimental to the team."},
{"Date":"12/10/2003","Season":"2003-2004","Details":"The NBA fined Maurice Cheeks (Por) $7,500 verbally abusing officials and failing to leave the court in a timely manner after his ejection during Sunday's Por-Mem game."},
{"Date":"12/16/2003","Season":"2003-2004","Details":"The NBA fined Eddie Jordan (Was) $5,000 for criticizing the refs after Sunday's Was-NY game."},
{"Date":"12/24/2003","Season":"2003-2004","Details":"The NBA suspended Predrag Stojakovic (Sac) for 1 game for bumping a ref during Tuesday's Mem-Sac game."},
{"Date":"12/24/2003","Season":"2003-2004","Details":"The NBA fined Latrell Sprewell (Min) $25,000 for his on the court antics directed at the NY owners and NY bench during Tuesday's Min-NY game."},
{"Date":"1/5/2004","Season":"2003-2004","Details":"The NBA fined George Lynch (NO), Jamaal Magloire (NO), and Al Harrington (Ind) $10,000 each for their altercation during Saturday's NO-Ind game."},
{"Date":"1/5/2004","Season":"2003-2004","Details":"Miami suspended Loren Woods for 1 game for conduct detrimental to the team."},
{"Date":"1/6/2004","Season":"2003-2004","Details":"Boston suspended Vin Baker for 3 games for failure to comply with his alcohol treatment program."},
{"Date":"1/7/2004","Season":"2003-2004","Details":"The NBA suspended Kenyon Martin (NJ) and Corey Maggette (LAC) for 2 games each for their fight during Tuesday's NJ-LAC game."},
{"Date":"1/9/2004","Season":"2003-2004","Details":"The NBA fined Paul Pierce (Bos) $7,500 for throwing and kicking the ball into the stands during and after Wednesday's Bos-Orl game."},
{"Date":"1/13/2004","Season":"2003-2004","Details":"The NBA suspended Christian Laettner (Was) for 5 games for violating the league's drug policy."},
{"Date":"1/16/2004","Season":"2003-2004","Details":"The NBA fined Tim Grgurich (Pho assistant) $7,500 for verbally abusing a member of the media during a Pho-Sea game on December 23."},
{"Date":"1/16/2004","Season":"2003-2004","Details":"The NBA fined Ruben Patterson (Por) $5,000 for throwing the basketball into the stands near the end of Tueday's Por-LAC game."},
{"Date":"1/19/2004","Season":"2003-2004","Details":"The NBA suspended Greg Ostertag (Uta) and Zydrunas Ilgauskas (Cle) for 1 game for their fight in Saturday's Uta-Cle game."},
{"Date":"1/23/2004","Season":"2003-2004","Details":"Boston suspended indefinitely Vin Baker for failing to comply with his aftercare program."},
{"Date":"1/23/2004","Season":"2003-2004","Details":"The NBA fined Tim Floyd (NO) $5,000 for kicking the ball into the stands prior to his ejected from Wednesday's Min-NO game."},
{"Date":"1/30/2004","Season":"2003-2004","Details":"The NBA fined Utah $15,000 for a skit that ridiculed Karl Malone and Kobe Bryant during Saturday's LAL-Uta game."},
{"Date":"2/2/2004","Season":"2003-2004","Details":"The NBA suspended Shaquille O'Neal (LAL) for 1 game for a televised profanity laced tirade against the refs following Sunday's LAL-Tor game."},
{"Date":"2/2/2004","Season":"2003-2004","Details":"Houston suspended Steve Francis for 1 game for missing the team flight."},
{"Date":"2/4/2004","Season":"2003-2004","Details":"The NBA fined Scott Skiles (Chi) $7,500 for for comments criticizing the ref following Monday's Chi-Sea game."},
{"Date":"2/11/2004","Season":"2003-2004","Details":"The NBA suspended Kurt Thomas (NY) for 1 game for headbutting Josh Howard (Dal) during Tuesday's NY-Dal game."},
{"Date":"2/16/2004","Season":"2003-2004","Details":"The NBA suspended Zeljko Rebraca (Det) for 1 game for throwing a punch at Brad Miller during Wednesday's Detroit-Sacramento game."},
{"Date":"2/16/2004","Season":"2003-2004","Details":"The NBA fined Corliss Williamson (Det) $5,000 for his flagrant foul against Brad Miller during Wednesday's Detroit-Sacramento game."},
{"Date":"2/17/2004","Season":"2003-2004","Details":"The NBA suspended Chris Webber (Sac) for a total of 8 games. 3 games were for his guilty plea to perjury in July and 5 games were for violating the league's substance abuse policy."},
{"Date":"2/20/2004","Season":"2003-2004","Details":"The NBA fined Gary Payton (LAL) $15,000 and fined Speedy Claxton (GS) $7,500 for their scuffle during Wednesday's LAL-GS game."},
{"Date":"2/20/2004","Season":"2003-2004","Details":"The NBA fined Gary Payton (LAL) $25,000 for withdrawing from the Skills Competition for All-Star Saturday night."},
{"Date":"2/20/2004","Season":"2003-2004","Details":"The NBA fined Kobe Bryant (LAL) $20,000 for missing the All-Star team photo and media session."},
{"Date":"2/21/2004","Season":"2003-2004","Details":"Toronto suspended Lamond Murray for 1 game for conduct detrimental to the team. Murray had criticized the coach."},
{"Date":"2/22/2004","Season":"2003-2004","Details":"The NBA fined Tracy McGrady (Orl) $10,000 for punting the ball twice into the stands during Friday's Orl-Den game."},
{"Date":"2/22/2004","Season":"2003-2004","Details":"The NBA fined Eddie Jordan (Was coach) $7,500 for failing to leave the court in a timely manner following the end of Friday's Was-Ind game."},
{"Date":"2/23/2004","Season":"2003-2004","Details":"The NBA fined Cleveland $5,000 for a skit in which the mascot made fun of former Cav Ricky Davis (Bos)."},
{"Date":"2/23/2004","Season":"2003-2004","Details":"The NBA fined Detroit $200,000 for using ineligible players. Recently acquired players Rasheed Wallace and Mike James played in the 1st half of Friday's Det-Min game (they didn't play in the 2nd half as the league called during halftime and told Detroit to sit them). The trade had not at that time been formally approved (ie, all the paper work was not completed)."},
{"Date":"2/24/2004","Season":"2003-2004","Details":"The NBA fined Jerry Stackhouse (Was) $5,000 for throwing the basketball into the stands during Sunday's Was-Mil game."},
{"Date":"2/25/2004","Season":"2003-2004","Details":"The NBA fined Ray Allen (Sea) $10,000 for criticizing the refs following Saturday's Sea-GS game."},
{"Date":"2/27/2004","Season":"2003-2004","Details":"The National Basketball Referees Association reported that ref Michael Henderson has been suspended by the NBA for 3 games for his mistake near the end of Wednesday's Den-LAL game [the league does not publish fines and suspensions for refs]. Henderson had called a 24 second violation after Denver missed a shot, but the shot had hit the rim so it wasn't a violation. The refs huddled and overruled the call and it was changed to an inadvertent whistle with a jump ball to determine which team would get possession (also controversial as it appeared Denver had the rebound at the time of the blown whistle). Denver was up by 2 at the time and the Lakers then hit a 3-pointer with 3 seconds left in the game for the win. Many of the refs wore their jersey inside out with Henderson's #62 written on the back of the jersey during Friday's games in protest of the suspension."},
{"Date":"2/27/2004","Season":"2003-2004","Details":"The NBA fined Cuttino Mobley (Hou) $5,000 for criticizing the refs after Tuesday's Hou-SA game."},
{"Date":"3/1/2004","Season":"2003-2004","Details":"Philadelphia fined Allen Iverson for not attending Sunday's game. Iverson has not been playing due to an injured shoulder."},
{"Date":"3/3/2004","Season":"2003-2004","Details":"The NBA fined Larry Brown (Det) $7,500 for failing to leave the court in a timely manner following his ejection from Sunday's Det-LAC game."},
{"Date":"3/6/2004","Season":"2003-2004","Details":"The NBA fined Stan Van Gundy (Mia) $7,500 and assistant Bob McAdoo (Mia) $5,000 for verbally abusing the refs following the end of Tuesday's Mia-Tor game."},
{"Date":"3/7/2004","Season":"2003-2004","Details":"The NBA suspended Zach Randolph (Por) for 1 game for throwing a punch at Raja Bell during Saturday's Uta-Por game."},
{"Date":"3/11/2004","Season":"2003-2004","Details":"The NBA fined Phil Jackson (LAL) $50,000 for his comments about the refs following Monday's LAL-Uta game. The Lakers were also fined a matching $50,000."},
{"Date":"3/17/2004","Season":"2003-2004","Details":"The NBA fined Mark Cuban (Dal owner) $10,000 for "},
{"Date":"3/18/2004","Season":"2003-2004","Details":"The NBA fined Bonzi Wells (Mem) $5,000 for throwing the ball into the stands during Tuesday's Phi-Mem game."},
{"Date":"3/18/2004","Season":"2003-2004","Details":"The NBA fined Jamaal Magloire (NO) $5,000 for throwing the ball into the stands during Tuesday's NO-Mia game."},
{"Date":"3/19/2004","Season":"2003-2004","Details":"The NBA suspended Ron Artest (Ind) for 1 game for elbowing Derek Anderson (Por) during Wednesday's Ind-Por game."},
{"Date":"3/24/2004","Season":"2003-2004","Details":"The NBA fined Steve Francis (Hou) $25,000 for swearing during a halftime interview during ESPN's broadcast of Sunday's Hou-Sac game."},
{"Date":"3/29/2004","Season":"2003-2004","Details":"The NBA suspended Tyson Chandler (Chi) for 1 game for throwing a punch at Michael Bradley (Atl) during Saturday's Chi-Atl game."},
{"Date":"3/31/2004","Season":"2003-2004","Details":"The NBA fined Jon Barry (Den) $7,500 for yelling at the refs following Saturday's Den-Uta game."},
{"Date":"4/6/2004","Season":"2003-2004","Details":"The NBA fined Elton Brand (LAC) $5,000 for critizing the refs following Sunday's LAC-Uta game."},
{"Date":"4/7/2004","Season":"2003-2004","Details":"The NBA fined James Posey (Mem) $7,500 for kicking the ball into the stands during Monday's Mem-Uta game."},
{"Date":"4/8/2004","Season":"2003-2004","Details":"The NBA fined Tim Thomas (NY) $7,500 for criticizing the refs during Tuesday's Ind-NY game."},
{"Date":"5/3/2004","Season":"2003-2004","Details":"The NBA fined Dallas $25,000 for showing a cartoon that made fun of several Sacramento players prior to the Sal-Dal game on March 24."},
{"Date":"5/11/2004","Season":"2003-2004","Details":"The NBA fined Larry Brown (Det) $7,500 for criticizing the refs on Monday."},
{"Date":"5/16/2004","Season":"2003-2004","Details":"The NBA fined Brad Miller (Sac) $10,000 for flipping off the fans following his ejection from Friday's Sac-Min game."},
{"Date":"5/17/2004","Season":"2003-2004","Details":"The NBA suspended Anthony Peeler (Sac) for 2 games for throwing an elbow that hit Kevin Garnett (Min) in the chin and throwing an elbow that hit Garnett in the midsection during Sunday's Min-Sac game. If Sacramento does not advance to the Conference Finals, then the 2nd game suspension will be served the first game of the 04-05 regular season. Garnett was fined $7,500 for an elbow thrown to Peeler's chest, which occurred after Peeler's first elbow and immediately before the one to the face."},
{"Date":"5/24/2004","Season":"2003-2004","Details":"The NBA fined Karl Malone (LAL) $7,500 for his flagrant foul against Darrick Martin during Sunday's LAL-Min game."},
{"Date":"5/25/2004","Season":"2003-2004","Details":"The NBA fined Ron Artest (Ind) $10,000 for making an obscene gesture during Monday's Det-Ind game."},
{"Date":"5/27/2004","Season":"2003-2004","Details":"The NBA fined Reggie Miller (Ind) $5,000 for kicking the ball into the stands after Tuesday's Ind-Det game."},
{"Date":"6/6/2004","Season":"2003-2004","Details":"The NBA fined Gary Payton (LAL) $5,000 for skipping Sunday's mandatory media availability session."},
{"Date":"8/27/2004","Season":"2004-2005","Details":"The NBA suspended Gilbert Arenas (Was) for 1 game. He will miss the first game of the regular season. Arenas recently pleaded no contest to misdemeanor weapons and vehicle charges for possessing a concealed weapon and driving without a license in 2003."},
{"Date":"10/9/2004","Season":"2004-2005","Details":"The NBA fined Mark Cuban (Dal owner) $100,000 for his comments criticizing the rules limiting the training camp practices to just one scrimmage per day, maximum of 3 hours per day, and 2-a-days to just 5 days."},
{"Date":"10/12/2004","Season":"2004-2005","Details":"Portland suspended Qyntel Woods without pay pending a team investigation for Woods allegedly being involved in illegal dog fighting."},
{"Date":"10/20/2004","Season":"2004-2005","Details":"The NBA suspended Eddie Griffin (Min) for the first 3 games of the season for his guilty plea this summer of a misdemeanor assault charge."},
{"Date":"10/26/2004","Season":"2004-2005","Details":"The NBA suspended Lorenzen Wright (Mem) for 1 game for shoving Zaza Pachulia (Mil) during Thursday Mem-Mil game. Wright will serve the suspension the first game of the season."},
{"Date":"10/27/2004","Season":"2004-2005","Details":"The NBA suspended Brendan Haywood (Was) for 3 games, Antonio Davis (Chi) for 2 games, Eddy Curry (Chi) for 2 games, and Larry Hughes (Was) for 1 games and fined Kirk Hinrich (Chi) $10,000 for their involvement in the melee during Monday's Chi-Was game. The suspensions will start with the beginning of the regular season."},
{"Date":"10/27/2004","Season":"2004-2005","Details":"The NBA fined Paul Pierce (Bos) $15,000 for spitting in the direction of the Cleveland bench during Monday's Bos-Cle game."},
{"Date":"10/29/2004","Season":"2004-2005","Details":"The NBA suspended Qyntel Woods for 5 games for violating the league's anti-drug policy."},
{"Date":"11/7/2004","Season":"2004-2005","Details":"Portland fined Zach Randolph for missing the team flight to Toronto on Saturday."},
{"Date":"11/9/2004","Season":"2004-2005","Details":"The NBA suspended Marcus Fizer for 1 game for his guilty plea on a gun possession charge in August."},
{"Date":"11/14/2004","Season":"2004-2005","Details":"The NBA suspended Danny Fortson (Sea) for 1 game for throwing an elbow at the head of Chris Bosh (Tor) during Friday's Sea-Tor game. He was also assessed a flagrant foul for the thrown elbow."},
{"Date":"11/14/2004","Season":"2004-2005","Details":"The NBA fined Elton Brand (LAC) $7,500 for his foul on Tim Thomas (NY) during Friday's LAC-NY game. The foul was also upgraded to a flagrant foul."},
{"Date":"11/20/2004","Season":"2004-2005","Details":"The NBA suspended Ron Artest (Ind), Stephen Jackson (Ind), Jermaine O'Neal (Ind), and Ben Wallace (Det) indefinitely for their role in Friday's Ind-Det brawl while the league continues their investigation."},
{"Date":"11/21/2004","Season":"2004-2005","Details":"The NBA came down hard with the suspensions for Friday's Ind-Det brawl that involved players going into the stands and punches being exchanged between players and fans. Ron Artest (Ind) was suspended for the rest of the season (72 games). Stephen Jackson (Ind) was suspended for 30 games. Jermaine O'Neal (Ind) was suspended for 25 games. Those total suspensions are upped by 1 game as they do not include Saturday's Ind-Orl game. The Players Association has already stated that they will appeal those 3 suspensions and an arbitrator may eventually reduce the length of those suspensions. All 3 threw punches at fans and Artest and Jackson went into the stands. Anthony Johnson (Ind) was suspended 6 games - he was the player in street clothes who punched a fan on the court right after Artest and the fan had a confrontation. His suspension will not start until he is physically able to play. Ben Wallace (Det) was suspended for 6 games for his two handed shove to Artest's face during the game and for throwing a towel at Artest after the players had been separated. Elden Campbell (Det), Chauncey Billups (Det), Derrick Coleman (Det), and Reggie Miller (Ind) were suspended for 1 game for leaving the bench during the on court altercation between Wallace and Artest. Artest, Jackson, and O'Neal will be listed on a suspended list so Indiana will be able to sign players for their spots while the players are suspended (and, thus, exceed the 15 player roster maximum). Commissioner David Stern: "},
{"Date":"11/25/2004","Season":"2004-2005","Details":"Minnesota suspended Michael Olowokandi for 1 game for his early morning arrest for refusing to leave a bar after closing time."},
{"Date":"11/26/2004","Season":"2004-2005","Details":"Minnesota suspended Michael Olowokandi for a 2nd game for his Thursday morning arrest for refusing to leave a bar after closing time."},
{"Date":"11/30/2004","Season":"2004-2005","Details":"The NBA fined Jamaal Magloire (NO) $7,500 for throwing the ball at Mike Dunleavy (GS) during the NO-GS game on Nov. 23."},
{"Date":"12/6/2004","Season":"2004-2005","Details":"The NBA suspended Tony Battie (Orl) for 1 game for elbowing Pau Gasol (Mem) during Saturday's Orl-Mem game."},
{"Date":"12/7/2004","Season":"2004-2005","Details":"The NBA suspended Elton Brand (LAC) for 1 game for shoving Emeka Okafor (Cha) during Monday's LAC-Cha game."},
{"Date":"12/7/2004","Season":"2004-2005","Details":"The NBA suspended Latrell Sprewell (Min) for 1 game for yelling a sexual vulgarity at a female fan during Saturday's Min-LAC game."},
{"Date":"12/9/2004","Season":"2004-2005","Details":"The NBA suspended Rodney White (Den) for 1 game for his guilty plea of unlawful possession of a weapon."},
{"Date":"12/9/2004","Season":"2004-2005","Details":"Washington suspended Kwame Brown for refusing to join the team huddle during Wednesday's Den-Was game."},
{"Date":"12/13/2004","Season":"2004-2005","Details":"The NBA fined Maurice Cheeks (Por) $7,500 for failing to leave the court in a timely manner following Sunday's Por-Uta game."},
{"Date":"12/18/2004","Season":"2004-2005","Details":"Cleveland suspended Eric Snow for 1 game for his confrontation with coach Paul Silas during Thursday's Det-Cle game."},
{"Date":"12/23/2004","Season":"2004-2005","Details":"The NBA fined Larry Brown (Det) $15,000 for verbally abusing a ref following Wednesday's Chi-Det game."},
{"Date":"12/23/2004","Season":"2004-2005","Details":"The NBA suspended Caron Butler (LAL) for 1 game for punching Dan Dickau (NO) in the stomach during Wednesday's NO-LAL game."},
{"Date":"12/25/2004","Season":"2004-2005","Details":"Indiana activated Jermaine O'Neal from the suspended list and released Marcus Haislip."},
{"Date":"12/29/2004","Season":"2004-2005","Details":"New Orleans suspended Jim Jackson indefinitely for failing to report to the team following his trade from Houston."},
{"Date":"12/30/2004","Season":"2004-2005","Details":"A federal judge ruled in favor of an arbitrator's reduction of Jermaine O'Neal's (Ind) suspension from 25 games to 15 games."},
{"Date":"1/14/2005","Season":"2004-2005","Details":"The NBA fined Carlos Boozer (Uta) $5,000 for his flagrant foul during Thursday's Uta-Sac game and upgraded it to a level 2 flagrant."},
{"Date":"1/15/2005","Season":"2004-2005","Details":"The NBA suspended Nene (Den) and Michael Olowokandi (Min) for 4 games for their fight during Friday's Den-Min game. Marcus Camby (Den) and Francisco Elson (Den) were also suspended for 1 game for leaving the bench during the altercation."},
{"Date":"1/16/2005","Season":"2004-2005","Details":"The NBA fined Rafer Alston (Tor) $7,500 for verbally abusing a ref during Friday's Phi-Tor game."},
{"Date":"1/19/2005","Season":"2004-2005","Details":"The NBA fined Marc Jackson (Phi) $5,000 for directing an obscenity at a fan during Monday's NO-Phi game."},
{"Date":"1/26/2005","Season":"2004-2005","Details":"Indiana activated Stephen Jackson from the suspended list."},
{"Date":"1/28/2005","Season":"2004-2005","Details":"Portland suspended Darius Miles for 2 games for conduct detrimental to the team and insubordination."},
{"Date":"1/29/2005","Season":"2004-2005","Details":"The NBA fined Larry Brown (Det) $35,000 for criticizing the refs following Monday's Min-Det game."},
{"Date":"1/30/2005","Season":"2004-2005","Details":"Toronto suspended Rafer Alston for 2 games for his conduct during practice on Saturday."},
{"Date":"2/1/2005","Season":"2004-2005","Details":"The NBA suspended Clifford Robinson (GS) for 5 games for violating the league's anti-drug policy."},
{"Date":"2/3/2005","Season":"2004-2005","Details":"The NBA suspended Stephen Jackson (Ind) for 1 game for verbally abusing the refs at the end of Wednesday's Tor-Ind game."},
{"Date":"2/10/2005","Season":"2004-2005","Details":"The NBA suspended Brad Miller (Sac) for 1 game for berating the refs and throwing his headband and wristbands into the stands following Tuesday's Sac-Pho game. Mike Bibby (Sac) was fined $15,000 for berating the refs and failing to leave the court in a timely manner after the game. Cuttino Mobley (Sac) was fined $15,000 for comments he made about the refs following the game. Chris Webber (Sac) was fined $10,000 for kicking the ball into the stands after the game ended. [Amare Stoudemire (Pho) blocked a shot by Miller as time expired that would have tied the game and it looked like it might have been goaltending, but no call was made.]"},
{"Date":"2/10/2005","Season":"2004-2005","Details":"The NBA fined Kendrick Perkins (Bos) $10,000 for his flagrant foul against Desmond Mason (Mil) during Tuesday's Bos-Mil game."},
{"Date":"2/11/2005","Season":"2004-2005","Details":"The NBA suspended Danny Fortson (Sea) for 2 games for yelling at a ref, throwing a chair, and failing to leave the court in a timely manner following his ejection from Thursday's Sea-Sac game."},
{"Date":"2/15/2005","Season":"2004-2005","Details":"The NBA fined Cuttino Mobley (Sac) $10,000 for abuse of the refs and failing to leave the court in a timely manner following the end of Friday's Dal-Sac game."},
{"Date":"3/1/2005","Season":"2004-2005","Details":"The NBA fined Gilbert Arenas $7,500 for criticizing the refs following Sunday's Was-Sac game."},
{"Date":"3/2/2005","Season":"2004-2005","Details":"The NBA fined Tyson Chandler (Chi) $10,000 for directing an obscene gesture towards a ref during Monday's Hou-Chi game."},
{"Date":"3/2/2005","Season":"2004-2005","Details":"The NBA suspended Tyronn Lue (Atl) for 1 game for throwing a punch at Eduardo Najera (Den) during Tuesday's Atl-Den game."},
{"Date":"3/15/2005","Season":"2004-2005","Details":"The NBA suspended Stacey Augmon (Orl) for 1 game for cursing and throwing a bottle of lotion at a reporter after Sunday's Orl-NJ game."},
{"Date":"3/15/2005","Season":"2004-2005","Details":"The NBA fined DeShawn Stevenson (Orl) $7,500 for kicking the ball into the stands during Sunday's Orl-NJ game."},
{"Date":"3/17/2005","Season":"2004-2005","Details":"Cleveland fined coach Paul Silas $10,000 for derogatory comments he made about Carlos Boozer (Uta)."},
{"Date":"3/19/2005","Season":"2004-2005","Details":"The NBA suspended indefinitely Steve Francis (Orl) for kicking a courtside photographer during Friday's Orl-Sea game."},
{"Date":"3/21/2005","Season":"2004-2005","Details":"The NBA suspended Steve Francis (Orl) for 2 more games, for a total of 3 games, for kicking a photographer during Friday's Orl-Sea game."},
{"Date":"3/22/2005","Season":"2004-2005","Details":"The NBA fined Allen Iverson (Phi) $10,000 for his verbal confrontation with a ref following Saturday's Phi-Chi game."},
{"Date":"3/27/2005","Season":"2004-2005","Details":"Seattle suspended Danny Fortson for 1 game for refusing to enter the game during Friday's Sea-NY game."},
{"Date":"4/9/2005","Season":"2004-2005","Details":"The NBA suspended Corliss Williamson (Sac) for 1 game for hitting Joel Przybilla (Por) in the head during Friday's Por-Sac game."},
{"Date":"4/11/2005","Season":"2004-2005","Details":"The NBA suspended Jerry Stackhouse (Dal) and Kirk Snyder (Uta) for 1 game for their postgame fight following Saturday's Dal-Uta game."},
{"Date":"4/12/2005","Season":"2004-2005","Details":"The NBA suspended Andres Nocioni (Chi) for elbowing Tayshaun Prince (Det) during Monday's Chi-Det game."},
{"Date":"4/12/2005","Season":"2004-2005","Details":"The NBA fined Kenyon Martin (Den) $7,500 for verbally abusing the refs and failing to leave the court in a timely manner following his ejection during Monday's Den-GS game."},
{"Date":"4/18/2005","Season":"2004-2005","Details":"The NBA suspended Vlade Divac (LAL) for 2 games for his intentionally thrown elbow that connected with Shawn Bradley's (Dal) chin during Sunday's Dal-LAL game."},
{"Date":"4/18/2005","Season":"2004-2005","Details":"The NBA suspended Anthony Johnson (Ind) for 1 game for throwing a punch at Alonzo Mourning (Mia) during Sunday's Ind-Mia game."},
{"Date":"4/25/2005","Season":"2004-2005","Details":"The NBA fined Cuttino Mobley (Sac) $15,000 for making an obscene gesture towards fans at the end of Saturday's Sea-Sac game."},
{"Date":"4/25/2005","Season":"2004-2005","Details":"The NBA fined Avery Johnson (Dal) $10,000 for failing to leave the court in a timely manner following Saturday's Dal-Hou game."},
{"Date":"4/29/2005","Season":"2004-2005","Details":"The NBA suspended Antoine Walker (Bos) for 1 game for contact with a ref following his scuffle with Jermaine O'Neal (Ind) during Thursday's Bos-Ind game. O'Neal was fined $10,000 for his role in the scuffle."},
{"Date":"5/2/2005","Season":"2004-2005","Details":"The NBA fined Jeff Van Gundy (Hou) $100,000 for comments he made to the press stating that he believed that the officiating was targeting Yao Ming. It is a record fine handed to an NBA coach, doubling the old record."},
{"Date":"5/2/2005","Season":"2004-2005","Details":"The NBA fined Carmelo Anthony (Den) $7,500 for his flagrant foul on Manu Ginobili (SA) during Saturday's Den-SA game."},
{"Date":"5/3/2005","Season":"2004-2005","Details":"Washington suspended Kwame Brown for the rest of the playoffs."},
{"Date":"5/4/2005","Season":"2004-2005","Details":"The NBA fined Jason Williams (Mem) $10,000 for improper conduct towards the media after Sunday's Mem-Pho game. Williams repeated took the pen from a writer during the post-game interviews."},
{"Date":"6/3/2005","Season":"2004-2005","Details":"The NBA fined Denver $200,000 and suspended head coach George Karl for the first 3 games of 2005-06 for violating the rules prohibiting contact between NBA teams and players not yet eligible for the NBA draft. Karl attended workouts at Marquette University that included his son, Coby."},
{"Date":"6/3/2005","Season":"2004-2005","Details":"The NBA fined Rasheed Wallace (Det) $20,000 for public criticism of the refs after Tuesday's Det-Mia game and using inappropriate language when speaking to the media."},
{"Date":"8/30/2005","Season":"2005-2006","Details":"The NBA fined Minnesota $200,000 for holding a voluntary 2 day mini-camp last week."},
{"Date":"10/25/2005","Season":"2005-2006","Details":"The NBA reduced George Karl's 3 game suspension to 2 games, thus he will miss the first 2 games of the regular season. The suspension occured as a result of Karl attending workouts at Marquette University in May that included his son - the league has rules against contact between NBA teams and players not yet eligible for the NBA draft."},
{"Date":"10/27/2005","Season":"2005-2006","Details":"The NBA suspended Robert Whaley (Uta) for 2 games for throwing a punch at Adam Prada (LAL) during Tuesday's Uta-LAL games."},
{"Date":"11/11/2005","Season":"2005-2006","Details":"The NBA fined Mike Montgomery (GS) $25,000 and Jason Richardson (GS) $20,000 for failing to leave the court in a timely manner and verbally abusing the refs following Wednesday's GS-Chi game. 11/9/05"},
{"Date":"11/14/2005","Season":"2005-2006","Details":"The NBA fined Sacramento $30,000 for showing a derogatory video of Detroit on the jumbotron while the Pistons were introduced during the November 8 Det-Sac game."},
{"Date":"11/30/2005","Season":"2005-2006","Details":"The NBA suspended George Karl (Den) for 2 games for criticizing the refs following Monday's Den-NJ game."},
{"Date":"12/1/2005","Season":"2005-2006","Details":"Denver suspended Voshon Lenard for 1 game for conduct detrimental to the team."},
{"Date":"12/4/2005","Season":"2005-2006","Details":"The NBA fined Doc Rivers (Bos) $10,000 for failing to leave the court in a timely manner following his ejection from Friday's Bos-Chi game."},
{"Date":"12/6/2005","Season":"2005-2006","Details":"The NBA has fined 13 players $10,000 for wearing their shorts too long. The league has a rule requiring shorts to be at least 1 inch above the knee. The fined players are Nate Robinson (NY), Stephon Marbury (NY), John Salmons (Phi), Kyle Korver (Phi), Allen Iverson (Phi), Kevin Ollie (Phi), Jermaine O'Neal (Ind), Stephen Jackson (Ind), Jamaal Tinsley (Ind), Jeff McInnis (NJ), Voshon Lenard (Den), DerMarr Johnson (Den), and Andre Miller (Den). The Players Association is appealing the fines. In addition, the player's team was fined $50,000 for each violation."},
{"Date":"12/6/2005","Season":"2005-2006","Details":"The NBA suspended Josh Smith (Atl) for 2 games for elbowing Raja Bell (Pho) during Sunday's Atl-Pho game."},
{"Date":"12/6/2005","Season":"2005-2006","Details":"The NBA fined Carmelo Anthony (Den) $5,000 for tossing a ball into the stands during Saturday's Mia-Den game."},
{"Date":"12/10/2005","Season":"2005-2006","Details":"The NBA suspended Danny Fortson (Sea) for 1 game for verbally abusing the refs and failing to leave the court in a timely manner following his ejection during Friday's Sea-Uta game"},
{"Date":"12/12/2005","Season":"2005-2006","Details":"The NBA fined Houston $100,000 for taking the team to Las Vegas during last week's road trip."},
{"Date":"12/15/2005","Season":"2005-2006","Details":"The NBA fined Phil Jackson (LAL) $25,000 for violating the league's anti-tampering rule for Jackson's comments about the Lakers' future interest in Chris Bosh (Tor)."},
{"Date":"12/15/2005","Season":"2005-2006","Details":"The NBA fined Ron Artest (Ind) $10,000 for making public statements detrimental to the NBA for his public statement that he wanted to be traded."},
{"Date":"12/18/2005","Season":"2005-2006","Details":"Dallas fined Darrell Armstrong (a long time Washington fan) $1,000 for his comment of "},
{"Date":"12/19/2005","Season":"2005-2006","Details":"Utah fined Deron Williams and Robert Whaley an undisclosed amount for lying to the team regarding their involvement in an altercation in which they gave the police a false name. Whaley was also suspended for 1 game for lying to the team about how he suffered a cut on his right hand that required 6 stitches."},
{"Date":"12/26/2005","Season":"2005-2006","Details":"The NBA fined Stephen Jackson (Ind) $20,000 for making an obscene gesture after he was ejected during Friday's Cle-Ind game. Jackson denies making the gesture and plans on appealing the fine."},
{"Date":"12/26/2005","Season":"2005-2006","Details":"The NBA fined Nate McMillan (Por) $15,000 for verbally abusing the refs and failing to leave the court in a timely manner following Friday's Min-Por game."},
{"Date":"12/29/2005","Season":"2005-2006","Details":"The NBA suspended Danny Fortson (Sea) for 2 games for berating a ref and failing to leave the court in a timely manner following his ejected during Wednesday's Sea-Min game."},
{"Date":"12/30/2005","Season":"2005-2006","Details":"The NBA suspended Kobe Bryant (LAL) for 2 games for his flagrant elbow to Mike Miller (Mem) in the throat during Wednesday's Mem-LAL game. Bryant also commented after the game that he planned on fouling hard the next player who came down the lane when he fouled Miller."},
{"Date":"1/2/2006","Season":"2005-2006","Details":"New York activated Jackie Butler and placed Jerome James on IL. James was suspended indefinitely for conduct detrimental to the team as the Knicks said he was unprepared to practice on Sunday."},
{"Date":"1/7/2006","Season":"2005-2006","Details":"The NBA suspended Juwan Howard (Hou) for 1 game for shoving the ball into the face of Mike James (Tor) during Friday's Hou-Tor game."},
{"Date":"1/11/2006","Season":"2005-2006","Details":"The NBA suspended Carlos Arroyo (Det) for bumping a ref during Tuesday's Det-NO game."},
{"Date":"1/12/2006","Season":"2005-2006","Details":"Orlando suspended Steve Francis indefinitely for conduct detrimental to the team. Francis refused to re-enter Wednesday's Orl-Sea game during the 4th quarter. Francis ended up being suspended for 2 games."},
{"Date":"1/13/2006","Season":"2005-2006","Details":"The NBA suspended Keyon Dooling (Orl) for 5 games and Ray Allen (Sea) for 3 games for their fight in Wednesday's Orl-Sea game. Dooling got the longer suspension as he initiated the fight and also attempted to confront Allen in the hallway after leaving the court (security was able to keep Dooling from reaching Allen, though words were exchanged)."},
{"Date":"1/19/2006","Season":"2005-2006","Details":"The NBA suspended Antonio Davis (NY) for 5 games for going into the stands during Wednesday's NY-Chi game. Davis thought his wife was in danger and returned to the court (and was then ejected) without incident."},
{"Date":"1/19/2006","Season":"2005-2006","Details":"The NBA suspended Baron Davis (GS) for 1 game for hitting Luke Ridnour (Sea) in the chest during Monday's GS-Sea game."},
{"Date":"1/19/2006","Season":"2005-2006","Details":"The NBA fined John Paxson (Chi GM) $15,000 for verbally abusing the refs following Monday's Chi-Den game."},
{"Date":"1/26/2006","Season":"2005-2006","Details":"Utah suspended indefinitely Greg Ostertag for his conduct after Thursday's Uta-Sea game. Ostertag reportedly got in a verbal argument with coach Jerry Sloan. Ostertag's suspension ended up being for 1 game."},
{"Date":"1/27/2006","Season":"2005-2006","Details":"The NBA dismissed Chris Andersen (NO) from the league for violating the league's substance abuse program. As he had not been suspended previously for performance enhancing drugs (ie, steroids), he was mostly likely tossed for a positive test for "},
{"Date":"2/2/2006","Season":"2005-2006","Details":"The NBA fined Larry Brown (NY) $20,000 for failing to leave the court in a timely manner following his ejection during Tuesday's NY-LAL game."},
{"Date":"2/13/2006","Season":"2005-2006","Details":"The NBA fined Kenyon Martin (Den) $15,000 for using inappropriate language with fans following Wednesday's Chi-Den game."},
{"Date":"2/24/2006","Season":"2005-2006","Details":"The NBA suspended Sebastian Telfair (Por) for 2 games for violating the league's anti-gun rules. Telfair had accidentally carried a gun on to a team flight during a recent road trip."},
{"Date":"2/24/2006","Season":"2005-2006","Details":"The NBA suspended David Harrison (Ind) for 1 game for directing obscenities at fans during Thursday's Ind-Det game."},
{"Date":"2/24/2006","Season":"2005-2006","Details":"Atlanta suspended Salim Stoudamire for 2 games for conduct detrimental to the team."},
{"Date":"2/27/2006","Season":"2005-2006","Details":"The NBA fined Kevin Garnett (Min) $5,000 for throwing the ball into the stands during Sunday's Min-Mem game."},
{"Date":"2/27/2006","Season":"2005-2006","Details":"The NBA fined Ricky Davis (Min) $5,000 for kicking the ball into the stands during Friday's Den-Min game."},
{"Date":"2/27/2006","Season":"2005-2006","Details":"The NBA fined Rasheed Wallace (Det) $5,000 for throwing an elbow at Zydrunas Ilgauskas during Monday's Det-Cle game."},
{"Date":"3/3/2006","Season":"2005-2006","Details":"The NBA suspended Robert Horry (SA) for 2 games for his altercation with Jerry Stackhouse and for making contact with a ref during Thursday's Dal-SA game."},
{"Date":"3/3/2006","Season":"2005-2006","Details":"The NBA fined Jerry Stackhouse (Dal) $30,000 for his comments about a ref following Thursday's Dal-SA game."},
{"Date":"3/8/2006","Season":"2005-2006","Details":"The NBA fined Brian Hill (Orl) $25,000 for criticizing the refs following Monday's Uta-Orl game."},
{"Date":"3/17/2006","Season":"2005-2006","Details":"The NBA fined Mike Woodson (Atl) $20,000 and Josh Smith (Atl) $15,000 for comments they made regarding the refs following Monday's Atl-Mil game."},
{"Date":"3/19/2006","Season":"2005-2006","Details":"The NBA fined Richard Hamilton (Det) $5,000 for throwing the ball into the stands during Friday's NY-Det game."},
{"Date":"3/27/2006","Season":"2005-2006","Details":"The NBA fined Bonzi Wells (Sac) $5,000 for punching the ball into the tunnel during Sunday's Sac-GS game."},
{"Date":"3/28/2006","Season":"2005-2006","Details":"The NBA fined Bruce Bowen (SA) $10,000 for kicking Ray Allen (Sea) in the back during Sunday's SA-Sea game."},
{"Date":"3/28/2006","Season":"2005-2006","Details":"The NBA fined Udonis Haslem (Mia) $5,000 for removing his jersey before he left the court after his ejection in Monday's Mia-Ind game."},
{"Date":"3/29/2006","Season":"2005-2006","Details":"Boston suspended Orien Greene indefinitely for conduct detrimental to the team following his arrest for speeding over 90 mph on a city street."},
{"Date":"3/31/2006","Season":"2005-2006","Details":"The NBA suspended DJ Mbenga (Dal) for 1 game for his flagrant foul on LeBron James (Cle) during Wednesday's Dal-Cle game."},
{"Date":"4/5/2006","Season":"2005-2006","Details":"The NBA fined Carmelo Anthony (Den) $15,000 for throwing the ball into the stands during Tuesday's Den-LAC game."},
{"Date":"4/6/2006","Season":"2005-2006","Details":"The NBA suspended Rashard Lewis (Sea) for 1 game for his recent guilty plea for reckless driving."},
{"Date":"4/7/2006","Season":"2005-2006","Details":"The NBA fined Shaquille O'Neal (Mia) $15,000 for criticizing the refs and Stu Jackson, who is in charge of the officials, following Sunday's NJ-Mia game."},
{"Date":"4/11/2006","Season":"2005-2006","Details":"The NBA fined Richard Jefferson (NJ) $5,000 for kicking the ball into the standings during Sunday's NJ-Mil games."},
{"Date":"4/14/2006","Season":"2005-2006","Details":"The NBA suspended Josh Childress (Atl) for 2 games for throwing a forearm at Andres Nocioni (Chi) and fined Nocioni $5,000 and assessed him a flagrant foul level 2 for making unnecessary and excessive contact with Childress during Wednesday's Atl-Chi game."},
{"Date":"4/14/2006","Season":"2005-2006","Details":"The NBA fined Erick Dampier (Dal) $5,000 and upgraded his flagrant foul level 1 to a level 2 for his foul on Shawn Marion (Pho) during Thursday's Dal-Pho game."},
{"Date":"4/17/2006","Season":"2005-2006","Details":"Portland suspended Zach Randolph for 1 game for leaving the arena during a game."},
{"Date":"4/24/2006","Season":"2005-2006","Details":"The NBA suspended Ron Artest (Sac) for 1 game for throwing an elbow at Manu Ginobili (SA) during Saturday's Sac-SA game."},
{"Date":"4/24/2006","Season":"2005-2006","Details":"The NBA suspended Udonis Haslem (Mia) for 1 game for throwing his mouth piece towards a ref during Saturday's Chi-Mia game."},
{"Date":"4/25/2006","Season":"2005-2006","Details":"Denver suspended Kenyon Martin indefinitely for refusing to enter the game in the 2nd half of Monday's Den-LAC game."},
{"Date":"4/27/2006","Season":"2005-2006","Details":"The NBA fined Jermaine O'Neal (Ind) $15,000 for publicly criticizing the refs following Tuesday's Ind-NJ game."},
{"Date":"4/29/2006","Season":"2005-2006","Details":"The NBA fined Shaquille O'Neal (Mia) $25,000 for criticizing the refs after Thursday's Mia-Chi game."},
{"Date":"5/1/2006","Season":"2005-2006","Details":"The NBA fined Reggie Evans (Den) $10,000 and assessed him a flagrant foul level 2 for grabbing Chris Kaman (LAC) below the belt during Saturday's Den-LAC game. Kaman was assessed a flagrant for shoving Evans after the incident, but that has been downgraded to a technical."},
{"Date":"5/1/2006","Season":"2005-2006","Details":"The NBA fined Richard Hamilton (Det) $15,000 for his flagrant foul on Michael Redd (Mil) during Saturday's Det-Mil game."},
{"Date":"5/3/2006","Season":"2005-2006","Details":"The NBA suspended Raja Bell (Pho) for 1 game for throwing Kobe Bryant (LAL) to the ground during Tuesday's Pho-LAL game."},
{"Date":"5/3/2006","Season":"2005-2006","Details":"The NBA fined Dirk Nowitzki (Dal) $15,000 and assessed him a flagrant foul level 2 for throwing an elbow at the chest of Pau Gasol (Mem) during Monday's Dal-Mem game."},
{"Date":"5/10/2006","Season":"2005-2006","Details":"The NBA fined Mark Cuban (Dal owner) $100,000 for going on the court during Sunday's SA-Dal game to complain about a non-call and $100,000 for criticizing on his blog how the league selects the playoffs refs."},
{"Date":"5/12/2006","Season":"2005-2006","Details":"The NBA suspended Clifford Robinson (NJ) for 5 games for violating the league's substance abuse policy [most likely marijuana]."},
{"Date":"5/18/2006","Season":"2005-2006","Details":"The NBA suspended Jason Terry (Dal) for 1 game for throwing a punch at Michael Finley (SA) during Wednesday's Dal-SA game."},
{"Date":"5/24/2006","Season":"2005-2006","Details":"The NBA fined Eddie Jordan (Was) $25,000 for criticizing the refs following Cle-Was game 3 on April 28 (the fine was not previously announced by the league)."},
{"Date":"6/11/2006","Season":"2005-2006","Details":"The NBA fined Shaquille O'Neal (Mia) $10,000 and Miami $25,000 for O'Neal failing to make himself available to the media following Sunday's Dal-Mia game."},
{"Date":"10/13/2006","Season":"2006-2007","Details":"The NBA suspended Lorenzen Wright (Atl) and Kimani Ffriend (Mem) for 1 game for throwing punches in Wednesday's Atl-Mem game. Wright will serve the suspension in the first regular season game. Ffriend, released by Memphis, will serve the suspension in his next regular season game with an NBA team."},
{"Date":"10/27/2006","Season":"2006-2007","Details":"The NBA suspended Danny Fortson (Sea) for 1 game for his flagrant foul on Ron Artest (Sac) during Wednesday's Sea-Sac game."},
{"Date":"11/4/2006","Season":"2006-2007","Details":"The NBA fined Robert Sarver (Pho owner) $25,000 for excessive complaining about the officiating during Wednesday's Pho-LAC game."},
{"Date":"11/4/2006","Season":"2006-2007","Details":"The NBA fined Josh Howard (Dal) $5,000 and upgraded his flagrant foul to a level 2 for his flagrant foul on Bruce Bowen (SA) during Thursday's Dal-SA game."},
{"Date":"11/10/2006","Season":"2006-2007","Details":"The NBA suspended John-Blair Bickerstaff (Cha assistant) for 2 games for his DWI conviction."},
{"Date":"11/14/2006","Season":"2006-2007","Details":"The NBA fined Brevin Knight (Cha) $10,000 for failing to leave the court in a timely manner after his ejection during Friday's Cha-Sea game."},
{"Date":"11/17/2006","Season":"2006-2007","Details":"The NBA fined Jeff Van Gundy (Hou coach) $25,000 for publicly criticizing the refs. His complaints about the refs' treatment of Yao Ming during Sunday's Hou-Mia game appeared in a Houston Chronicle article on Wednesday."},
{"Date":"11/27/2006","Season":"2006-2007","Details":"The NBA fined Bobby Jackson (Mem) $20,000 for verbal abuse and failing to leave the court in a timely manner following his ejection during Saturday's Mem-Dal game."},
{"Date":"11/29/2006","Season":"2006-2007","Details":"The NBA fined Phil Jackson (LAL) $25,000 for criticizing the refs following Friday's LAL-Uta game."},
{"Date":"12/6/2006","Season":"2006-2007","Details":"The NBA suspended Maurice Taylor (Sac) for 5 games for violating the league anti-drug program."},
{"Date":"12/6/2006","Season":"2006-2007","Details":"The NBA suspended Zaza Pachulia (Atl) for 1 game for elbowing Johan Petro (Sea) during Tuesday's Atl-Sea game."},
{"Date":"12/9/2006","Season":"2006-2007","Details":"Portland suspended Zach Randolph for making an obscene gesture toward the fans at the end of Friday's Por-Ind game."},
{"Date":"12/11/2006","Season":"2006-2007","Details":"Indiana suspended Stephen Jackson for 1 game for conduct detrimental to the team. Jackson got in an argument with coach Rick Carlisle during Monday's Ind-Chi game, after which Carlisle kicked Jackson off the bench."},
{"Date":"12/18/2006","Season":"2006-2007","Details":"The NBA handed down the suspensions for Saturday's Denver-New York fight and, as expected, the penalties were harsh. Carmelo Anthony (Den) was suspended for 15 games (throwing a punch at Collins). J.R. Smith (Den) and Nate Robinson (NY) were suspended for 10 games each (their scuffle ended up in the front row of fans). Mardy Collins (NY) was suspended for 6 games (his the flagrant foul started the whole thing). Jared Jeffries (NY) was suspended for 4 games (he aggressively tried to get at Anthony). Nene (Den) and Jerome James (NY) were suspended for 1 game each for leaving the bench during the incident (automatic suspensions, they did not participate in any altercations). In addition, the league fined the 2 teams $500,000 each."},
{"Date":"12/27/2006","Season":"2006-2007","Details":"The NBA fined Jason Kidd (NJ) $20,000 for criticizing the refs following Tuesday's Det-NJ game."},
{"Date":"12/29/2006","Season":"2006-2007","Details":"The NBA suspended James Posey (Mia) for 1 game for his flagrant foul on Luol Deng (Chi) during Wednesday's Mia-Chi game."},
{"Date":"1/5/2007","Season":"2006-2007","Details":"The NBA suspended Raja Bell (Pho) for 1 game for kicking Andrea Bargnani (Tor) during Wednesday's Pho-Tor game."},
{"Date":"1/5/2007","Season":"2006-2007","Details":"The NBA fined Allen Iverson (Den) $25,000 for his comments about the refs following Tuesday's Den-Phi game."},
{"Date":"1/12/2007","Season":"2006-2007","Details":"The NBA suspended Eddie Griffin (Min) for 5 games for violating the league's anti-drug program."},
{"Date":"1/12/2007","Season":"2006-2007","Details":"The NBA suspended ref Rodney Mott for 3 games for making an obscene gesture at a fan and using inappropriate language after Sunday's Mia-Por game."},
{"Date":"1/13/2007","Season":"2006-2007","Details":"The NBA suspended Andres Nocioni (Chi) for 1 game for elbowing Mikki Moore (NJ) during Thursday's Chi-NJ game."},
{"Date":"1/15/2007","Season":"2006-2007","Details":"Chicago suspended Chris Duhon for 1 game for missing Sunday's practice."},
{"Date":"1/17/2007","Season":"2006-2007","Details":"The NBA fined Eddie Jordan (Was) $15,000 for failing to leave the court in a timely manner following his ejection from Saturday's Was-SA game."},
{"Date":"1/20/2007","Season":"2006-2007","Details":"The NBA suspended Baron Davis (GS) for 1 game for throwing a punch at Quinton Ross (LAC) during Wednesday's GS-LAC game."},
{"Date":"1/20/2007","Season":"2006-2007","Details":"Minnesota suspended Ricky Davis for 1 game for leaving the bench for the locker room during Friday's Min-Det game."},
{"Date":"1/22/2007","Season":"2006-2007","Details":"The NBA fined Josh Smith (Atl) $25,000 for giving the finger to the crowd following his ejection in Saturday's Atl-Cha game."},
{"Date":"1/30/2007","Season":"2006-2007","Details":"The NBA suspended Kobe Bryant (LAL) for 1 game for throwing an elbow at Manu Ginobili (SA) during Sunday's LAL-SA game."},
{"Date":"1/31/2007","Season":"2006-2007","Details":"The NBA suspended Eric Musselman for 2 games for his recent conviction of DWI."},
{"Date":"2/5/2007","Season":"2006-2007","Details":"The NBA suspended Gary Payton (Mia) for 1 game for verbally anbusing the ref following his ejecction in Saturday's Mia-Mil game."},
{"Date":"2/6/2007","Season":"2006-2007","Details":"Chicago fined Tyrus Thomas (Chi) $10,000 for making comments to the media that he was only interested in the money for the Slam Dunk contest."},
{"Date":"2/9/2007","Season":"2006-2007","Details":"Washington suspended Etan Thomas for 2 games for his fight in practice with Brendan Haywood."},
{"Date":"2/10/2007","Season":"2006-2007","Details":"The NBA suspended Darrell Armstrong (Ind) for 1 game for verbally abusing the ref following his ejection during Friday's Ind-Den game."},
{"Date":"3/1/2007","Season":"2006-2007","Details":"The LA Lakers fined Vladimir Radmanovic $500,000 for violating his contract by snowboarding. Radmanovic suffered a separated shoulder while snowboarding during the All-Star break."},
{"Date":"3/7/2007","Season":"2006-2007","Details":"The NBA suspended Lindsey Hunter (Det) for 10 games for violating the NBA's anti-drug policy. Hunter tested positive for phenermine, a banned substance used for weight loss."},
{"Date":"3/7/2007","Season":"2006-2007","Details":"The NBA suspended Kobe Bryant (LAL) for 1 game for striking Marko Jaric (Min) in the face during Tuesday's Min-LAL game."},
{"Date":"3/10/2007","Season":"2006-2007","Details":"The NBA suspended Rasheed Wallace (Det) for 1 game for receiving his 16th technical foul of the season (an automatic suspension)."},
{"Date":"3/10/2007","Season":"2006-2007","Details":"Indiana suspended Jamaal Tinsley for 1 game for conduct detrimental to the team."},
{"Date":"3/13/2007","Season":"2006-2007","Details":"The NBA fined Brevin Knight (Cha) $25,000 for failing to leave the court in a timely manner and verbally abusing the ref following his ejection in Saturday's Cha-Mem games."},
{"Date":"3/14/2007","Season":"2006-2007","Details":"The NBA fined Andrew Bogut (Mil) $25,000 for making an obscene gesture towards the fans during Monday's Mil-Tor game."},
{"Date":"3/15/2007","Season":"2006-2007","Details":"The NBA fined Phil Jackson and the LA Lakers $50,000 each for Jackson's comments that the league was on a witch hunt against Kobe Bryant."},
{"Date":"3/18/2007","Season":"2006-2007","Details":"The NBA fined Boston $30,000 for excessive contact with the family of underclassman Kevin Durant."},
{"Date":"3/18/2007","Season":"2006-2007","Details":"The NBA fined Charlotte $15,000 for public comments minority owner Michael Jordan made regarding underclassman Kevin Durant."},
{"Date":"3/18/2007","Season":"2006-2007","Details":"The NBA fined Golden State $15,000 for public comments coach Don Nelson made regarding underclassmen Greg Oden and Kevin Durant."},
{"Date":"3/24/2007","Season":"2006-2007","Details":"The NBA suspended Rasheed Wallace (Det) for 1 game for receiving his 18th technical foul, an automatic suspension."},
{"Date":"4/3/2007","Season":"2006-2007","Details":"The NBA fined Isiah Thomas (NY) $50,000 for comments he made about the officiating following Saturday's NY-NO game."},
{"Date":"4/9/2007","Season":"2006-2007","Details":"Atlanta suspended Josh Smith for 2 games for conduct detrimental to the team. Smith shouted at coach Mike Woodson during Sunday's Phi-Atl game."},
{"Date":"4/10/2007","Season":"2006-2007","Details":"The NBA fined Adam Morrison (Cha) $25,000 for flipping off a fan during Sunday's Mia-Cha game."},
{"Date":"4/17/2007","Season":"2006-2007","Details":"The NBA suspended ref Joey Crawford indefinitely, including for the rest of the 06-07 regular season and playoffs, for improper conduct and a lack of professionalism and for being a repeat offender. Crawford ejected Tim Duncan (SA) from Sunday's Dal-SA game for simply laughing while he was on the bench."},
{"Date":"4/17/2007","Season":"2006-2007","Details":"The NBA fined Tim Duncan (SA) $25,000 for inappropriate comments made to Crawford following his ejection during Sunday's Dal-SA game."},
{"Date":"4/23/2007","Season":"2006-2007","Details":"The NBA fined Kirk Hinrich (Chi) $25,000 for throwing his mouth piece during Saturday's Mia-Chi game."},
{"Date":"4/27/2007","Season":"2006-2007","Details":"The NBA fined Stephen Jackson (GS) $50,000 for failing to leave the court in a timely manner and verbal abuse of the refs following his ejection in Wednesday's Dal-GS game."},
{"Date":"5/3/2007","Season":"2006-2007","Details":"The NBA fined Jason Richardson (GS) $35,000 for improper contact with a fan during Tuesday's Dal-GS game."},
{"Date":"5/15/2007","Season":"2006-2007","Details":"The NBA suspended Robert Horry (SA) for 2 games for his forearm shiver on Steve Nash (Pho) late in Monday's SA-Pho game and for striking Raja Bell (Pho) during the confrontation after the incident. Amare Stoudemire (Pho) and Boris Diaw (Pho) were suspended for leaving the bench during the altercation."},
{"Date":"5/22/2007","Season":"2006-2007","Details":"The NBA fined San Antonio $50,000 for failing to make their players available to the media on Monday. San Antonio had given the players the day off."},
{"Date":"7/14/2007","Season":"2008-2009","Details":"The NBA suspended Ron Artest (Sac) for 7 games for his no contest plea in May to a misdemeanor domestic violence charge."},
{"Date":"7/14/2007","Season":"2008-2009","Details":"The NBA suspended Stephen Jackson (GS) for 7 games for his guilty plea in June to a felony count of criminal recklessness for firing a gun outside a strip club last fall."},
{"Date":"8/23/2007","Season":"2008-2009","Details":"The NBA fined Seattle co-owner Aubrey McClendon $250,000 for his comments from 2 weeks ago about the new owners' plans to move the team to Oklahoma."},
{"Date":"8/31/2007","Season":"2008-2009","Details":"The NBA suspended James Posey (Bos) for 1 game for his no contest plea regarding a charge of reckless driving."},
{"Date":"9/17/2007","Season":"2008-2009","Details":"The NBA reinstated suspended referee Joey Crawford. Crawford had been suspended since 4/17/07 for improper conduct and a lack of professionalism and for being a repeat offender following a Dallas-San Antonio game where Crawford ejected Tim Duncan (SA) for simply laughing while Duncan was on the bench."},
{"Date":"10/19/2007","Season":"2008-2009","Details":"The NBA suspended Josh Howard (Dal) for 2 games for throwing a forearm at the back of Brad Miller (Sac) after Miller intentionally shoved Devin Harris (Dal) to the ground during Tuesday's Dal-Sac game."},
{"Date":"10/20/2007","Season":"2008-2009","Details":"Denver suspended J.R. Smith for the first 3 games of the regular season for conduct detrimental to the team."},
{"Date":"10/31/2007","Season":"2008-2009","Details":"The NBA suspended Lakers owner Jerry Buss for 2 games and fined him $25,000 for his conviction on a misdemeanor drunk driving charge in May."},
{"Date":"11/14/2007","Season":"2008-2009","Details":"New York fined Stephon Marbury one game's pay (about $182,000) for missing Tuesday's NY-Pho game."},
{"Date":"11/26/2007","Season":"2008-2009","Details":"The NBA fined Avery Johnson (Dal) $25,000 for failing to leave the court in a timely manner following his ejection in Friday's Dal-Ind game."},
{"Date":"12/13/2007","Season":"2008-2009","Details":"The NBA suspended Al Horford (Atl) for 1 game for his flagrant foul on T.J. Ford (Tor) during Tuesday's Tor-Atl game."},
{"Date":"12/14/2007","Season":"2008-2009","Details":"The NBA suspended Tyrus Thomas (Chi) for 1 game and fined Troy Murphy (Ind) $10,000 for their fight during Wednesday's Chi-Ind game."},
{"Date":"12/15/2007","Season":"2008-2009","Details":"The NBA suspended Kenyon Martin (Den) for 1 game for his flagrant foul on Melvin Ely (NO) during Wednesday's Den-NO game. Martin's elbow hit Ely in the face and resulted in Ely suffering a fractured left eye socket."},
{"Date":"1/1/2008","Season":"2008-2009","Details":"The NBA suspended Lamar Odom (LAL) for 1 game for his flagrant foul on Ray Allen (Bos) during Sunday's LAL-Bos game."},
{"Date":"1/4/2008","Season":"2008-2009","Details":"The NBA suspended Zach Randolph (NY) for 1 game for throwing his headband at a ref during Wednesday's NY-Sac game."},
{"Date":"1/11/2008","Season":"2008-2009","Details":"In a rarity, the NBA upheld Miami's protest of the December 19 game at Atlanta. Atlanta led 114-111 with 51.9 seconds left in overtime when the scoring table ruled that Shaquille O'Neal (MIA) had collected his 6th foul and, thus, was disqualified when it was actually only O'Neal's 5th foul. Atlanta went on to win the game 117-111. That game is now invalid (with Atlanta losing a win and Miami losing a loss in the current standings) and the game will be replayed starting with 51.9 seconds left and the score 114-111 Atlanta on March 8 prior to the scheduled Miami at Atlanta game (the replay game will occur and then the teams will play a full game). The Hawks were also fined $50,000 for the mistake. It was the first time since December 1982 that the NBA upheld a protest."},
{"Date":"1/11/2008","Season":"2008-2009","Details":"The NBA suspended David Harrison (Ind) for 5 games for violating the league's anti-drug program."},
{"Date":"1/11/2008","Season":"2008-2009","Details":"Chicago suspended Joakim Noah for 1 game for internal disciplinary reasons. Chicago activated Demetris Nicholas and placed Noah on IL."},
{"Date":"1/20/2008","Season":"2008-2009","Details":"The NBA suspended Anthony Johnson (Atl) for 1 game for his flagrant foul on Jose Calderon (Tor) during Friday's Atl-Tor game."},
{"Date":"1/22/2008","Season":"2008-2009","Details":"Atlanta suspended Zaza Pachulia for 1 game for conduct detrimental to the team."},
{"Date":"1/29/2008","Season":"2008-2009","Details":"Memphis suspended Stromile Swift for 1 game for conduct detrimental to the team."},
{"Date":"1/30/2008","Season":"2008-2009","Details":"The NBA suspended Renaldo Balkman (NY) for 1 game for his flagrant foul on Sasha Vujacic (LAL) during Tuesday's NY-LAL game."},
{"Date":"2/8/2008","Season":"2008-2009","Details":"The NBA suspended Sam Cassell (LAC) for 1 game for his flagrant foul on Rajon Rondo (Bos) during Wednesday's LAC-Bos game."},
{"Date":"2/29/2008","Season":"2008-2009","Details":"The NBA suspended Danny Granger (Ind) for 1 game for hitting Andres Nocioni (Chi) in the face during Wednesday's Ind-Chi game."},
{"Date":"3/5/2008","Season":"2008-2009","Details":"The NBA suspended Dirk Nowitzki (Dal) for 1 game for his flagrant foul against Andrei Kirilenko (Uta) during Monday's Dal-Uta game. The flagrant was also upgraded to a level 2."},
{"Date":"3/5/2008","Season":"2008-2009","Details":"Chicago suspended Tyrus Thomas for 2 games after Thomas missed Wednesday's practice."},
{"Date":"3/14/2008","Season":"2008-2009","Details":"The NBA suspended Bruce Bowen (SA) for 1 game for kicking Chris Paul (NO) during Wednesday's SA-NO game."},
{"Date":"4/3/2008","Season":"2008-2009","Details":"The NBA suspended Kenyon Martin (Den) for 1 game for collecting his 5th flagrant foul point of the season (an automatic suspension)."},
{"Date":"4/16/2008","Season":"2008-2009","Details":"The NBA suspended Royal Ivey (Mil) for 3 games for punching Aaron Gray (Chi) during Monday's Chi-Mil game. Ivey served the first game for Wednesday's game and the last 2 games will be served for the start of the 08-09 regular season."},
{"Date":"4/25/2008","Season":"2008-2009","Details":"The NBA fined Maurice Cheeks (Phi) $25,000 for verbally abusing the refs and failing to leave the court in a timely manner following Wednesday's Phi-Det game."},
{"Date":"4/28/2008","Season":"2008-2009","Details":"The NBA fined Paul Pierce (Bos) $25,000 for making "},
{"Date":"4/28/2008","Season":"2008-2009","Details":"The NBA fined DeShawn Stevenson (Was) $25,000 for making "},
{"Date":"5/2/2008","Season":"2008-2009","Details":"The NBA suspended Darius Songaila (Was) for 1 game for hitting LeBron James (Cle) in the face during Wednesday's Was-Cle game."},
{"Date":"5/7/2008","Season":"2008-2009","Details":"The NBA suspended Marvin Williams (Atl) for 1 game for his flagrant foul on Rajon Rondo (Bos) during Sunday's Bos-Atl game. The suspension will be served for the first game of the 08-09 regular season."},
{"Date":"5/29/2008","Season":"2008-2009","Details":"The NBA fined Rasheed Wallace (Det) $25,000 for criticizing the refs and using profanity following Wednesday's Det-Bos game."},
{"Date":"6/23/2008","Season":"2008-2009","Details":"Denver suspended Carmelo Anthony for 2 games for his arrest on April 14 for DWI. The suspension will occur at the start of the 08-09 regular season."},
{"Date":"7/10/2008","Season":"2008-2009","Details":"The NBA suspended Brad Miller for 5 games for violating the NBA's anti-drug policy. The suspension will be served at the start of the 08-09 regular season."},
{"Date":"7/10/2008","Season":"2008-2009","Details":"The NBA suspended JamesOn Curry for 1 game for his guilty plea for resisting an officer and public urination. The suspension will be served at the start of the 08-09 regular season."},
{"Date":"9/10/2008","Season":"2008-2009","Details":"The NBA fined Darrell Arthur (Mem) and Mario Chalmers (Mia) $20,000 each for getting kicked out of the NBA rookie program. The two refused to leave their hotel room during a fire alarm and hotel security entered the room to force them to leave and discovered two women and the smell of marijuana. The two players were kicked out of the program for violating program rules which does not allow the rookies to have visitors. The two denied using marijuana and there was no physical evidence of marijuana recovered from the room."},
{"Date":"9/18/2008","Season":"2008-2009","Details":"The NBA fined Michael Beasley (Mia) $50,000 for his involvement in the incident with Darrell Arthur (Mem) and Mario Chalmers (Mia) during the Rookie Transition Program. Arthur and Chalmers (who were fined $20,000 previously) refused to leave their hotel room during a fire alarm and hotel security entered the room to force them to leave and discovered two women and the smell of marijuana. Beasley initially denied his involvement in the incident and refused to cooperate with the league investigation."},
{"Date":"9/19/2008","Season":"2008-2009","Details":"The NBA suspended Darius Miles (Bos) for 10 games for violating the league's anti-drug policy. Miles will serve the suspension at the start of the regular season (or, if he is cut before the regular season, for the next regular season games he is on a roster)."},
{"Date":"9/26/2008","Season":"2008-2009","Details":"The NBA fined Gilbert Arenas (Was) and the Wizards $15,000 each for Arenas missing media day."},
{"Date":"10/11/2008","Season":"2008-2009","Details":"Golden State suspended Monta Ellis for 30 games for violating his contract. Ellis was involved in a moped accident this summer and suffered a seriously sprained ankle - he then lied to the team about the cause of the injury."},
{"Date":"10/14/2008","Season":"2008-2009","Details":"The NBA suspended Sebastian Telfair (Min) for 3 games for his guilty plea of criminal possession of a weapon. The suspension will start with the beginning of the regular season."},
{"Date":"11/13/2008","Season":"2008-2009","Details":"The NBA fined Reggie Theus (Sac) $25,000 for his comments about the refs complaining about the free throw discrepancy following Tuesday's Sac-Det game."},
{"Date":"11/14/2008","Season":"2008-2009","Details":"The NBA suspended Rafer Alston (Hou) and Matt Barnes (Pho) for 2 games each for their altercation during Wednesday' Hou-Pho game. The NBA suspended Steve Nash (Pho) for 1 game for esculating the incident. The NBA fined Shaquille O'Neal (Pho) $35,000 and Tracy McGrady (Hou) $25,000 to their rule in the incident."},
{"Date":"11/15/2008","Season":"2008-2009","Details":"The NBA fined Kenyon Martin (Den) $20,000 for verbal abuse of a ref and failing to leave the court in a timely manner following his ejected from Thursday's Den-Cle game."},
{"Date":"11/17/2008","Season":"2008-2009","Details":"The NBA suspended Kevin Garnett (Bos) for 1 game for striking Andrew Bogut (Mil) in the face during Saturday's Bos-Mil game. Bogut's foul on Garnett that proceeded the incident was upgraded to a Flagrant Foul level 1."},
{"Date":"11/17/2008","Season":"2008-2009","Details":"The NBA fined Shaquille O'Neal (Pho) $25,000 for verbally abusing a ref and failing to leave the court in a timely manner following his ejection from Sunday's Pho-Det game."},
{"Date":"12/16/2008","Season":"2008-2009","Details":"The NBA fined Allen Iverson (Det) $25,000 for making inappropriate comments towards a fan during Saturday's Det-Cha game."},
{"Date":"12/28/2008","Season":"2008-2009","Details":"The NBA suspended Dirk Nowitzki (Dal) for 1 game for hitting Matt Harpring (Uta) in the face during Friday's Dal-Uta game."},
{"Date":"12/30/2008","Season":"2008-2009","Details":"The NBA suspended Ricky Davis (LAC) for 5 games for violating the league's anti-drug policy."},
{"Date":"1/3/2009","Season":"2008-2009","Details":"The NBA suspended Tyson Chandler (NO) for 1 game for throwing an elbow at Joel Przybilla (Por) during Friday's Por-NO game. Przybilla was fined $7,500 and assessed a flagrant foul for his role in the altercation."},
{"Date":"1/16/2009","Season":"2008-2009","Details":"The NBA fined Mark Cuban (Dal) $25,000 for improper interactions with J.R. Smith (Den) during Tuesday's Dal-Den game. Cuban (Dallas' owner) was complaining about a thrown elbow by Smith."},
{"Date":"2/2/2009","Season":"2008-2009","Details":"The NBA fined Kendrick Perkins (Bos) $10,000 for his flagrant foul on Jason Maxiell (Det) during Friday's Bos-Det game."},
{"Date":"2/7/2009","Season":"2008-2009","Details":"The NBA fined Doc Rivers (Bos) $15,000 for verbally abusing the refs following the Feb. 8 LAL-Bos game."},
{"Date":"2/9/2009","Season":"2008-2009","Details":"The NBA suspended David West (NO) for 1 game for his flagrant foul on Mike Miller (Min) during Sunday's NO-Min game."},
{"Date":"2/12/2009","Season":"2008-2009","Details":"The NBA fined Mike Brown (Cle) $25,000 for his comments about the officiating following Tuesday's Cle-Ind game."},
{"Date":"2/16/2009","Season":"2008-2009","Details":"Phoenix suspended Jason Richardson for 1 game for his arrest for excessive speeding (55 mph over limit) with an unrestrained 3 year-old in the back seat."},
{"Date":"2/18/2009","Season":"2008-2009","Details":"The NBA suspended Zach Randolph (LAC) for 2 games for hitting Louis Amundson (Pho) in the face during Tuesday's LAC-Pho game."},
{"Date":"2/27/2009","Season":"2008-2009","Details":"The NBA fined Rasheed Wallace (Det) $25,000 for throwing a towel into the stands following his ejection from Wednesday's Det-NO game."},
{"Date":"2/27/2009","Season":"2008-2009","Details":"Boston suspended Gabe Pruitt for 2 games for his recent arrest for DUI and placed him on IL."},
{"Date":"3/3/2009","Season":"2008-2009","Details":"Denver suspended Carmelo Anthony for 1 game for failing to leave the game during Sunday's Den-Ind game."},
{"Date":"3/10/2009","Season":"2008-2009","Details":"The NBA suspended Lamar Odom (LAL) for 1 game for coming off the bench after Trevor Ariza (LAL) flagrantly fouled Rudy Fernandez (Por) during Monday's LAL-Por game."},
{"Date":"3/16/2009","Season":"2008-2009","Details":"The NBA suspended Stephen Jackson (GS) for 1 game for receiving his 16th technical foul of the season, an automatic suspension for getting the 16th tech."},
{"Date":"3/19/2009","Season":"2008-2009","Details":"The NBA fined Doc Rivers (Bos) $25,000 for criticizing a ref following Tuesday's Chi-Bos game. The NBA also fined ref Bill Kennedy an undisclosed amount for his interaction with Rivers just prior to Rivers being ejected."},
{"Date":"3/24/2009","Season":"2008-2009","Details":"The NBA fined Linas Kleiza (Den) $25,000 for verbal abuse of the refs after Friday's Was-Den game."},
{"Date":"3/25/2009","Season":"2008-2009","Details":"The NBA suspended Nene (Den) for 2 game for head butting Louis Amundson (Pho) and making contact with a ref as he was ejected during Monday's Den-Pho game."},
{"Date":"3/29/2009","Season":"2008-2009","Details":"The NBA suspended James Posey (NO) for 1 game for throwing the ball at a ref during Friday's NY-NO game."},
{"Date":"3/29/2009","Season":"2008-2009","Details":"The NBA fined Mark Cuban (Dal owner) $25,000 for publicly criticizing the refs following Friday's Den-Dal game."},
{"Date":"4/6/2009","Season":"2008-2009","Details":"The LA Clippers suspended Zach Randolph for 2 games for his arrest on Sunday for DWI."},
{"Date":"4/14/2009","Season":"2008-2009","Details":"The NBA suspended Ray Allen (Bos) for 1 game for elbowing Anderson Varejao (Cle) in the groin during Sunday's Bos-Cle game."},
{"Date":"4/28/2009","Season":"2008-2009","Details":"The NBA fined Rick Adelman (Hou) $25,000 for his comments about the officiating between Games 3 and 4. Houston was also fined $25,000."},
{"Date":"4/28/2009","Season":"2008-2009","Details":"The NBA fined Nate McMillan (Por) $25,000 for his comments about the officiating between Games 4 and 5. Portland was also fined $25,000."},
{"Date":"4/28/2009","Season":"2008-2009","Details":"The NBA fined Doc Rivers (Bos) $25,000 for his comments about the officiating between Games 4 and 5. Boston was also fined $25,000."},
{"Date":"4/29/2009","Season":"2008-2009","Details":"The NBA suspended Dwight Howard (Orl) for 1 game for throwing an elbow at Samuel Dalembert (Phi) during Tuesday's Phi-Orl game."},
{"Date":"5/4/2009","Season":"2008-2009","Details":"The NBA fined Kenyon Martin (Den) $25,000 and assessed him a flagrant foul for his shove on Dirk Nowitzki (Dal) during Saturday's Dal-Den game."},
{"Date":"5/7/2009","Season":"2008-2009","Details":"The NBA suspended Derek Fisher (LAL) for 1 game for intentionally throwing his shoulder into Luis Scola (Hou) during Wednesday's Hou-LAL game."},
{"Date":"5/7/2009","Season":"2008-2009","Details":"The NBA suspended Rafer Alston (Orl) for 1 game for slapping Eddie House (Bos) on the head during Wednesday's Orl-Bos game."},
{"Date":"5/7/2009","Season":"2008-2009","Details":"The NBA assessed a flagrant foul (level 1) to Kobe Bryant (LAL) for throwing an elbow at Ron Artest (Hou) during Wednesday's Hou-LAL game."},
{"Date":"5/26/2009","Season":"2008-2009","Details":"The NBA fined Phil Jackson (LAL) $25,000 for publicly criticizing the refs after Monday's LAL-Den game. The Lakers were also fined a matching $25,000."},
{"Date":"5/26/2009","Season":"2008-2009","Details":"The NBA assessed Dahntay Jones (Den) a flagrant foul for his trip of Kobe Bryant (LAL) during Monday's LAL-Den game."},
{"Date":"6/4/2009","Season":"2008-2009","Details":"The NBA fined LeBron James (Cle) $25,000 for skipping the postgame press conference following Saturday's Cle-Orl game."},
{"Date":"6/13/2009","Season":"2008-2009","Details":"The NBA fined Phil Jackson (LAL) $25,000 for criticizing the refs during Thursday's Game 4 LAL-Orl game. The Lakers were also fined a matching $25,000."},
{"Date":"8/3/2009","Season":"2009-2010","Details":"The NBA fined Cleveland, Houston, and Minnesota an undisclosed amount for releasing details of their 09-10 schedule before the league's official announcement of the 09-10 schedules."},
{"Date":"8/6/2009","Season":"2009-2010","Details":"The NBA suspended Rashard Lewis (Orl) for 10 games for violating the league's anti-drug program for testing positive for an elevated testosterone level. Lewis said he had used a powered supplement mixed into smoothies and was unaware that it would cause a violation, but accepted the punishment and apologized."},
{"Date":"8/28/2009","Season":"2009-2010","Details":"The NBA suspended J.R. Smith (Den) for 7 games for his guilty plea this summer for reckless driving from a 2007 car accident that results in the death of a passenger in the car."},
{"Date":"8/28/2009","Season":"2009-2010","Details":"The NBA suspended Jason Richardson (Pho) for 2 games for his guilty plea this summer for a DUI arrest in December."},
{"Date":"9/15/2009","Season":"2009-2010","Details":"The NBA fined Stephen Jackson (GS) $25,000 for publically asking to be traded."},
{"Date":"10/8/2009","Season":"2009-2010","Details":"The NBA suspended Jamaal Magloire (Mia) for 2 games for starting a fight and striking Jonas Jerebko (Det) in the face during Monday's Mia-Det game. Jerebko was suspended for 1 game for retaliating and hitting Magloire in the face. The suspensions will be served at the start of the regular season (or first regular season game that either is on a NBA roster if they are cut before the season starts)."},
{"Date":"10/10/2009","Season":"2009-2010","Details":"The NBA suspended Austin Daye (Det) and Carlos Delfino (Mil) for 1 game for their altercation during Wednesday's Det-Mil game. The suspensions will occur at the start of the regular season."},
{"Date":"10/10/2009","Season":"2009-2010","Details":"Golden State suspended Stephen Jackson for 2 games (preseason) for conduct determental to the team. Jackson got in an argument with the coach and then (unknown if by his own accord or by coach's order) left the bench for the locker room during Friday's GS-LAL game."},
{"Date":"10/13/2009","Season":"2009-2010","Details":"The NBA fined Gilbert Arenas (Was) $25,000 for failing to make himself available to the media for interviews and Washington was fined a matching $25,000 for failing to ensure that its players comply with NBA media interview rules."},
{"Date":"10/14/2009","Season":"2009-2010","Details":"The NBA fined Larry Brown (Cha) $35,000 for verbally abusing the refs and failing to leave the court in a timely manner following his ejection in Monday's Cha-Atl game and fined him $25,000 for publicly criticizing the refs following the game. The NBA also fined Charlotte $60,000 for Brown's actions."},
{"Date":"10/14/2009","Season":"2009-2010","Details":"The NBA fined Lionel Hollins (Mem) $25,000 for publicly criticizing the refs following Monday's Mem-Orl game."},
{"Date":"10/16/2009","Season":"2009-2010","Details":"The NBA fined Stan Van Gundy (Orl) $35,000 for publicly criticizing the refs and fined Orlando a matching $35,000."},
{"Date":"11/1/2009","Season":"2009-2010","Details":"The NBA fined Al Harrington (NY) $25,000 for publicly criticizing the refs following Friday's Phi-NY game."},
{"Date":"11/10/2009","Season":"2009-2010","Details":"The NBA fined Dwight Howard (Orl) $15,000 for publically criticizing the refs on his blog."},
{"Date":"11/28/2009","Season":"2009-2010","Details":"The NBA fined Matt Barnes (Orl) $20,000 for throwing the ball into the stands after Wednesday's Mia-Orl game."},
{"Date":"11/29/2009","Season":"2009-2010","Details":"The NBA fined Rasheed Wallace (Bos) $30,000 for public criticizing the refs following Friday's Bos-Tor game."},
{"Date":"11/29/2009","Season":"2009-2010","Details":"The NBA fined Amare Stoudemire (Pho) $7,500 for posting messages on Twitter during Wednesday's Pho-Mem game."},
{"Date":"11/29/2009","Season":"2009-2010","Details":"The NBA fined Tyson Chandler (Cha) $7,500 for postings message on Twitter during Wednesday's Cha-Tor game."},
{"Date":"12/4/2009","Season":"2009-2010","Details":"The NBA suspended Scott Skiles (Mil coach) for 1 game for his actions towards a ref during Wednesday's Mil-Was game."},
{"Date":"12/7/2009","Season":"2009-2010","Details":"The NBA fined Joakim Noah (Chi) $15,000 for throwing the ball into the stands and striking a photographer during saturday's Chi-Tor game."},
{"Date":"12/14/2009","Season":"2009-2010","Details":"The NBA suspended Trevor Ariza (Hou) for 1 game for swinging his elbow at DeMar deRozan (Tor) during Sunday's Hou-Tor game."},
{"Date":"12/18/2009","Season":"2009-2010","Details":"The NBA fined Brandon Jennings (Mil) $7,500 for posting to his twitter account following Saturday's Mil-Por game."},
{"Date":"12/28/2009","Season":"2009-2010","Details":"The NBA fined Nate Robinson (NY) $25,000 for his agent publically requesting a trade."},
{"Date":"1/6/2010","Season":"2009-2010","Details":"The NBA suspended Gilbert Arenas (Was) indefinitely. The league is investigating Arenas having guns in the locker room."},
{"Date":"1/8/2010","Season":"2009-2010","Details":"Washington fined Randy Foye, Andray Blatche, JaVale McGee, and Nick Young $10,000 each for joining Gilbert Arenas while he made fun of his gun related problems by using his fingers as guns during the pregame huddle prior to Tuesday's Was-Phi game."},
{"Date":"1/12/2010","Season":"2009-2010","Details":"The NBA fined 2 unnamed teams $10,000 each for not enforcing the rule that does not allow players along the bench to stand for long periods of time."},
{"Date":"1/12/2010","Season":"2009-2010","Details":"Washington suspended Andray Blatche for 1 game for complaining about not getting enough plays called for him."},
{"Date":"1/13/2010","Season":"2009-2010","Details":"The NBA fined Doc Rivers (Bos) $25,000 for his conduct after his ejection during Monday's Bos-Atl game."},
{"Date":"1/20/2010","Season":"2009-2010","Details":"The NBA fined Rasheed Wallace (Bos) $35,000 for his comments regarding the refs following Monday's Dal-Bos game."},
{"Date":"1/21/2010","Season":"2009-2010","Details":"The NBA fined Glen Davis (Bos) $25,000 for making inappropriate comments to a fan during Wednesday's Bos-Det game."},
{"Date":"1/26/2010","Season":"2009-2010","Details":"The NBA fined Kenyon Martin (Den) $35,000 for his actions surrounding his ejection during Monday's Cha-Den game."},
{"Date":"1/27/2010","Season":"2009-2010","Details":"The NBA announced that Gilbert Arenas (Was) is suspended without pay for the rest of the 09-10 season and that Javaris Crittenton (Was) is suspended without pay for the rest of the season. The two players had an argument that resulted in both players bringing guns in to the team locker room, a violation of the collective bargaining agreement. In a Washington, D.C. court, Crittenton had previously pleaded guilty to a misdemeanor count of possession of an unregistered gun and was sentenced to 1 year probation and fined $1,250. Arenas had previously pleaded guilty to a felony count of carrying a gun without a license and sentencing is scheduled for March 26."},
{"Date":"1/28/2010","Season":"2009-2010","Details":"The NBA fined LeBron James (Cle) $25,000 for kicking a water bottle during Wednesday's Min-Cle game."},
{"Date":"2/6/2010","Season":"2009-2010","Details":"Chicago suspended Tyrus Thomas for 1 game for conduct detrimental to the team."},
{"Date":"2/26/2010","Season":"2009-2010","Details":"The NBA fined Andrew Bynum (LAL) $25,000 for publically criticizing the refs following Wednesday's Dal-LAL game in saying that it felt like the Lakers were playing 5-on-8."},
{"Date":"2/28/2010","Season":"2009-2010","Details":"Minnesota suspended Al Jefferson for 2 games for his arrest Sunday morning for DWI."},
{"Date":"3/1/2010","Season":"2009-2010","Details":"Indiana suspended Solomon Jones for 1 game for conduct detrimental to the team."},
{"Date":"3/5/2010","Season":"2009-2010","Details":"Miami suspended Rafer Alston indefinitely. The team says that Alston has made himself unavailable for contact with the team other than text messages."},
{"Date":"3/9/2010","Season":"2009-2010","Details":"The NBA suspended Danny Granger (Ind) and Channing Frye (Pho) for 1 game for their altercation during Saturday's Ind-Pho game. Earl Watson (Ind) was fined $30,000 for instigating and escalating the fight. Roy Hibbert (Ind) and Jason Richardson (Pho) were fined $25,000 for adding to the escalation of the fight."},
{"Date":"3/10/2010","Season":"2009-2010","Details":"The NBA suspended Ryan Hollins (Min) for 2 games for punching DeShawn Stevenson (Dal) and hitting Dirk Nowitzki (Dal) in the head (separate incidents) during Monday's Dal-Min game."},
{"Date":"3/12/2010","Season":"2009-2010","Details":"Miami suspended Dorell Wright for 2 games for his DUI arrest on Thursday."},
{"Date":"3/12/2010","Season":"2009-2010","Details":"Miami announced that Rafer Alston's suspension is for the rest of the season. Alston had been suspended indefinitely on March 6 for not contacting the team."},
{"Date":"3/13/2010","Season":"2009-2010","Details":"The NBA suspended Kirk Hinrich (Chi) for 1 game for making contact with a ref during Friday's Chi-Mia game."},
{"Date":"3/13/2010","Season":"2009-2010","Details":"The NBA fined Alvin Gentry (Pho) $25,000 for improper conduct toward a ref and failing to leave the court in a timely manner following his ejection from Friday's Pho-LAL game."},
{"Date":"3/27/2010","Season":"2009-2010","Details":"The NBA fined Caron Butler (Dal) $25,000 for inappropriate language direct at fans during Thursday's Dal-Por game."},
{"Date":"4/2/2010","Season":"2009-2010","Details":"The NBA fined Kevin Garnett (Min) $25,000 for criticizing the refs and using inappropriate language after Wednesday's Bos-OKC game."},
{"Date":"4/5/2010","Season":"2009-2010","Details":"The NBA fined Phil Jackson (LAL) $35,000 for publically criticizing the refs after Sunday's LAL-SA game."},
{"Date":"4/15/2010","Season":"2009-2010","Details":"The NBA fined Phil Jackson $35,000 for comments he made about the refs regarding their calling of Kevin Durant's (OKC) game."},
{"Date":"4/18/2010","Season":"2009-2010","Details":"The NBA suspended Kevin Garnett (Bos) for 1 game for throwing an elbow at Quentin Richardson (Mia) during Saturday's Mia-Bos game. Richardson was fined $25,000 for instigating the altercation."},
{"Date":"4/22/2010","Season":"2009-2010","Details":"The NBA fined Rasheed Wallace (Bos) $35,000 for criticizing the refs on Monday (no game)."},
{"Date":"4/22/2010","Season":"2009-2010","Details":"The NBA fined Stan Van Gundy (Orl) and Matt Barnes (Orl) $35,000 each for criticizing the refs following Wednesday's Orl-Cha game."},
{"Date":"4/26/2010","Season":"2009-2010","Details":"The NBA fined Erick Dampier (Dal) $35,000 for his comments about the officiating after Friday's Dal-SA game."},
{"Date":"4/28/2010","Season":"2009-2010","Details":"The NBA fined Dwight Howard (Orl) $35,000 for criticizing the refs on his blog on Tuesday."},
{"Date":"5/6/2010","Season":"2009-2010","Details":"The NBA fined Danny Ainge (Bos GM) $25,000 for tossing a towel trying to distract J.J. Hickson (Cle) while he was shooting a free throw during Monday's Bos-Cle game."},
{"Date":"5/20/2010","Season":"2009-2010","Details":"The NBA suspended ref Joe DeRosa for 1 game for throwing the ball at a fan during halftime of Tuesday's Bos-Orl game."},
{"Date":"5/22/2010","Season":"2009-2010","Details":"The NBA fined Dallas owner Mark Cuban $100,000 for public comments he made regarding soon to be (but not officially until July 1) free agent LeBron James, which violated the league's anti-tampering rules."},
{"Date":"5/22/2010","Season":"2009-2010","Details":"The NBA fined Phoenix president Steve Kerr $10,000 for public comments he made about LeBron James, which violated the league's anti-tampering rules."},
{"Date":"5/27/2010","Season":"2009-2010","Details":"The NBA fined Atlanta owner Michael Gearon $25,000 for public comments he made regarding LeBron James (Cle) and other upcoming free agents, which violated the league's anti-tampering rules."},
{"Date":"5/28/2010","Season":"2009-2010","Details":"The LA Lakers fined Ron Artest for being late to practice."},
{"Date":"7/12/2010","Season":"2010-2011","Details":"The NBA fined Cleveland $100,000 for owner Dan Gilbert's remarks about LeBron James signing with Miami."},
{"Date":"7/23/2010","Season":"2010-2011","Details":"The NBA fined Minnesota GM David Kahn $50,000 and fined the team a matching $50,000 for Kahn's comments on the radio stating that Michael Beasley smoked too much marijuana while with Miami."},
{"Date":"8/19/2010","Season":"2010-2011","Details":"The NBA fined Rudy Fernandez (Por) $25,000 for public comments detrimental to the NBA. Fernandez's agent said that Fernandez did not want to return to Portland and wanted to play in Europe."},
{"Date":"8/20/2010","Season":"2010-2011","Details":"The NBA suspended Delonte West for 10 games for his guilty plea for weapons charges. West pleaded guilty on 7/15 to carring 2 loaded handguns and a loaded shotgun while speeding and was sentenced to 8 months of electronic monitoring, 2 years of probation, 40 hours of community service, and counseling. The suspension will occur for the first 10 regular season games of the season."},
{"Date":"8/27/2010","Season":"2010-2011","Details":"The NBA suspended Brandon Rush (Ind) for 5 games for violating the league's anti-drug policy. The suspension will be served at the start of the regular season."},
{"Date":"8/27/2010","Season":"2010-2011","Details":"The NBA suspended Kenny Hasbrouck (Mia) for 2 games for his guilty plea for driving while intoxicated. The suspension will be served at the start of the regular season."},
{"Date":"8/27/2010","Season":"2010-2011","Details":"The NBA suspended Tyreke Evans (Sac) for 1 game for pleading no contest to reckless driving. The suspension will be served at the start of the regular season. Evans pleaded no contest on 8/2 for speeding between 120 to 130 mph and was sentenced to 80 hours of community service, ordered to take part in teen driving programs, and had his license suspended for 30 days."},
{"Date":"9/29/2010","Season":"2010-2011","Details":"The NBA fined Washington owner Ted Leonsis $100,000 for unauthorized public comments regarding the collective bargaining negotiations. Leonsis said that he expects the next CBA to have a hard cap."},
{"Date":"10/11/2010","Season":"2010-2011","Details":"The NBA fined Rudy Fernandez (Por) $50,000 for public comments his agent made that the league said were detrimental to the NBA. Fernandez agent again stated Fernandez's desire to be released."},
{"Date":"10/13/2010","Season":"2010-2011","Details":"Washington fined Gilbert Arenas an undisclosed amount for faking an injury to keep from playing in Tuesday's Was-Atl game. Arenas told the press after the game that he faked the injury so that teammate Nick Young would have a chance to start."},
{"Date":"10/14/2010","Season":"2010-2011","Details":"The NBA suspended Joey Dorsey (Tor) for 1 game for swinging his arm at the head of Brian Scalabrine (Chi) during Tuesday's Tor-Chi game. The suspension will occur at the beginning of the regular season."},
{"Date":"10/29/2010","Season":"2010-2011","Details":"The NBA suspended Jason Williams (Orl) for grabbing the ref on the arm following Williams' ejection during Thursday's Orl-Was game."},
{"Date":"11/6/2010","Season":"2010-2011","Details":"The NBA fined Stephen Jackson (Cha) $50,000 for verbally abusing a ref after Friday's Cha-Det game."},
{"Date":"11/24/2010","Season":"2010-2011","Details":"The NBA suspended Elton Brand (Phi) for 1 game for the flagrant foul he committed on JaVale McGee (Was) during Tuesday's Was-Phi game."},
{"Date":"11/26/2010","Season":"2010-2011","Details":"Dallas suspended Brandan Haywood for 1 game for violating team rules."},
{"Date":"11/28/2010","Season":"2010-2011","Details":"The NBA fined coach Byron Scott (Cle) $35,000 for publicly criticizing the refs following Friday's Orl-Cle game."},
{"Date":"11/30/2010","Season":"2010-2011","Details":"The NBA suspended Stephen Jackson (Cha) for 1 game for verbally abusing the refs and failing to leave the court in a timely manner following his ejection from Saturday's Mil-Cha game."},
{"Date":"12/1/2010","Season":"2010-2011","Details":"The NBA suspended Hilton Armstrong (Was) for one game for his flagrant foul against Joel Anthony (Mia) during Monday's Mia-Was game."},
{"Date":"12/6/2010","Season":"2010-2011","Details":"The NBA suspended Brian Cook (LAC) for 2 games for his flagrant foul on Joel Przybilla (Por) during Sunday's LAC-Por game."},
{"Date":"12/6/2010","Season":"2010-2011","Details":"The NBA suspended Andre Miller (Por) for 1 game for making excessive and unnecessary contact with Blake Griffin (LAC) during Sunday's LAC-Por game."},
{"Date":"12/18/2010","Season":"2010-2011","Details":"The NBA suspended Rudy Gay (Mem) for 1 game for his flagrant foul against Luis Scola (Hou) during Friday's Hou-Mem game."},
{"Date":"12/18/2010","Season":"2010-2011","Details":"The NBA fined Andre Miller (Por) $25,000 for throwing the ball into the stands at the end of Wednesday's Dal-Por game."},
{"Date":"12/18/2010","Season":"2010-2011","Details":"The NBA fined George Karl (Den) $25,000 for publically criticizing the refs following Thursday's Den-Por game."},
{"Date":"12/25/2010","Season":"2010-2011","Details":"Washington suspended Andray Blatche and JaVale McGee for conduct detrimental to the team. The two reportedly threw punches at each other outside a club late Friday night."},
{"Date":"12/27/2010","Season":"2010-2011","Details":"The NBA fined Shaquille O'Neal (Bos) $35,000 for his comments about the officiating following Saturday's Bos-Orl game."},
{"Date":"12/28/2010","Season":"2010-2011","Details":"The NBA suspended Earl Boykins (Mil) for 1 game for making intentional contact with a ref during Monday's Mil-Atl game."},
{"Date":"1/1/2011","Season":"2010-2011","Details":"The NBA fined Stan Van Gundy (Orl) $35,000 for his comments about the refs following Thursday's Orl-NY game."},
{"Date":"1/1/2011","Season":"2010-2011","Details":"The NBA fined Paul Pierce (Bos) $15,000 for throwing an object into the stands during Wednesday's Bos-Ind game."},
{"Date":"1/17/2011","Season":"2010-2011","Details":"The NBA suspended Tyrus Thomas (Cha) for 1 game for his flagrant foul on Emeka Okafor (NO) during Saturday's Cha-NO game."},
{"Date":"1/22/2011","Season":"2010-2011","Details":"Atlanta suspended Josh Powell for one game for conduct detrimental to the team."},
{"Date":"1/27/2011","Season":"2010-2011","Details":"The NBA suspended O.J. Mayo for 10 games for violating the terms of the anti-drug program. Mayo tested positive for dehydroepiandrosterone (DHEA) which Mayo claims was in an over the counter supplement that he didn't know was banned by the NBA."},
{"Date":"1/29/2011","Season":"2010-2011","Details":"The NBA suspended Marvin Williams (Atl) for 2 games and Shawne Williams (NY) for 1 game for their altercation during Friday's Atl-NY game where MWilliams threw 2 punches and SWilliams threw 1 punch."},
{"Date":"1/30/2011","Season":"2010-2011","Details":"The NBA fined Doc Rivers (Bos) $15,000 for failing to leave the court in a timely manner following his ejection from Friday's Pho-Bos game."},
{"Date":"1/30/2011","Season":"2010-2011","Details":"The NBA fined Josh Smith (Atl) $25,000 for making an obscene gesture during Friday's Atl-NY game."},
{"Date":"1/31/2011","Season":"2010-2011","Details":"The NBA fined Eddie House (Mia) $25,000 for making an obscene gesture during Sunday's Mia-OKC game."},
{"Date":"2/3/2011","Season":"2010-2011","Details":"The NBA fined New York $200,000 and team scout Rodney Heard $20,000 for conducting illegal draft workouts."},
{"Date":"2/4/2011","Season":"2010-2011","Details":"The NBA fined Avery Johnson (NJ) $25,000 for improper conduct towards a ref during Wednesday's Phi-NJ game."},
{"Date":"2/5/2011","Season":"2010-2011","Details":"The NBA fined J.R. Smith (Den) $25,000 for his flagrant foul on Raja Bell (Uta) during Friday's Den-Uta game."},
{"Date":"2/7/2011","Season":"2010-2011","Details":"Houston suspended Aaron Brooks for 1 game for leaving the court during the 4th quarter of Saturday's Hou-Mem game. Brooks was placed on IL and Ism Smith was activated (after being recalled from the NBADL)."},
{"Date":"2/11/2011","Season":"2010-2011","Details":"The NBA fined Chris Paul (NO) $15,000 for verbally abusing the ref following Wednesday's NO-NJ game."},
{"Date":"2/14/2011","Season":"2010-2011","Details":"Sacramento fined DeMarcus Cousins one game's pay for his fight with teammate Donte Greene in the lockerroom following Saturday's Sac-OKC game. Cousins did not play in Sunday's game at Phoenix while the team reviewed the incident."},
{"Date":"2/26/2011","Season":"2010-2011","Details":"Detroit fined Richard Hamilton, Chris Wilcox, Austin Daye, and Rodney Stuckey for missing Friday's shootaround."},
{"Date":"3/5/2011","Season":"2010-2011","Details":"The NBA suspended Dwight Howard (Orl) for 1 game for collecting his 16th technical foul of the season. A player is automatically suspended for 1 game for his 16th, 18th, 20th, ... technical foul in the regular season."},
{"Date":"3/5/2011","Season":"2010-2011","Details":"The NBA fined Erick Dampier (Mia) $10,000 for his flagrant foul on Tony Parker (SA) during Friday's Mia-SA game."},
{"Date":"3/10/2011","Season":"2010-2011","Details":"The NBA fined Marco Belinelli (NO) $10,000 for his flagrant foul on Shawn Marion (Dal) during Wednesday's Dal-NO game and upgraded the flagrant foul to a level 2."},
{"Date":"3/20/2011","Season":"2010-2011","Details":"The NBA suspended Andrew Bynum (LAL) for 2 games for his flagrant foul on Michael Beasley (Min) during Friday's LAL-Min games."},
{"Date":"3/20/2011","Season":"2010-2011","Details":"The NBA suspended Aaron Brooks (Pho) for 1 game for throwing a ball at a ref during Friday's GS-Pho game."},
{"Date":"3/31/2011","Season":"2010-2011","Details":"The NBA suspended John Wall (Was) for 1 game and fined Juwan Howard (Mia) $35,000 and Zydrunas Ilgauskas (Mia) $25,000 for their altercation during Wednesday's Was-Mia game."},
{"Date":"4/1/2011","Season":"2010-2011","Details":"The NBA suspended Matt Barnes (LAL) for 1 game for escalating an altercation between Jason Terry (Dal) and Steve Blake (LAL) during Thursday's Dal-LAL game."},
{"Date":"4/7/2011","Season":"2010-2011","Details":"The NBA suspended Dwight Howard (Orl) for 1 game for receiving his 18th technical of the season (an automatic suspension)."},
{"Date":"4/7/2011","Season":"2010-2011","Details":"The NBA suspended Quentin Richardson (Orl) for 2 games for shoving Gerald Henderson (Cha) in the face during Wednesday's Orl-Cha game."},
{"Date":"4/8/2011","Season":"2010-2011","Details":"The NBA fined New Jersey $50,000 for co-owner Jay-Z having been in the University of Kentucky locker room during the NCAA tournament, which violated the NBA rule restricting contact between NBA personnel and underclassmen."},
{"Date":"4/9/2011","Season":"2010-2011","Details":"The LA Clippers suspended Eric Bledsoe for 1 game for violating team rules."},
{"Date":"4/13/2011","Season":"2010-2011","Details":"The NBA suspended Charlie Villanueva (Det) for 5 games for initiating an altercation with Ryan Hollins (Cle) during Monday's Det-Cle game and for attempting to escalate the altercation after his ejection by trying to enter Cleveland's locker room. He served the first game of the suspension Wednesday and the remaining 4 games will be served at the start of the next regular season."},
{"Date":"4/13/2011","Season":"2010-2011","Details":"The NBA fined Kobe Bryant (LAL) $100,000 for calling a ref a derogatory homosexual slur during Tuesday's LAL-SA game."},
{"Date":"4/14/2011","Season":"2010-2011","Details":"The NBA fined Phil Jackson (LAL) and the LA Lakers $75,000 each for comments Jackson made about the collective bargaining negotiations - Jackson's comments were about how many suspect that games will be missed next season. The league strictly prohibits NBA personnel from discussing publically anything about the negotiations."},
{"Date":"4/18/2011","Season":"2010-2011","Details":"The NBA fined Nate McMillan (Por) $35,000 for his post-game comments criticizing the officiating following Saturday's Por-Dal game."},
{"Date":"4/23/2011","Season":"2010-2011","Details":"The NBA suspended Zaza Pachulia (Atl) and Jason Richardson (Orl) for 1 game for their altercation during Friday's Atl-Orl game."},
{"Date":"5/5/2011","Season":"2010-2011","Details":"The NBA suspended Ron Artest (LAL) for 1 game and assessed him a flagrant foul for hitting J.J. Barea (Dal) in the face late in Wednesday's Dal-LAL game."},
{"Date":"5/8/2011","Season":"2010-2011","Details":"The NBA fined Phil Jackson (LAL) $35,000 for his comments to the media on Thursday about how the officials were not calling fouls committed on Pau Gasol (LAL)."},
{"Date":"5/10/2011","Season":"2010-2011","Details":"The NBA suspended Andrew Bynum (LAL) for 5 games for his flagrant foul on J.J. Barea (Dal) during Sunday's Dal-LAL game and fined him $25,000 for taking off his jersey as he left the court. Bynum will serve his suspension at the start of the next regular season."},
{"Date":"5/23/2011","Season":"2010-2011","Details":"The NBA fined Joakim Noah (Chi) $50,000 for making a homosexual slur against a fan during Sunday's Chi-Mia game."},
{"Date":"6/8/2011","Season":"2010-2011","Details":"The NBA fined Gilbert Arenas (Was) for comments he made on his Twitter page. The league did not announce the fine (but did confirm it) nor did they state the reason for the fine."},
{"Date":"9/12/2011","Season":"2011-2012","Details":"The NBA fined Charlotte owner Michael Jordan an undisclosed about (reported to be $100,000) for public comments he made about the collective bargaining process."},
{"Date":"10/31/2011","Season":"2011-2012","Details":"The NBA fined Miami owner Micky Arlson $500,000 for comments he made about the collective bargaining process on his Twitter account [all teams' personal are prohibited from making public comments about the lockout and negotiations]."},
{"Date":"12/23/2011","Season":"2011-2012","Details":"Due to the lockout shorten season, the NBA reduced Andrew Bynum's (LAL) 5 game suspension to 4 games and Charlie Villanueva's (Det) 5 game suspension to 4 games. Bynum's suspension is from a flagrant foul on an airborn J.J. Barea (then with Dal) during Game 4 of the LAL-Dal series in the 2nd round of the playoffs. Villanueva's suspension is from an altercation with Ryan Hollins (Cle) and trying to go after Hollins in the lockerroom in the 4/11/11 Det-Cle regular season game. Villanueva served 1 game of the suspension at the end of last season and will serve the remaining 3 games at the start of the 11-12 season."},
{"Date":"12/27/2011","Season":"2011-2012","Details":"The NBA suspended Drew Gooden (Mil) for 1 game for his flagrant foul on Gerald Henderson (Cha) during Tuesday's Cha-Mil games."},
{"Date":"1/2/2012","Season":"2011-2012","Details":"The NBA fined Josh Howard (Uta) $25,000 for his flagrant foul on James Anderson (SA) during Saturday's Uta-SA game."},
{"Date":"1/20/2012","Season":"2011-2012","Details":"Milwaukee suspended Stephen Jackson for 1 game for missing Friday morning's shootaround."},
{"Date":"1/21/2012","Season":"2011-2012","Details":"The NBA fined Derrick Favors (Uta) $25,000 for throwing the ball in to the standings during Thursday's Dal-Uta game."},
{"Date":"1/25/2012","Season":"2011-2012","Details":"The NBA suspended Robin Lopez (Pho) for 1 game for making contact with a ref during Tuesday's Pho-Tor game."},
{"Date":"1/28/2012","Season":"2011-2012","Details":"The NBA suspended Stephen Jackson (Mil) for 1 game for verbally abusing the ref and failure to leave the court in a timely manner during Friday's Mil-Chi game."},
{"Date":"2/3/2012","Season":"2011-2012","Details":"The NBA fined Dallas owner Mark Cuban $75,000 for criticizing the refs following Wednesday's Dal-OKC game."},
{"Date":"2/3/2012","Season":"2011-2012","Details":"The NBA fined Dallas coach Rick Carlisle $35,000 for kicking the ball into the stands during Wednesday's Dal-OKC game."},
{"Date":"2/3/2012","Season":"2011-2012","Details":"Orlando suspended Glen Davis for 2 games for conduct detrimental to the team. Davis reportedly got in a verbal argument with the head coach in practice."},
{"Date":"2/6/2012","Season":"2011-2012","Details":"The NBA suspended Kevin Love (Min) for 2 games for stomping on the upper body of Luis Scola (Hou) while Scola was on the floor during Saturday's Min-Hou game."},
{"Date":"2/6/2012","Season":"2011-2012","Details":"The NBA fined LA Lakers coach Mike Brown $25,000 and suspended him for 1 game for making contact with a ref and failing to leave the court in a timely manner following his ejection during Saturday's LAL-Uta game."},
{"Date":"2/15/2012","Season":"2011-2012","Details":"The NBA fined Howard Eisley (LAC assistant coach) $15,000 for verbally abusing a ref during Monday's Dal-LAC game."},
{"Date":"2/20/2012","Season":"2011-2012","Details":"The NBA suspended Rajon Rondo (Bos) for 2 games for throwing a ball at a ref during Sunday's Bos-Det game."},
{"Date":"3/7/2012","Season":"2011-2012","Details":"The NBA fined Jason Kidd (Dal) $25,000 for criticizing the refs following Monday's Dal-OKC game."},
{"Date":"3/9/2012","Season":"2011-2012","Details":"The NBA suspended Hedo Turkoglu (Orl) for 1 game for making contact with a ref during Thursday's Orl-Chi game."},
{"Date":"3/10/2012","Season":"2011-2012","Details":"The NBA fined J.R. Smith (NY) $25,000 for posting a picture of a scantily clad woman on his Twitter account."},
{"Date":"3/13/2012","Season":"2011-2012","Details":"The NBA fined Derrick Rose (Chi) $25,000 for criticizing the refs following Monday's Chi-NY game."},
{"Date":"3/19/2012","Season":"2011-2012","Details":"The NBA fined Patrick Patterson (Hou) $25,000 for criticizing the refs in comments he made on Twitter."},
{"Date":"3/23/2012","Season":"2011-2012","Details":"The NBA suspended Jason Smith (NO) for 2 games for his flagrant foul on Blake Griffin (LAC) during Thursday's LAC-NO game."},
{"Date":"3/24/2012","Season":"2011-2012","Details":"The NBA suspended Arron Afflalo (Den) for 1 game for throwing an elbow to Gordon Hayward's (Uta) head during Friday's Den-Uta game."},
{"Date":"3/28/2012","Season":"2011-2012","Details":"The NBA fined Glenn Davis (Orl) $35,000 for making an obscene gesture during Monday's Orl-Tor game."},
{"Date":"3/30/2012","Season":"2011-2012","Details":"The NBA fined Reggie Evans (LAC) $25,000 for making an obscene gesture during Monday's LAC-NO game."},
{"Date":"4/6/2012","Season":"2011-2012","Details":"The NBA fined DeMarcus Cousins (Sac) $25,000 for publicly criticizing the refs after Thursday's Sac-LAC game."},
{"Date":"4/9/2012","Season":"2011-2012","Details":"Orlando suspended Chris Duhon for 1 game for violating team rules."},
{"Date":"4/18/2012","Season":"2011-2012","Details":"The NBA fined Delonte West (Dal) $25,000 for giving Gordon Hayward (Uta) a wet willy (poking him in the ear with a finger) during Monday's Dal-Uta game."},
{"Date":"4/20/2012","Season":"2011-2012","Details":"The NBA suspended Larry Sanders (Mil) for 2 games for starting an altercation and failing to leave the court in a timely manner during Thursday's Ind-Mil game. The NBA fined Danny Granger (Ind) and David West (Ind) $25,000 each for their roles in the altercation."},
{"Date":"4/23/2012","Season":"2011-2012","Details":"The NBA fined Doug Collins (Phi) $15,000 for verbal abuse of a ref."},
{"Date":"4/24/2012","Season":"2011-2012","Details":"The NBA suspended Metta World Peace (LAL) for 7 games for elbowing James Harden (OKC) in the head during Sunday's OKC-LAL game. The suspension will take placed for the Lakers' last regular season game and first 6 playoff games [if the Lakers were to lose in less than 6 games, then the remaining suspension games would occur at the start of the 12-13 regular season]."},
{"Date":"4/30/2012","Season":"2011-2012","Details":"The NBA suspended Rajon Rondo (Bos) for 1 game for making contact with a ref during Sunday's Bos-Atl game."},
{"Date":"5/12/2012","Season":"2011-2012","Details":"The NBA fined Frank Vogel (Ind) $15,000 for his comments about how he feels the refs should call the Mia-Ind series."},
{"Date":"5/12/2012","Season":"2011-2012","Details":"The NBA fined Ivan Johnson (Atl) $25,000 for using an obscene gesture towards fans during Thursday's Bos-Atl game."},
{"Date":"5/12/2012","Season":"2011-2012","Details":"The NBA fined Atl owner Michael Gearon for publicly criticizing the refs and making negative comments about Kevin Garnett (Bos) [calling him a dirty player]."},
{"Date":"5/16/2012","Season":"2011-2012","Details":"The NBA fined Devin Ebanks (LAL) $25,000 for his actions prior and following his ejection during Monday's LAL-OKC games."},
{"Date":"5/16/2012","Season":"2011-2012","Details":"The NBA fined Andrew Bynum (LAL) $15,000 for failing to make himself available to the media following Tuesday's practice."},
{"Date":"5/23/2012","Season":"2011-2012","Details":"The NBA suspended Dexter Pittman (Mia) for 3 games for his flagrant foul on Lance Stephenson during Tuesday's Ind-Mia game."},
{"Date":"5/23/2012","Season":"2011-2012","Details":"The NBA suspended Udonis Haslem (Mia) for 1 game for his flagrant foul on Tyler Hansbrough (Ind) during Tuesday's Ind-Mia game."},
{"Date":"5/25/2012","Season":"2011-2012","Details":"The NBA fined Erik Spoelstra (Mia) $25,000 for his comments to the press on Thursday about how the Mia-Ind series was officiated."},
{"Date":"6/13/2012","Season":"2011-2012","Details":"The NBA fined Kevin Garnett (Bos) $25,000 for failing to make himself available to the media following Saturday's Game 7 Bos-Mia game."},
{"Date":"6/26/2012","Season":"2011-2012","Details":"The NBA fined Amare Stoudemire (NY) $50,000 for using offensive language(homosexual slur) in a Twitter message."}]